Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
/* Based on CPU DB MC9S12XEP100_208, version 3.00.017 (RegistersPrg V2.24) */
/*
** ###################################################################
**     Filename  : mc9s12xep100.h
**     Processor : MC9S12XEP100CVL
**     FileFormat: V2.24
**     DataSheet : MC9S12XEP100 Rev. 1.16 5/2008
**     Compiler  : CodeWarrior compiler
**     Date/Time : 29.10.2008, 8:25
**     Abstract  :
**         This header implements the mapping of I/O devices.
**
**     (c) Copyright UNIS, a.s. 1997-2008
**     UNIS, a.s.
**     Jundrovska 33
**     624 00 Brno
**     Czech Republic
**     http      : www.processorexpert.com
**     mail      : info@processorexpert.com
**
**     CPU Registers Revisions:
**      - 02.05.2006, VV2.87.010:
**              - Corrected registers addresses:
**              - MPUSEL 118 => 119
**              - MPUDESC0 119 => 11A
**              - MPUDESC1 11A => 11B
**              - MPUDESC2 11B => 11C
**              - MPUDESC3 11C => 11D
**              - MPUDESC4 11D => 11E
**              - MPUDESC5 11E => 11F
**              -   REASON: Bug-fix (#3266 from UNIS issue manager)
**      - 15.08.2006, VV2.87.059:
**              - Added register POSTDIV.
**              -   REASON: Bug-fix (#3605 from UNIS issue manager)
**      - 17.04.2007, VV2.87.089:
**              - Renamed bits DBGXDH_BIT0..7 ==> DBGXDH_BIT8..15, SYNR_SYNx ==> SYNR_SYNDIVx,
**              - REFDV_REFDVx ==> REFDV_REFDIVx,ECT_PAyH_BITx ==> ECT_PAyH_PAyHx, ECT_TCyH_BITx ==> ECT_TCyH_TCx, ATD1CTL2_ASCIF ==>  ATD1CTL2_ACMPIE,
**              - FCLKDIV_PRDIV8 ==> FCLKDIV_FDIV6, TIM_TCNTH/L_BITx ==> TIM_TCNTH/L_TCNTx, TIM_PACNT_BITx ==> TIM_PACNT_PACNTx,
**              - NVFPROT_NV6 ==>  NVFPROT_RNV6, NVFSEC_NVx ==>  NVFSEC_RNVx.
**              - Renamed registers XGIF0 ==> XGIF_7F_70 ... XGIF7 ==> XGIF_0F_00.
**              - Renamed CAN buffers *RX/TX* ==> *R/T*(for example CAN1TXIDR1 ==> CAN1TIDR1).
**              - Redefined PT/DDR/RDR/PERxAD0/1 registers.
**              - Removed bits TILD/PITCNT4..7_*.
**              -   REASON: Bug-fix (#4548 from UNIS issue manager).
**      - 04.10.2007, V3.00.0:
**              - Renamed bits IICx_IBAD[ADx] ==> IICx_IBAD[ADRx], IICx_IBCR2[ADx] ==> IICx_IBCR2[ADRx].
**              -   REASON: Bug-fix (#5072 from UNIS issue manager).
**              - Removed bits PAxH_BIT0..BIT7/15, TCxH..BIT0..BIT7/15.
**              -   REASON: Access to the individual bits is not necessary (issue #5192 from the UNIS Issue Manager).
**              - Renamed interrupt vectors Vtimpabovf ==> Vectpabovf, Vtimmdcu ==> Vectmdcu, VReserved65 ==> Vhti, Vflashfault ==> Vflashfd.
**              - Renamed bits ATDxCTL2_AWAI ==> ATDxCTL2_ICLKSTP, XGMCTL_XGSWEIFM ==> XGMCTL_XGSWEFM, NVFSEC_RNV6 ==> NVFSEC_KEYEN0.
**              - Renamed CAN Buffers: *R/T* ==> *RX/TX* (for example CAN1TIDR1 ==> CAN1TXIDR1).
**              - Removed register TIM_TPORTE.
**              - Removed bits FERCNFG_EACCEIE, TIM_TCNT, TIM_TCx, TIM_PACNTx.
**              - Added register VREGHTTR, added bits VREGHTCL[HTIF, HTIE, HTDS, HTEN].
**              - Corrected registers addresses: NVEPROT 0xFF0C => 0xFF0D, NVFPROT 0xFF0D => 0xFF0C.
**              -   REASON: Bug-fix (#5330 from UNIS issue manager).
**      - 22.02.2008, V3.00.1:
**              - Added registers PACNTH(0x03F2), PACNTL(0x03F3).
**              -   REASON: Bug-fix (#5852 from Unis Issue Manager).
**      - 05.11.2008, V3.00.2:
**              - Corrected definition of depreciated symbols.
**              -   REASON: Bug-fix(#6592 from the Unis Issue Manager).
**
**     File-Format-Revisions:
**      - 27.10.2006, V2.10 :
**               - __RESET_WATCHDOG improved formating and re-definition
**      - 23.11.2006, V2.11 :
**               - Changes have not affected this file (because they are related to another family)
**      - 22.01.2007, V2.12 :
**               - Fixed declaration of non volatile registers. Now it does not require (but allows) their initialization, see issue #4086.
**      - 01.03.2007, V2.13 :
**               - Flash commands constants values converted to HEX format
**      - 02.03.2007, V2.14 :
**               - Interrupt vector numbers added into .H, see VectorNumber_*
**      - 26.03.2007, V2.15 :
**               - Changes have not affected this file (because they are related to another family)
**      - 10.05.2007, V2.16 :
**               - Changes have not affected this file (because they are related to another family)
**      - 05.06.2007, V2.17 :
**               - Changes have not affected this file (because they are related to another family)
**      - 19.07.2007, V2.18 :
**               - Improved number of blanked lines inside register structures
**      - 06.08.2007, V2.19 :
**               - CPUDB revisions generated ahead of the file-format revisions.
**      - 11.09.2007, V2.20 :
**               - Added comment about initialization of unbonded pins.
**      - 02.01.2008, V2.21 :
**               - Changes have not affected this file (because they are related to another family)
**      - 13.02.2008, V2.22 :
**               - Changes have not affected this file (because they are related to another family)
**      - 20.02.2008, V2.23 :
**               - Termination of pragma V30toV31Compatible added, #5708
**      - 03.07.2008, V2.24 :
**               - Added support for bits with name starting with number (like "1HZ")
**
**     Not all general-purpose I/O pins are available on all packages or on all mask sets of a specific
**     derivative device. To avoid extra current drain from floating input pins, the user’s reset
**     initialization routine in the application program must either enable on-chip pull-up devices
**     or change the direction of unconnected pins to outputs so the pins do not float.
** ###################################################################
*/

#ifndef _MC9S12XEP100_H
#define _MC9S12XEP100_H

/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106   /* WARNING C1106: Non-standard bitfield type */
#pragma OPTION ADD V30toV31Compatible "-BfaGapLimitBits4294967295" /*this guarantee correct bitfield positions*/

