Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
/**************** interrupt vector numbers ****************/
#define VectorNumber_Vsi                119
#define VectorNumber_Vsyscall           118
#define VectorNumber_Vmpuaccesserr      117
#define VectorNumber_Vxsei              116
#define VectorNumber_VReserved115       115
#define VectorNumber_VReserved114       114
#define VectorNumber_VReserved113       113
#define VectorNumber_VReserved112       112
#define VectorNumber_VReserved111       111
#define VectorNumber_VReserved110       110
#define VectorNumber_VReserved109       109
#define VectorNumber_VReserved108       108
#define VectorNumber_VReserved107       107
#define VectorNumber_VReserved106       106
#define VectorNumber_VReserved105       105
#define VectorNumber_VReserved104       104
#define VectorNumber_VReserved103       103
#define VectorNumber_VReserved102       102
#define VectorNumber_VReserved101       101
#define VectorNumber_VReserved100       100
#define VectorNumber_VReserved99        99
#define VectorNumber_VReserved98        98
#define VectorNumber_Vatd1compare       97
#define VectorNumber_Vatd0compare       96
#define VectorNumber_Vtimpaie           95
#define VectorNumber_Vtimpaaovf         94
#define VectorNumber_Vtimovf            93
#define VectorNumber_Vtimch7            92
#define VectorNumber_Vtimch6            91
#define VectorNumber_Vtimch5            90
#define VectorNumber_Vtimch4            89
#define VectorNumber_Vtimch3            88
#define VectorNumber_Vtimch2            87
#define VectorNumber_Vtimch1            86
#define VectorNumber_Vtimch0            85
#define VectorNumber_Vsci7              84
#define VectorNumber_Vpit7              83
#define VectorNumber_Vpit6              82
#define VectorNumber_Vpit5              81
#define VectorNumber_Vpit4              80
#define VectorNumber_VReserved79        79
#define VectorNumber_VReserved78        78
#define VectorNumber_Vxst7              77
#define VectorNumber_Vxst6              76
#define VectorNumber_Vxst5              75
#define VectorNumber_Vxst4              74
#define VectorNumber_Vxst3              73
#define VectorNumber_Vxst2              72
#define VectorNumber_Vxst1              71
#define VectorNumber_Vxst0              70
#define VectorNumber_Vpit3              69
#define VectorNumber_Vpit2              68
#define VectorNumber_Vpit1              67
#define VectorNumber_Vpit0              66
#define VectorNumber_Vhti               65
#define VectorNumber_Vapi               64
#define VectorNumber_Vlvi               63
#define VectorNumber_Viic1              62
#define VectorNumber_Vsci5              61
#define VectorNumber_Vsci4              60
#define VectorNumber_Vsci3              59
#define VectorNumber_Vsci2              58
#define VectorNumber_Vpwmesdn           57
#define VectorNumber_Vportp             56
#define VectorNumber_Vcan4tx            55
#define VectorNumber_Vcan4rx            54
#define VectorNumber_Vcan4err           53
#define VectorNumber_Vcan4wkup          52
#define VectorNumber_Vcan3tx            51
#define VectorNumber_Vcan3rx            50
#define VectorNumber_Vcan3err           49
#define VectorNumber_Vcan3wkup          48
#define VectorNumber_Vcan2tx            47
#define VectorNumber_Vcan2rx            46
#define VectorNumber_Vcan2err           45
#define VectorNumber_Vcan2wkup          44
#define VectorNumber_Vcan1tx            43
#define VectorNumber_Vcan1rx            42
#define VectorNumber_Vcan1err           41
#define VectorNumber_Vcan1wkup          40
#define VectorNumber_Vcan0tx            39
#define VectorNumber_Vcan0rx            38
#define VectorNumber_Vcan0err           37
#define VectorNumber_Vcan0wkup          36
#define VectorNumber_Vflash             35
#define VectorNumber_Vflashfd           34
#define VectorNumber_Vspi2              33
#define VectorNumber_Vspi1              32
#define VectorNumber_Viic0              31
#define VectorNumber_Vsci6              30
#define VectorNumber_Vcrgscm            29
#define VectorNumber_Vcrgplllck         28
#define VectorNumber_Vectpabovf         27
#define VectorNumber_Vectmdcu           26
#define VectorNumber_Vporth             25
#define VectorNumber_Vportj             24
#define VectorNumber_Vatd1              23
#define VectorNumber_Vatd0              22
#define VectorNumber_Vsci1              21
#define VectorNumber_Vsci0              20
#define VectorNumber_Vspi0              19
#define VectorNumber_Vectpaie           18
#define VectorNumber_Vectpaaovf         17
#define VectorNumber_Vectovf            16
#define VectorNumber_Vectch7            15
#define VectorNumber_Vectch6            14
#define VectorNumber_Vectch5            13
#define VectorNumber_Vectch4            12
#define VectorNumber_Vectch3            11
#define VectorNumber_Vectch2            10
#define VectorNumber_Vectch1            9
#define VectorNumber_Vectch0            8
#define VectorNumber_Vrti               7
#define VectorNumber_Virq               6
#define VectorNumber_Vxirq              5
#define VectorNumber_Vswi               4
#define VectorNumber_Vtrap              3
#define VectorNumber_Vcop               2
#define VectorNumber_Vclkmon            1
#define VectorNumber_Vreset             0

/**************** interrupt vector table ****************/
#define Vsi                             0x0000FF10
#define Vsyscall                        0x0000FF12
#define Vmpuaccesserr                   0x0000FF14
#define Vxsei                           0x0000FF16
#define VReserved115                    0x0000FF18
#define VReserved114                    0x0000FF1A
#define VReserved113                    0x0000FF1C
#define VReserved112                    0x0000FF1E
#define VReserved111                    0x0000FF20
#define VReserved110                    0x0000FF22
#define VReserved109                    0x0000FF24
#define VReserved108                    0x0000FF26
#define VReserved107                    0x0000FF28
#define VReserved106                    0x0000FF2A
#define VReserved105                    0x0000FF2C
#define VReserved104                    0x0000FF2E
#define VReserved103                    0x0000FF30
#define VReserved102                    0x0000FF32
#define VReserved101                    0x0000FF34
#define VReserved100                    0x0000FF36
#define VReserved99                     0x0000FF38
#define VReserved98                     0x0000FF3A
#define Vatd1compare                    0x0000FF3C
#define Vatd0compare                    0x0000FF3E
#define Vtimpaie                        0x0000FF40
#define Vtimpaaovf                      0x0000FF42
#define Vtimovf                         0x0000FF44
#define Vtimch7                         0x0000FF46
#define Vtimch6                         0x0000FF48
#define Vtimch5                         0x0000FF4A
#define Vtimch4                         0x0000FF4C
#define Vtimch3                         0x0000FF4E
#define Vtimch2                         0x0000FF50
#define Vtimch1                         0x0000FF52
#define Vtimch0                         0x0000FF54
#define Vsci7                           0x0000FF56
#define Vpit7                           0x0000FF58
#define Vpit6                           0x0000FF5A
#define Vpit5                           0x0000FF5C
#define Vpit4                           0x0000FF5E
#define VReserved79                     0x0000FF60
#define VReserved78                     0x0000FF62
#define Vxst7                           0x0000FF64
#define Vxst6                           0x0000FF66
#define Vxst5                           0x0000FF68
#define Vxst4                           0x0000FF6A
#define Vxst3                           0x0000FF6C
#define Vxst2                           0x0000FF6E
#define Vxst1                           0x0000FF70
#define Vxst0                           0x0000FF72
#define Vpit3                           0x0000FF74
#define Vpit2                           0x0000FF76
#define Vpit1                           0x0000FF78
#define Vpit0                           0x0000FF7A
#define Vhti                            0x0000FF7C
#define Vapi                            0x0000FF7E
#define Vlvi                            0x0000FF80
#define Viic1                           0x0000FF82
#define Vsci5                           0x0000FF84
#define Vsci4                           0x0000FF86
#define Vsci3                           0x0000FF88
#define Vsci2                           0x0000FF8A
#define Vpwmesdn                        0x0000FF8C
#define Vportp                          0x0000FF8E
#define Vcan4tx                         0x0000FF90
#define Vcan4rx                         0x0000FF92
#define Vcan4err                        0x0000FF94
#define Vcan4wkup                       0x0000FF96
#define Vcan3tx                         0x0000FF98
#define Vcan3rx                         0x0000FF9A
#define Vcan3err                        0x0000FF9C
#define Vcan3wkup                       0x0000FF9E
#define Vcan2tx                         0x0000FFA0
#define Vcan2rx                         0x0000FFA2
#define Vcan2err                        0x0000FFA4
#define Vcan2wkup                       0x0000FFA6
#define Vcan1tx                         0x0000FFA8
#define Vcan1rx                         0x0000FFAA
#define Vcan1err                        0x0000FFAC
#define Vcan1wkup                       0x0000FFAE
#define Vcan0tx                         0x0000FFB0
#define Vcan0rx                         0x0000FFB2
#define Vcan0err                        0x0000FFB4
#define Vcan0wkup                       0x0000FFB6
#define Vflash                          0x0000FFB8
#define Vflashfd                        0x0000FFBA
#define Vspi2                           0x0000FFBC
#define Vspi1                           0x0000FFBE
#define Viic0                           0x0000FFC0
#define Vsci6                           0x0000FFC2
#define Vcrgscm                         0x0000FFC4
#define Vcrgplllck                      0x0000FFC6
#define Vectpabovf                      0x0000FFC8
#define Vectmdcu                        0x0000FFCA
#define Vporth                          0x0000FFCC
#define Vportj                          0x0000FFCE
#define Vatd1                           0x0000FFD0
#define Vatd0                           0x0000FFD2
#define Vsci1                           0x0000FFD4
#define Vsci0                           0x0000FFD6
#define Vspi0                           0x0000FFD8
#define Vectpaie                        0x0000FFDA
#define Vectpaaovf                      0x0000FFDC
#define Vectovf                         0x0000FFDE
#define Vectch7                         0x0000FFE0
#define Vectch6                         0x0000FFE2
#define Vectch5                         0x0000FFE4
#define Vectch4                         0x0000FFE6
#define Vectch3                         0x0000FFE8
#define Vectch2                         0x0000FFEA
#define Vectch1                         0x0000FFEC
#define Vectch0                         0x0000FFEE
#define Vrti                            0x0000FFF0
#define Virq                            0x0000FFF2
#define Vxirq                           0x0000FFF4
#define Vswi                            0x0000FFF6
#define Vtrap                           0x0000FFF8
#define Vcop                            0x0000FFFA
#define Vclkmon                         0x0000FFFC
#define Vreset                          0x0000FFFE

/**************** registers I/O map ****************/

