Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
extern volatile ECT_TCTL2STR _ECT_TCTL2 @(REG_BASE + 0x00000049);
#define ECT_TCTL2                       _ECT_TCTL2.Byte
#define ECT_TCTL2_OL0                   _ECT_TCTL2.Bits.OL0
#define ECT_TCTL2_OM0                   _ECT_TCTL2.Bits.OM0
#define ECT_TCTL2_OL1                   _ECT_TCTL2.Bits.OL1
#define ECT_TCTL2_OM1                   _ECT_TCTL2.Bits.OM1
#define ECT_TCTL2_OL2                   _ECT_TCTL2.Bits.OL2
#define ECT_TCTL2_OM2                   _ECT_TCTL2.Bits.OM2
#define ECT_TCTL2_OL3                   _ECT_TCTL2.Bits.OL3
#define ECT_TCTL2_OM3                   _ECT_TCTL2.Bits.OM3

#define ECT_TCTL2_OL0_MASK              1
#define ECT_TCTL2_OM0_MASK              2
#define ECT_TCTL2_OL1_MASK              4
#define ECT_TCTL2_OM1_MASK              8
#define ECT_TCTL2_OL2_MASK              16
#define ECT_TCTL2_OM2_MASK              32
#define ECT_TCTL2_OL3_MASK              64
#define ECT_TCTL2_OM3_MASK              128


/*** ECT_TCTL3 - Timer Control Register 3; 0x0000004A ***/
typedef union {
  byte Byte;
  struct {
    byte EDG4A       :1;                                       /* Input Capture Edge Control 4A */
    byte EDG4B       :1;                                       /* Input Capture Edge Control 4B */
    byte EDG5A       :1;                                       /* Input Capture Edge Control 5A */
    byte EDG5B       :1;                                       /* Input Capture Edge Control 5B */
    byte EDG6A       :1;                                       /* Input Capture Edge Control 6A */
    byte EDG6B       :1;                                       /* Input Capture Edge Control 6B */
    byte EDG7A       :1;                                       /* Input Capture Edge Control 7A */
    byte EDG7B       :1;                                       /* Input Capture Edge Control 7B */
  } Bits;
  struct {
    byte grpEDG4x :2;
    byte grpEDG5x :2;
    byte grpEDG6x :2;
    byte grpEDG7x :2;
  } MergedBits;
} ECT_TCTL3STR;
extern volatile ECT_TCTL3STR _ECT_TCTL3 @(REG_BASE + 0x0000004A);
#define ECT_TCTL3                       _ECT_TCTL3.Byte
#define ECT_TCTL3_EDG4A                 _ECT_TCTL3.Bits.EDG4A
#define ECT_TCTL3_EDG4B                 _ECT_TCTL3.Bits.EDG4B
#define ECT_TCTL3_EDG5A                 _ECT_TCTL3.Bits.EDG5A
#define ECT_TCTL3_EDG5B                 _ECT_TCTL3.Bits.EDG5B
#define ECT_TCTL3_EDG6A                 _ECT_TCTL3.Bits.EDG6A
#define ECT_TCTL3_EDG6B                 _ECT_TCTL3.Bits.EDG6B
#define ECT_TCTL3_EDG7A                 _ECT_TCTL3.Bits.EDG7A
#define ECT_TCTL3_EDG7B                 _ECT_TCTL3.Bits.EDG7B
#define ECT_TCTL3_EDG4x                 _ECT_TCTL3.MergedBits.grpEDG4x
#define ECT_TCTL3_EDG5x                 _ECT_TCTL3.MergedBits.grpEDG5x
#define ECT_TCTL3_EDG6x                 _ECT_TCTL3.MergedBits.grpEDG6x
#define ECT_TCTL3_EDG7x                 _ECT_TCTL3.MergedBits.grpEDG7x

#define ECT_TCTL3_EDG4A_MASK            1
#define ECT_TCTL3_EDG4B_MASK            2
#define ECT_TCTL3_EDG5A_MASK            4
#define ECT_TCTL3_EDG5B_MASK            8
#define ECT_TCTL3_EDG6A_MASK            16
#define ECT_TCTL3_EDG6B_MASK            32
#define ECT_TCTL3_EDG7A_MASK            64
#define ECT_TCTL3_EDG7B_MASK            128
#define ECT_TCTL3_EDG4x_MASK            3
#define ECT_TCTL3_EDG4x_BITNUM          0
#define ECT_TCTL3_EDG5x_MASK            12
#define ECT_TCTL3_EDG5x_BITNUM          2
#define ECT_TCTL3_EDG6x_MASK            48
#define ECT_TCTL3_EDG6x_BITNUM          4
#define ECT_TCTL3_EDG7x_MASK            192
#define ECT_TCTL3_EDG7x_BITNUM          6


/*** ECT_TCTL4 - Timer Control Register 4; 0x0000004B ***/
typedef union {
  byte Byte;
  struct {
    byte EDG0A       :1;                                       /* Input Capture Edge Control 0A */
    byte EDG0B       :1;                                       /* Input Capture Edge Control 0B */
    byte EDG1A       :1;                                       /* Input Capture Edge Control 1A */
    byte EDG1B       :1;                                       /* Input Capture Edge Control 1B */
    byte EDG2A       :1;                                       /* Input Capture Edge Control 2A */
    byte EDG2B       :1;                                       /* Input Capture Edge Control 2B */
    byte EDG3A       :1;                                       /* Input Capture Edge Control 3A */
    byte EDG3B       :1;                                       /* Input Capture Edge Control 3B */
  } Bits;
  struct {
    byte grpEDG0x :2;
    byte grpEDG1x :2;
    byte grpEDG2x :2;
    byte grpEDG3x :2;
  } MergedBits;
} ECT_TCTL4STR;
extern volatile ECT_TCTL4STR _ECT_TCTL4 @(REG_BASE + 0x0000004B);
#define ECT_TCTL4                       _ECT_TCTL4.Byte
#define ECT_TCTL4_EDG0A                 _ECT_TCTL4.Bits.EDG0A
#define ECT_TCTL4_EDG0B                 _ECT_TCTL4.Bits.EDG0B
#define ECT_TCTL4_EDG1A                 _ECT_TCTL4.Bits.EDG1A
#define ECT_TCTL4_EDG1B                 _ECT_TCTL4.Bits.EDG1B
#define ECT_TCTL4_EDG2A                 _ECT_TCTL4.Bits.EDG2A
#define ECT_TCTL4_EDG2B                 _ECT_TCTL4.Bits.EDG2B
#define ECT_TCTL4_EDG3A                 _ECT_TCTL4.Bits.EDG3A
#define ECT_TCTL4_EDG3B                 _ECT_TCTL4.Bits.EDG3B
#define ECT_TCTL4_EDG0x                 _ECT_TCTL4.MergedBits.grpEDG0x
#define ECT_TCTL4_EDG1x                 _ECT_TCTL4.MergedBits.grpEDG1x
#define ECT_TCTL4_EDG2x                 _ECT_TCTL4.MergedBits.grpEDG2x
#define ECT_TCTL4_EDG3x                 _ECT_TCTL4.MergedBits.grpEDG3x

#define ECT_TCTL4_EDG0A_MASK            1
#define ECT_TCTL4_EDG0B_MASK            2
#define ECT_TCTL4_EDG1A_MASK            4
#define ECT_TCTL4_EDG1B_MASK            8
#define ECT_TCTL4_EDG2A_MASK            16
#define ECT_TCTL4_EDG2B_MASK            32
#define ECT_TCTL4_EDG3A_MASK            64
#define ECT_TCTL4_EDG3B_MASK            128
#define ECT_TCTL4_EDG0x_MASK            3
#define ECT_TCTL4_EDG0x_BITNUM          0
#define ECT_TCTL4_EDG1x_MASK            12
#define ECT_TCTL4_EDG1x_BITNUM          2
#define ECT_TCTL4_EDG2x_MASK            48
#define ECT_TCTL4_EDG2x_BITNUM          4
#define ECT_TCTL4_EDG3x_MASK            192
#define ECT_TCTL4_EDG3x_BITNUM          6


/*** ECT_TIE - Timer Interrupt Enable Register; 0x0000004C ***/
typedef union {
  byte Byte;
  struct {
    byte C0I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 0 */
    byte C1I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 1 */
    byte C2I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 2 */
    byte C3I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 3 */
    byte C4I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 4 */
    byte C5I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 5 */
    byte C6I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 6 */
    byte C7I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 7 */
  } Bits;
} ECT_TIESTR;
extern volatile ECT_TIESTR _ECT_TIE @(REG_BASE + 0x0000004C);
#define ECT_TIE                         _ECT_TIE.Byte
#define ECT_TIE_C0I                     _ECT_TIE.Bits.C0I
#define ECT_TIE_C1I                     _ECT_TIE.Bits.C1I
#define ECT_TIE_C2I                     _ECT_TIE.Bits.C2I
#define ECT_TIE_C3I                     _ECT_TIE.Bits.C3I
#define ECT_TIE_C4I                     _ECT_TIE.Bits.C4I
#define ECT_TIE_C5I                     _ECT_TIE.Bits.C5I
#define ECT_TIE_C6I                     _ECT_TIE.Bits.C6I
#define ECT_TIE_C7I                     _ECT_TIE.Bits.C7I

#define ECT_TIE_C0I_MASK                1
#define ECT_TIE_C1I_MASK                2
#define ECT_TIE_C2I_MASK                4
#define ECT_TIE_C3I_MASK                8
#define ECT_TIE_C4I_MASK                16
#define ECT_TIE_C5I_MASK                32
#define ECT_TIE_C6I_MASK                64
#define ECT_TIE_C7I_MASK                128


/*** ECT_TSCR2 - Timer System Control Register 2; 0x0000004D ***/
typedef union {
  byte Byte;
  struct {
    byte PR0         :1;                                       /* Timer Prescaler Select Bit 0 */
    byte PR1         :1;                                       /* Timer Prescaler Select Bit 1 */
    byte PR2         :1;                                       /* Timer Prescaler Select Bit 2 */
    byte TCRE        :1;                                       /* Timer Counter Reset Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte TOI         :1;                                       /* Timer Overflow Interrupt Enable */
  } Bits;
  struct {
    byte grpPR   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ECT_TSCR2STR;
extern volatile ECT_TSCR2STR _ECT_TSCR2 @(REG_BASE + 0x0000004D);
#define ECT_TSCR2                       _ECT_TSCR2.Byte
#define ECT_TSCR2_PR0                   _ECT_TSCR2.Bits.PR0
#define ECT_TSCR2_PR1                   _ECT_TSCR2.Bits.PR1
#define ECT_TSCR2_PR2                   _ECT_TSCR2.Bits.PR2
#define ECT_TSCR2_TCRE                  _ECT_TSCR2.Bits.TCRE
#define ECT_TSCR2_TOI                   _ECT_TSCR2.Bits.TOI
#define ECT_TSCR2_PR                    _ECT_TSCR2.MergedBits.grpPR

#define ECT_TSCR2_PR0_MASK              1
#define ECT_TSCR2_PR1_MASK              2
#define ECT_TSCR2_PR2_MASK              4
#define ECT_TSCR2_TCRE_MASK             8
#define ECT_TSCR2_TOI_MASK              128
#define ECT_TSCR2_PR_MASK               7
#define ECT_TSCR2_PR_BITNUM             0


/*** ECT_TFLG1 - Main Timer Interrupt Flag 1; 0x0000004E ***/
typedef union {
  byte Byte;
  struct {
    byte C0F         :1;                                       /* Input Capture/Output Compare Channel Flag 0 */
    byte C1F         :1;                                       /* Input Capture/Output Compare Channel Flag 1 */
    byte C2F         :1;                                       /* Input Capture/Output Compare Channel Flag 2 */
    byte C3F         :1;                                       /* Input Capture/Output Compare Channel Flag 3 */
    byte C4F         :1;                                       /* Input Capture/Output Compare Channel Flag 4 */
    byte C5F         :1;                                       /* Input Capture/Output Compare Channel Flag 5 */
    byte C6F         :1;                                       /* Input Capture/Output Compare Channel Flag 6 */
    byte C7F         :1;                                       /* Input Capture/Output Compare Channel Flag 7 */
  } Bits;
} ECT_TFLG1STR;
extern volatile ECT_TFLG1STR _ECT_TFLG1 @(REG_BASE + 0x0000004E);
#define ECT_TFLG1                       _ECT_TFLG1.Byte
#define ECT_TFLG1_C0F                   _ECT_TFLG1.Bits.C0F
#define ECT_TFLG1_C1F                   _ECT_TFLG1.Bits.C1F
#define ECT_TFLG1_C2F                   _ECT_TFLG1.Bits.C2F
#define ECT_TFLG1_C3F                   _ECT_TFLG1.Bits.C3F
#define ECT_TFLG1_C4F                   _ECT_TFLG1.Bits.C4F
#define ECT_TFLG1_C5F                   _ECT_TFLG1.Bits.C5F
#define ECT_TFLG1_C6F                   _ECT_TFLG1.Bits.C6F
#define ECT_TFLG1_C7F                   _ECT_TFLG1.Bits.C7F

