Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define ECT_TFLG1_C0F_MASK              1
#define ECT_TFLG1_C1F_MASK              2
#define ECT_TFLG1_C2F_MASK              4
#define ECT_TFLG1_C3F_MASK              8
#define ECT_TFLG1_C4F_MASK              16
#define ECT_TFLG1_C5F_MASK              32
#define ECT_TFLG1_C6F_MASK              64
#define ECT_TFLG1_C7F_MASK              128


/*** ECT_TFLG2 - Main Timer Interrupt Flag 2; 0x0000004F ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte TOF         :1;                                       /* Timer Overflow Flag */
  } Bits;
} ECT_TFLG2STR;
extern volatile ECT_TFLG2STR _ECT_TFLG2 @(REG_BASE + 0x0000004F);
#define ECT_TFLG2                       _ECT_TFLG2.Byte
#define ECT_TFLG2_TOF                   _ECT_TFLG2.Bits.TOF

#define ECT_TFLG2_TOF_MASK              128


/*** ECT_TC0 - Timer Input Capture/Output Compare Register 0; 0x00000050 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC0Hi - Timer Input Capture/Output Compare Register 0 High; 0x00000050 ***/
    union {
      byte Byte;
    } ECT_TC0HiSTR;
    #define ECT_TC0Hi                   _ECT_TC0.Overlap_STR.ECT_TC0HiSTR.Byte
    

    /*** ECT_TC0Lo - Timer Input Capture/Output Compare Register 0 Low; 0x00000051 ***/
    union {
      byte Byte;
    } ECT_TC0LoSTR;
    #define ECT_TC0Lo                   _ECT_TC0.Overlap_STR.ECT_TC0LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC0STR;
extern volatile ECT_TC0STR _ECT_TC0 @(REG_BASE + 0x00000050);
#define ECT_TC0                         _ECT_TC0.Word
/* ECT_TC_ARR: Access 8 ECT_TCx registers in an array */
#define ECT_TC_ARR                      ((volatile word *) &ECT_TC0)


/*** ECT_TC1 - Timer Input Capture/Output Compare Register 1; 0x00000052 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC1Hi - Timer Input Capture/Output Compare Register 1 High; 0x00000052 ***/
    union {
      byte Byte;
    } ECT_TC1HiSTR;
    #define ECT_TC1Hi                   _ECT_TC1.Overlap_STR.ECT_TC1HiSTR.Byte
    

    /*** ECT_TC1Lo - Timer Input Capture/Output Compare Register 1 Low; 0x00000053 ***/
    union {
      byte Byte;
    } ECT_TC1LoSTR;
    #define ECT_TC1Lo                   _ECT_TC1.Overlap_STR.ECT_TC1LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC1STR;
extern volatile ECT_TC1STR _ECT_TC1 @(REG_BASE + 0x00000052);
#define ECT_TC1                         _ECT_TC1.Word


/*** ECT_TC2 - Timer Input Capture/Output Compare Register 2; 0x00000054 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC2Hi - Timer Input Capture/Output Compare Register 2 High; 0x00000054 ***/
    union {
      byte Byte;
    } ECT_TC2HiSTR;
    #define ECT_TC2Hi                   _ECT_TC2.Overlap_STR.ECT_TC2HiSTR.Byte
    

    /*** ECT_TC2Lo - Timer Input Capture/Output Compare Register 2 Low; 0x00000055 ***/
    union {
      byte Byte;
    } ECT_TC2LoSTR;
    #define ECT_TC2Lo                   _ECT_TC2.Overlap_STR.ECT_TC2LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC2STR;
extern volatile ECT_TC2STR _ECT_TC2 @(REG_BASE + 0x00000054);
#define ECT_TC2                         _ECT_TC2.Word


/*** ECT_TC3 - Timer Input Capture/Output Compare Register 3; 0x00000056 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC3Hi - Timer Input Capture/Output Compare Register 3 High; 0x00000056 ***/
    union {
      byte Byte;
    } ECT_TC3HiSTR;
    #define ECT_TC3Hi                   _ECT_TC3.Overlap_STR.ECT_TC3HiSTR.Byte
    

    /*** ECT_TC3Lo - Timer Input Capture/Output Compare Register 3 Low; 0x00000057 ***/
    union {
      byte Byte;
    } ECT_TC3LoSTR;
    #define ECT_TC3Lo                   _ECT_TC3.Overlap_STR.ECT_TC3LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC3STR;
extern volatile ECT_TC3STR _ECT_TC3 @(REG_BASE + 0x00000056);
#define ECT_TC3                         _ECT_TC3.Word


/*** ECT_TC4 - Timer Input Capture/Output Compare Register 4; 0x00000058 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC4Hi - Timer Input Capture/Output Compare Register 4 High; 0x00000058 ***/
    union {
      byte Byte;
    } ECT_TC4HiSTR;
    #define ECT_TC4Hi                   _ECT_TC4.Overlap_STR.ECT_TC4HiSTR.Byte
    

    /*** ECT_TC4Lo - Timer Input Capture/Output Compare Register 4 Low; 0x00000059 ***/
    union {
      byte Byte;
    } ECT_TC4LoSTR;
    #define ECT_TC4Lo                   _ECT_TC4.Overlap_STR.ECT_TC4LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC4STR;
extern volatile ECT_TC4STR _ECT_TC4 @(REG_BASE + 0x00000058);
#define ECT_TC4                         _ECT_TC4.Word


/*** ECT_TC5 - Timer Input Capture/Output Compare Register 5; 0x0000005A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC5Hi - Timer Input Capture/Output Compare Register 5 High; 0x0000005A ***/
    union {
      byte Byte;
    } ECT_TC5HiSTR;
    #define ECT_TC5Hi                   _ECT_TC5.Overlap_STR.ECT_TC5HiSTR.Byte
    

    /*** ECT_TC5Lo - Timer Input Capture/Output Compare Register 5 Low; 0x0000005B ***/
    union {
      byte Byte;
    } ECT_TC5LoSTR;
    #define ECT_TC5Lo                   _ECT_TC5.Overlap_STR.ECT_TC5LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC5STR;
extern volatile ECT_TC5STR _ECT_TC5 @(REG_BASE + 0x0000005A);
#define ECT_TC5                         _ECT_TC5.Word


/*** ECT_TC6 - Timer Input Capture/Output Compare Register 6; 0x0000005C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC6Hi - Timer Input Capture/Output Compare Register 6 High; 0x0000005C ***/
    union {
      byte Byte;
    } ECT_TC6HiSTR;
    #define ECT_TC6Hi                   _ECT_TC6.Overlap_STR.ECT_TC6HiSTR.Byte
    

    /*** ECT_TC6Lo - Timer Input Capture/Output Compare Register 6 Low; 0x0000005D ***/
    union {
      byte Byte;
    } ECT_TC6LoSTR;
    #define ECT_TC6Lo                   _ECT_TC6.Overlap_STR.ECT_TC6LoSTR.Byte
    
  } Overlap_STR;

