Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
} ECT_TC6STR;
extern volatile ECT_TC6STR _ECT_TC6 @(REG_BASE + 0x0000005C);
#define ECT_TC6                         _ECT_TC6.Word


/*** ECT_TC7 - Timer Input Capture/Output Compare Register 7; 0x0000005E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC7Hi - Timer Input Capture/Output Compare Register 7 High; 0x0000005E ***/
    union {
      byte Byte;
    } ECT_TC7HiSTR;
    #define ECT_TC7Hi                   _ECT_TC7.Overlap_STR.ECT_TC7HiSTR.Byte
    

    /*** ECT_TC7Lo - Timer Input Capture/Output Compare Register 7 Low; 0x0000005F ***/
    union {
      byte Byte;
    } ECT_TC7LoSTR;
    #define ECT_TC7Lo                   _ECT_TC7.Overlap_STR.ECT_TC7LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC7STR;
extern volatile ECT_TC7STR _ECT_TC7 @(REG_BASE + 0x0000005E);
#define ECT_TC7                         _ECT_TC7.Word


/*** ECT_PACTL - 16-Bit Pulse Accumulator A Control Register; 0x00000060 ***/
typedef union {
  byte Byte;
  struct {
    byte PAI         :1;                                       /* Pulse Accumulator Input Interrupt enable */
    byte PAOVI       :1;                                       /* Pulse Accumulator A Overflow Interrupt enable */
    byte CLK0        :1;                                       /* Clock Select Bit 0 */
    byte CLK1        :1;                                       /* Clock Select Bit 1 */
    byte PEDGE       :1;                                       /* Pulse Accumulator Edge Control */
    byte PAMOD       :1;                                       /* Pulse Accumulator Mode */
    byte PAEN        :1;                                       /* Pulse Accumulator A System Enable */
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpCLK  :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ECT_PACTLSTR;
extern volatile ECT_PACTLSTR _ECT_PACTL @(REG_BASE + 0x00000060);
#define ECT_PACTL                       _ECT_PACTL.Byte
#define ECT_PACTL_PAI                   _ECT_PACTL.Bits.PAI
#define ECT_PACTL_PAOVI                 _ECT_PACTL.Bits.PAOVI
#define ECT_PACTL_CLK0                  _ECT_PACTL.Bits.CLK0
#define ECT_PACTL_CLK1                  _ECT_PACTL.Bits.CLK1
#define ECT_PACTL_PEDGE                 _ECT_PACTL.Bits.PEDGE
#define ECT_PACTL_PAMOD                 _ECT_PACTL.Bits.PAMOD
#define ECT_PACTL_PAEN                  _ECT_PACTL.Bits.PAEN
#define ECT_PACTL_CLK                   _ECT_PACTL.MergedBits.grpCLK

#define ECT_PACTL_PAI_MASK              1
#define ECT_PACTL_PAOVI_MASK            2
#define ECT_PACTL_CLK0_MASK             4
#define ECT_PACTL_CLK1_MASK             8
#define ECT_PACTL_PEDGE_MASK            16
#define ECT_PACTL_PAMOD_MASK            32
#define ECT_PACTL_PAEN_MASK             64
#define ECT_PACTL_CLK_MASK              12
#define ECT_PACTL_CLK_BITNUM            2


/*** ECT_PAFLG - Pulse Accumulator A Flag Register; 0x00000061 ***/
typedef union {
  byte Byte;
  struct {
    byte PAIF        :1;                                       /* Pulse Accumulator Input edge Flag */
    byte PAOVF       :1;                                       /* Pulse Accumulator A Overflow Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} ECT_PAFLGSTR;
extern volatile ECT_PAFLGSTR _ECT_PAFLG @(REG_BASE + 0x00000061);
#define ECT_PAFLG                       _ECT_PAFLG.Byte
#define ECT_PAFLG_PAIF                  _ECT_PAFLG.Bits.PAIF
#define ECT_PAFLG_PAOVF                 _ECT_PAFLG.Bits.PAOVF

#define ECT_PAFLG_PAIF_MASK             1
#define ECT_PAFLG_PAOVF_MASK            2


/*** ECT_PACN32 - Pulse Accumulators Count 32 Register; 0x00000062 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_PACN3 - Pulse Accumulators Count 3 Register; 0x00000062 ***/
    union {
      byte Byte;
    } ECT_PACN3STR;
    #define ECT_PACN3                   _ECT_PACN32.Overlap_STR.ECT_PACN3STR.Byte
    

    /*** ECT_PACN2 - Pulse Accumulators Count 2 Register; 0x00000063 ***/
    union {
      byte Byte;
    } ECT_PACN2STR;
    #define ECT_PACN2                   _ECT_PACN32.Overlap_STR.ECT_PACN2STR.Byte
    
  } Overlap_STR;

} ECT_PACN32STR;
extern volatile ECT_PACN32STR _ECT_PACN32 @(REG_BASE + 0x00000062);
#define ECT_PACN32                      _ECT_PACN32.Word


/*** ECT_PACN10 - Pulse Accumulators Count 10 Register; 0x00000064 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_PACN1 - Pulse Accumulators Count 1 Register; 0x00000064 ***/
    union {
      byte Byte;
    } ECT_PACN1STR;
    #define ECT_PACN1                   _ECT_PACN10.Overlap_STR.ECT_PACN1STR.Byte
    

    /*** ECT_PACN0 - Pulse Accumulators Count 0 Register; 0x00000065 ***/
    union {
      byte Byte;
    } ECT_PACN0STR;
    #define ECT_PACN0                   _ECT_PACN10.Overlap_STR.ECT_PACN0STR.Byte
    
  } Overlap_STR;

} ECT_PACN10STR;
extern volatile ECT_PACN10STR _ECT_PACN10 @(REG_BASE + 0x00000064);
#define ECT_PACN10                      _ECT_PACN10.Word


/*** ECT_MCCTL - Modulus Down Counter underflow; 0x00000066 ***/
typedef union {
  byte Byte;
  struct {
    byte MCPR0       :1;                                       /* Modulus Counter Prescaler select 0 */
    byte MCPR1       :1;                                       /* Modulus Counter Prescaler select 1 */
    byte MCEN        :1;                                       /* Modulus Down-Counter Enable */
    byte FLMC        :1;                                       /* Force Load Register into the Modulus Counter Count Register */
    byte ICLAT       :1;                                       /* Input Capture Force Latch Action */
    byte RDMCL       :1;                                       /* Read Modulus Down-Counter Load */
    byte MODMC       :1;                                       /* Modulus Mode Enable */
    byte MCZI        :1;                                       /* Modulus Counter Underflow Interrupt Enable */
  } Bits;
  struct {
    byte grpMCPR :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ECT_MCCTLSTR;
extern volatile ECT_MCCTLSTR _ECT_MCCTL @(REG_BASE + 0x00000066);
#define ECT_MCCTL                       _ECT_MCCTL.Byte
#define ECT_MCCTL_MCPR0                 _ECT_MCCTL.Bits.MCPR0
#define ECT_MCCTL_MCPR1                 _ECT_MCCTL.Bits.MCPR1
#define ECT_MCCTL_MCEN                  _ECT_MCCTL.Bits.MCEN
#define ECT_MCCTL_FLMC                  _ECT_MCCTL.Bits.FLMC
#define ECT_MCCTL_ICLAT                 _ECT_MCCTL.Bits.ICLAT
#define ECT_MCCTL_RDMCL                 _ECT_MCCTL.Bits.RDMCL
#define ECT_MCCTL_MODMC                 _ECT_MCCTL.Bits.MODMC
#define ECT_MCCTL_MCZI                  _ECT_MCCTL.Bits.MCZI
#define ECT_MCCTL_MCPR                  _ECT_MCCTL.MergedBits.grpMCPR

#define ECT_MCCTL_MCPR0_MASK            1
#define ECT_MCCTL_MCPR1_MASK            2
#define ECT_MCCTL_MCEN_MASK             4
#define ECT_MCCTL_FLMC_MASK             8
#define ECT_MCCTL_ICLAT_MASK            16
#define ECT_MCCTL_RDMCL_MASK            32
#define ECT_MCCTL_MODMC_MASK            64
#define ECT_MCCTL_MCZI_MASK             128
#define ECT_MCCTL_MCPR_MASK             3
#define ECT_MCCTL_MCPR_BITNUM           0


/*** ECT_MCFLG - 16-Bit Modulus Down Counter Flag Register; 0x00000067 ***/
typedef union {
  byte Byte;
  struct {
    byte POLF0       :1;                                       /* First Input Capture Polarity Status 0 */
    byte POLF1       :1;                                       /* First Input Capture Polarity Status 1 */
    byte POLF2       :1;                                       /* First Input Capture Polarity Status 2 */
    byte POLF3       :1;                                       /* First Input Capture Polarity Status 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte MCZF        :1;                                       /* Modulus Counter Underflow Flag */
  } Bits;
  struct {
    byte grpPOLF :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ECT_MCFLGSTR;
