Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
extern volatile ECT_PBCTLSTR _ECT_PBCTL @(REG_BASE + 0x00000070);
#define ECT_PBCTL                       _ECT_PBCTL.Byte
#define ECT_PBCTL_PBOVI                 _ECT_PBCTL.Bits.PBOVI
#define ECT_PBCTL_PBEN                  _ECT_PBCTL.Bits.PBEN

#define ECT_PBCTL_PBOVI_MASK            2
#define ECT_PBCTL_PBEN_MASK             64


/*** ECT_PBFLG - Pulse Accumulator B Flag Register; 0x00000071 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte PBOVF       :1;                                       /* Pulse Accumulator B Overflow Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} ECT_PBFLGSTR;
extern volatile ECT_PBFLGSTR _ECT_PBFLG @(REG_BASE + 0x00000071);
#define ECT_PBFLG                       _ECT_PBFLG.Byte
#define ECT_PBFLG_PBOVF                 _ECT_PBFLG.Bits.PBOVF

#define ECT_PBFLG_PBOVF_MASK            2


/*** ECT_PA32H - 8-Bit Pulse Accumulators Holding 32 Register; 0x00000072 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_PA3H - 8-Bit Pulse Accumulators Holding 3 Register; 0x00000072 ***/
    union {
      byte Byte;
    } ECT_PA3HSTR;
    #define ECT_PA3H                    _ECT_PA32H.Overlap_STR.ECT_PA3HSTR.Byte
    

    /*** ECT_PA2H - 8-Bit Pulse Accumulators Holding 2 Register; 0x00000073 ***/
    union {
      byte Byte;
    } ECT_PA2HSTR;
    #define ECT_PA2H                    _ECT_PA32H.Overlap_STR.ECT_PA2HSTR.Byte
    
  } Overlap_STR;

} ECT_PA32HSTR;
extern volatile ECT_PA32HSTR _ECT_PA32H @(REG_BASE + 0x00000072);
#define ECT_PA32H                       _ECT_PA32H.Word


/*** ECT_PA10H - 8-Bit Pulse Accumulators Holding 10 Register; 0x00000074 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_PA1H - 8-Bit Pulse Accumulators Holding 1 Register; 0x00000074 ***/
    union {
      byte Byte;
    } ECT_PA1HSTR;
    #define ECT_PA1H                    _ECT_PA10H.Overlap_STR.ECT_PA1HSTR.Byte
    

    /*** ECT_PA0H - 8-Bit Pulse Accumulators Holding 0 Register; 0x00000075 ***/
    union {
      byte Byte;
    } ECT_PA0HSTR;
    #define ECT_PA0H                    _ECT_PA10H.Overlap_STR.ECT_PA0HSTR.Byte
    
  } Overlap_STR;

} ECT_PA10HSTR;
extern volatile ECT_PA10HSTR _ECT_PA10H @(REG_BASE + 0x00000074);
#define ECT_PA10H                       _ECT_PA10H.Word


/*** ECT_MCCNT - Modulus Down-Counter Count Register; 0x00000076 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_MCCNThi - Modulus Down-Counter Count Register High; 0x00000076 ***/
    union {
      byte Byte;
    } ECT_MCCNThiSTR;
    #define ECT_MCCNThi                 _ECT_MCCNT.Overlap_STR.ECT_MCCNThiSTR.Byte
    

    /*** ECT_MCCNTlo - Modulus Down-Counter Count Register Low; 0x00000077 ***/
    union {
      byte Byte;
    } ECT_MCCNTloSTR;
    #define ECT_MCCNTlo                 _ECT_MCCNT.Overlap_STR.ECT_MCCNTloSTR.Byte
    
  } Overlap_STR;

} ECT_MCCNTSTR;
extern volatile ECT_MCCNTSTR _ECT_MCCNT @(REG_BASE + 0x00000076);
#define ECT_MCCNT                       _ECT_MCCNT.Word


/*** ECT_TC0H - Timer Input Capture Holding Registers 0; 0x00000078 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC0Hhi - Timer Input Capture Holding Registers High; 0x00000078 ***/
    union {
      byte Byte;
    } ECT_TC0HhiSTR;
    #define ECT_TC0Hhi                  _ECT_TC0H.Overlap_STR.ECT_TC0HhiSTR.Byte
    

    /*** ECT_TC0Hlo - Timer Input Capture Holding Registers 0 Low; 0x00000079 ***/
    union {
      byte Byte;
    } ECT_TC0HloSTR;
    #define ECT_TC0Hlo                  _ECT_TC0H.Overlap_STR.ECT_TC0HloSTR.Byte
    
  } Overlap_STR;

} ECT_TC0HSTR;
extern volatile ECT_TC0HSTR _ECT_TC0H @(REG_BASE + 0x00000078);
#define ECT_TC0H                        _ECT_TC0H.Word


/*** ECT_TC1H - Timer Input Capture Holding Registers 1; 0x0000007A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC1Hhi - Timer Input Capture Holding Registers 1 High; 0x0000007A ***/
    union {
      byte Byte;
    } ECT_TC1HhiSTR;
    #define ECT_TC1Hhi                  _ECT_TC1H.Overlap_STR.ECT_TC1HhiSTR.Byte
    

    /*** ECT_TC1Hlo - Timer Input Capture Holding Registers 1 Low; 0x0000007B ***/
    union {
      byte Byte;
    } ECT_TC1HloSTR;
    #define ECT_TC1Hlo                  _ECT_TC1H.Overlap_STR.ECT_TC1HloSTR.Byte
    
  } Overlap_STR;

} ECT_TC1HSTR;
extern volatile ECT_TC1HSTR _ECT_TC1H @(REG_BASE + 0x0000007A);
#define ECT_TC1H                        _ECT_TC1H.Word


/*** ECT_TC2H - Timer Input Capture Holding Registers 2; 0x0000007C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC2Hhi - Timer Input Capture Holding Registers 2 High; 0x0000007C ***/
    union {
      byte Byte;
    } ECT_TC2HhiSTR;
    #define ECT_TC2Hhi                  _ECT_TC2H.Overlap_STR.ECT_TC2HhiSTR.Byte
    

    /*** ECT_TC2Hlo - Timer Input Capture Holding Registers 2 Low; 0x0000007D ***/
    union {
      byte Byte;
    } ECT_TC2HloSTR;
    #define ECT_TC2Hlo                  _ECT_TC2H.Overlap_STR.ECT_TC2HloSTR.Byte
    
  } Overlap_STR;

} ECT_TC2HSTR;
extern volatile ECT_TC2HSTR _ECT_TC2H @(REG_BASE + 0x0000007C);
#define ECT_TC2H                        _ECT_TC2H.Word


/*** ECT_TC3H - Timer Input Capture Holding Registers 3; 0x0000007E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC3Hhi - Timer Input Capture Holding Registers 3 High; 0x0000007E ***/
    union {
      byte Byte;
    } ECT_TC3HhiSTR;
    #define ECT_TC3Hhi                  _ECT_TC3H.Overlap_STR.ECT_TC3HhiSTR.Byte
    

    /*** ECT_TC3Hlo - Timer Input Capture Holding Registers 3 Low; 0x0000007F ***/
    union {
      byte Byte;
    } ECT_TC3HloSTR;
    #define ECT_TC3Hlo                  _ECT_TC3H.Overlap_STR.ECT_TC3HloSTR.Byte
    
  } Overlap_STR;

} ECT_TC3HSTR;
extern volatile ECT_TC3HSTR _ECT_TC3H @(REG_BASE + 0x0000007E);
#define ECT_TC3H                        _ECT_TC3H.Word


