Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
  struct {
    word CA          :1;                                       /* Analog Input Channel Select Code A */
    word CB          :1;                                       /* Analog Input Channel Select Code B */
    word CC          :1;                                       /* Analog Input Channel Select Code C */
    word CD          :1;                                       /* Analog Input Channel Select Code D */
    word MULT        :1;                                       /* Multi-Channel Sample Mode */
    word SCAN        :1;                                       /* Continuous Conversion Sequence Mode */
    word SC          :1;                                       /* Special Channel Conversion Bit */
    word             :1; 
    word PRS0        :1;                                       /* ATD Clock Prescaler 0 */
    word PRS1        :1;                                       /* ATD Clock Prescaler 1 */
    word PRS2        :1;                                       /* ATD Clock Prescaler 2 */
    word PRS3        :1;                                       /* ATD Clock Prescaler 3 */
    word PRS4        :1;                                       /* ATD Clock Prescaler 4 */
    word SMP0        :1;                                       /* Sample Time Select 0 */
    word SMP1        :1;                                       /* Sample Time Select 1 */
    word SMP2        :1;                                       /* Sample Time Select 2 */
  } Bits;
  struct {
    word grpCx   :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpPRS  :5;
    word grpSMP  :3;
  } MergedBits;
} ATD1CTL45STR;
extern volatile ATD1CTL45STR _ATD1CTL45 @(REG_BASE + 0x00000084);
#define ATD1CTL45                       _ATD1CTL45.Word
#define ATD1CTL45_CA                    _ATD1CTL45.Bits.CA
#define ATD1CTL45_CB                    _ATD1CTL45.Bits.CB
#define ATD1CTL45_CC                    _ATD1CTL45.Bits.CC
#define ATD1CTL45_CD                    _ATD1CTL45.Bits.CD
#define ATD1CTL45_MULT                  _ATD1CTL45.Bits.MULT
#define ATD1CTL45_SCAN                  _ATD1CTL45.Bits.SCAN
#define ATD1CTL45_SC                    _ATD1CTL45.Bits.SC
#define ATD1CTL45_PRS0                  _ATD1CTL45.Bits.PRS0
#define ATD1CTL45_PRS1                  _ATD1CTL45.Bits.PRS1
#define ATD1CTL45_PRS2                  _ATD1CTL45.Bits.PRS2
#define ATD1CTL45_PRS3                  _ATD1CTL45.Bits.PRS3
#define ATD1CTL45_PRS4                  _ATD1CTL45.Bits.PRS4
#define ATD1CTL45_SMP0                  _ATD1CTL45.Bits.SMP0
#define ATD1CTL45_SMP1                  _ATD1CTL45.Bits.SMP1
#define ATD1CTL45_SMP2                  _ATD1CTL45.Bits.SMP2
#define ATD1CTL45_Cx                    _ATD1CTL45.MergedBits.grpCx
#define ATD1CTL45_PRS                   _ATD1CTL45.MergedBits.grpPRS
#define ATD1CTL45_SMP                   _ATD1CTL45.MergedBits.grpSMP

#define ATD1CTL45_CA_MASK               1
#define ATD1CTL45_CB_MASK               2
#define ATD1CTL45_CC_MASK               4
#define ATD1CTL45_CD_MASK               8
#define ATD1CTL45_MULT_MASK             16
#define ATD1CTL45_SCAN_MASK             32
#define ATD1CTL45_SC_MASK               64
#define ATD1CTL45_PRS0_MASK             256
#define ATD1CTL45_PRS1_MASK             512
#define ATD1CTL45_PRS2_MASK             1024
#define ATD1CTL45_PRS3_MASK             2048
#define ATD1CTL45_PRS4_MASK             4096
#define ATD1CTL45_SMP0_MASK             8192
#define ATD1CTL45_SMP1_MASK             16384
#define ATD1CTL45_SMP2_MASK             32768
#define ATD1CTL45_Cx_MASK               15
#define ATD1CTL45_Cx_BITNUM             0
#define ATD1CTL45_PRS_MASK              7936
#define ATD1CTL45_PRS_BITNUM            8
#define ATD1CTL45_SMP_MASK              57344
#define ATD1CTL45_SMP_BITNUM            13


/*** ATD1STAT0 - ATD 1 Status Register 0; 0x00000086 ***/
typedef union {
  byte Byte;
  struct {
    byte CC0         :1;                                       /* Conversion Counter 0 */
    byte CC1         :1;                                       /* Conversion Counter 1 */
    byte CC2         :1;                                       /* Conversion Counter 2 */
    byte CC3         :1;                                       /* Conversion Counter 3 */
    byte FIFOR       :1;                                       /* FIFO Over Run Flag */
    byte ETORF       :1;                                       /* External Trigger Overrun Flag */
    byte             :1; 
    byte SCF         :1;                                       /* Sequence Complete Flag */
  } Bits;
  struct {
    byte grpCC   :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ATD1STAT0STR;
extern volatile ATD1STAT0STR _ATD1STAT0 @(REG_BASE + 0x00000086);
#define ATD1STAT0                       _ATD1STAT0.Byte
#define ATD1STAT0_CC0                   _ATD1STAT0.Bits.CC0
#define ATD1STAT0_CC1                   _ATD1STAT0.Bits.CC1
#define ATD1STAT0_CC2                   _ATD1STAT0.Bits.CC2
#define ATD1STAT0_CC3                   _ATD1STAT0.Bits.CC3
#define ATD1STAT0_FIFOR                 _ATD1STAT0.Bits.FIFOR
#define ATD1STAT0_ETORF                 _ATD1STAT0.Bits.ETORF
#define ATD1STAT0_SCF                   _ATD1STAT0.Bits.SCF
#define ATD1STAT0_CC                    _ATD1STAT0.MergedBits.grpCC

#define ATD1STAT0_CC0_MASK              1
#define ATD1STAT0_CC1_MASK              2
#define ATD1STAT0_CC2_MASK              4
#define ATD1STAT0_CC3_MASK              8
#define ATD1STAT0_FIFOR_MASK            16
#define ATD1STAT0_ETORF_MASK            32
#define ATD1STAT0_SCF_MASK              128
#define ATD1STAT0_CC_MASK               15
#define ATD1STAT0_CC_BITNUM             0


/*** ATD1CMPE - ATD 1 Compare Enable Register; 0x00000088 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1CMPEH - ATD 1 Compare Enable Register High; 0x00000088 ***/
    union {
      byte Byte;
      struct {
        byte CMPE8       :1;                                       /* Compare Enable for Conversion Number 8 of a Sequence */
        byte CMPE9       :1;                                       /* Compare Enable for Conversion Number 9 of a Sequence */
        byte CMPE10      :1;                                       /* Compare Enable for Conversion Number 10 of a Sequence */
        byte CMPE11      :1;                                       /* Compare Enable for Conversion Number 11 of a Sequence */
        byte CMPE12      :1;                                       /* Compare Enable for Conversion Number 12 of a Sequence */
        byte CMPE13      :1;                                       /* Compare Enable for Conversion Number 13 of a Sequence */
        byte CMPE14      :1;                                       /* Compare Enable for Conversion Number 14 of a Sequence */
        byte CMPE15      :1;                                       /* Compare Enable for Conversion Number 15 of a Sequence */
      } Bits;
    } ATD1CMPEHSTR;
    #define ATD1CMPEH                   _ATD1CMPE.Overlap_STR.ATD1CMPEHSTR.Byte
    #define ATD1CMPEH_CMPE8             _ATD1CMPE.Overlap_STR.ATD1CMPEHSTR.Bits.CMPE8
    #define ATD1CMPEH_CMPE9             _ATD1CMPE.Overlap_STR.ATD1CMPEHSTR.Bits.CMPE9
    #define ATD1CMPEH_CMPE10            _ATD1CMPE.Overlap_STR.ATD1CMPEHSTR.Bits.CMPE10
    #define ATD1CMPEH_CMPE11            _ATD1CMPE.Overlap_STR.ATD1CMPEHSTR.Bits.CMPE11
    #define ATD1CMPEH_CMPE12            _ATD1CMPE.Overlap_STR.ATD1CMPEHSTR.Bits.CMPE12
    #define ATD1CMPEH_CMPE13            _ATD1CMPE.Overlap_STR.ATD1CMPEHSTR.Bits.CMPE13
    #define ATD1CMPEH_CMPE14            _ATD1CMPE.Overlap_STR.ATD1CMPEHSTR.Bits.CMPE14
    #define ATD1CMPEH_CMPE15            _ATD1CMPE.Overlap_STR.ATD1CMPEHSTR.Bits.CMPE15
    
    #define ATD1CMPEH_CMPE8_MASK        1
    #define ATD1CMPEH_CMPE9_MASK        2
    #define ATD1CMPEH_CMPE10_MASK       4
    #define ATD1CMPEH_CMPE11_MASK       8
    #define ATD1CMPEH_CMPE12_MASK       16
    #define ATD1CMPEH_CMPE13_MASK       32
    #define ATD1CMPEH_CMPE14_MASK       64
    #define ATD1CMPEH_CMPE15_MASK       128
    

    /*** ATD1CMPEL - ATD 1 Compare Enable Register Low; 0x00000089 ***/
    union {
      byte Byte;
      struct {
        byte CMPE0       :1;                                       /* Compare Enable for Conversion Number 0 of a Sequence */
        byte CMPE1       :1;                                       /* Compare Enable for Conversion Number 1 of a Sequence */
        byte CMPE2       :1;                                       /* Compare Enable for Conversion Number 2 of a Sequence */
        byte CMPE3       :1;                                       /* Compare Enable for Conversion Number 3 of a Sequence */
        byte CMPE4       :1;                                       /* Compare Enable for Conversion Number 4 of a Sequence */
        byte CMPE5       :1;                                       /* Compare Enable for Conversion Number 5 of a Sequence */
        byte CMPE6       :1;                                       /* Compare Enable for Conversion Number 6 of a Sequence */
        byte CMPE7       :1;                                       /* Compare Enable for Conversion Number 7 of a Sequence */
      } Bits;
    } ATD1CMPELSTR;
    #define ATD1CMPEL                   _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Byte
    #define ATD1CMPEL_CMPE0             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE0
    #define ATD1CMPEL_CMPE1             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE1
    #define ATD1CMPEL_CMPE2             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE2
    #define ATD1CMPEL_CMPE3             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE3
    #define ATD1CMPEL_CMPE4             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE4
    #define ATD1CMPEL_CMPE5             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE5
    #define ATD1CMPEL_CMPE6             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE6
    #define ATD1CMPEL_CMPE7             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE7
    
    #define ATD1CMPEL_CMPE0_MASK        1
    #define ATD1CMPEL_CMPE1_MASK        2
    #define ATD1CMPEL_CMPE2_MASK        4
    #define ATD1CMPEL_CMPE3_MASK        8
    #define ATD1CMPEL_CMPE4_MASK        16
    #define ATD1CMPEL_CMPE5_MASK        32
    #define ATD1CMPEL_CMPE6_MASK        64
    #define ATD1CMPEL_CMPE7_MASK        128
    
  } Overlap_STR;

