Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD1DR5STR;
extern volatile ATD1DR5STR _ATD1DR5 @(REG_BASE + 0x0000009A);
#define ATD1DR5                         _ATD1DR5.Word
#define ATD1DR5_BIT0                    _ATD1DR5.Bits.BIT0
#define ATD1DR5_BIT1                    _ATD1DR5.Bits.BIT1
#define ATD1DR5_BIT2                    _ATD1DR5.Bits.BIT2
#define ATD1DR5_BIT3                    _ATD1DR5.Bits.BIT3
#define ATD1DR5_BIT4                    _ATD1DR5.Bits.BIT4
#define ATD1DR5_BIT5                    _ATD1DR5.Bits.BIT5
#define ATD1DR5_BIT6                    _ATD1DR5.Bits.BIT6
#define ATD1DR5_BIT7                    _ATD1DR5.Bits.BIT7
#define ATD1DR5_BIT8                    _ATD1DR5.Bits.BIT8
#define ATD1DR5_BIT9                    _ATD1DR5.Bits.BIT9
#define ATD1DR5_BIT10                   _ATD1DR5.Bits.BIT10
#define ATD1DR5_BIT11                   _ATD1DR5.Bits.BIT11
#define ATD1DR5_BIT12                   _ATD1DR5.Bits.BIT12
#define ATD1DR5_BIT13                   _ATD1DR5.Bits.BIT13
#define ATD1DR5_BIT14                   _ATD1DR5.Bits.BIT14
#define ATD1DR5_BIT15                   _ATD1DR5.Bits.BIT15

#define ATD1DR5_BIT0_MASK               1
#define ATD1DR5_BIT1_MASK               2
#define ATD1DR5_BIT2_MASK               4
#define ATD1DR5_BIT3_MASK               8
#define ATD1DR5_BIT4_MASK               16
#define ATD1DR5_BIT5_MASK               32
#define ATD1DR5_BIT6_MASK               64
#define ATD1DR5_BIT7_MASK               128
#define ATD1DR5_BIT8_MASK               256
#define ATD1DR5_BIT9_MASK               512
#define ATD1DR5_BIT10_MASK              1024
#define ATD1DR5_BIT11_MASK              2048
#define ATD1DR5_BIT12_MASK              4096
#define ATD1DR5_BIT13_MASK              8192
#define ATD1DR5_BIT14_MASK              16384
#define ATD1DR5_BIT15_MASK              32768


/*** ATD1DR6 - ATD 1 Conversion Result Register 6; 0x0000009C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DR6H - ATD 1 Conversion Result Register 6 High; 0x0000009C ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD1DR6HSTR;
    #define ATD1DR6H                    _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Byte
    #define ATD1DR6H_BIT8               _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT8
    #define ATD1DR6H_BIT9               _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT9
    #define ATD1DR6H_BIT10              _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT10
    #define ATD1DR6H_BIT11              _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT11
    #define ATD1DR6H_BIT12              _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT12
    #define ATD1DR6H_BIT13              _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT13
    #define ATD1DR6H_BIT14              _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT14
    #define ATD1DR6H_BIT15              _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT15
    
    #define ATD1DR6H_BIT8_MASK          1
    #define ATD1DR6H_BIT9_MASK          2
    #define ATD1DR6H_BIT10_MASK         4
    #define ATD1DR6H_BIT11_MASK         8
    #define ATD1DR6H_BIT12_MASK         16
    #define ATD1DR6H_BIT13_MASK         32
    #define ATD1DR6H_BIT14_MASK         64
    #define ATD1DR6H_BIT15_MASK         128
    

    /*** ATD1DR6L - ATD 1 Conversion Result Register 6 Low; 0x0000009D ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Bit 0 */
        byte BIT1        :1;                                       /* Bit 1 */
        byte BIT2        :1;                                       /* Bit 2 */
        byte BIT3        :1;                                       /* Bit 3 */
        byte BIT4        :1;                                       /* Bit 4 */
        byte BIT5        :1;                                       /* Bit 5 */
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
    } ATD1DR6LSTR;
    #define ATD1DR6L                    _ATD1DR6.Overlap_STR.ATD1DR6LSTR.Byte
    #define ATD1DR6L_BIT0               _ATD1DR6.Overlap_STR.ATD1DR6LSTR.Bits.BIT0
    #define ATD1DR6L_BIT1               _ATD1DR6.Overlap_STR.ATD1DR6LSTR.Bits.BIT1
    #define ATD1DR6L_BIT2               _ATD1DR6.Overlap_STR.ATD1DR6LSTR.Bits.BIT2
    #define ATD1DR6L_BIT3               _ATD1DR6.Overlap_STR.ATD1DR6LSTR.Bits.BIT3
    #define ATD1DR6L_BIT4               _ATD1DR6.Overlap_STR.ATD1DR6LSTR.Bits.BIT4
    #define ATD1DR6L_BIT5               _ATD1DR6.Overlap_STR.ATD1DR6LSTR.Bits.BIT5
    #define ATD1DR6L_BIT6               _ATD1DR6.Overlap_STR.ATD1DR6LSTR.Bits.BIT6
    #define ATD1DR6L_BIT7               _ATD1DR6.Overlap_STR.ATD1DR6LSTR.Bits.BIT7
    
