Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
    #define ATD1DR7L_BIT0_MASK          1
    #define ATD1DR7L_BIT1_MASK          2
    #define ATD1DR7L_BIT2_MASK          4
    #define ATD1DR7L_BIT3_MASK          8
    #define ATD1DR7L_BIT4_MASK          16
    #define ATD1DR7L_BIT5_MASK          32
    #define ATD1DR7L_BIT6_MASK          64
    #define ATD1DR7L_BIT7_MASK          128
    
  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD1DR7STR;
extern volatile ATD1DR7STR _ATD1DR7 @(REG_BASE + 0x0000009E);
#define ATD1DR7                         _ATD1DR7.Word
#define ATD1DR7_BIT0                    _ATD1DR7.Bits.BIT0
#define ATD1DR7_BIT1                    _ATD1DR7.Bits.BIT1
#define ATD1DR7_BIT2                    _ATD1DR7.Bits.BIT2
#define ATD1DR7_BIT3                    _ATD1DR7.Bits.BIT3
#define ATD1DR7_BIT4                    _ATD1DR7.Bits.BIT4
#define ATD1DR7_BIT5                    _ATD1DR7.Bits.BIT5
#define ATD1DR7_BIT6                    _ATD1DR7.Bits.BIT6
#define ATD1DR7_BIT7                    _ATD1DR7.Bits.BIT7
#define ATD1DR7_BIT8                    _ATD1DR7.Bits.BIT8
#define ATD1DR7_BIT9                    _ATD1DR7.Bits.BIT9
#define ATD1DR7_BIT10                   _ATD1DR7.Bits.BIT10
#define ATD1DR7_BIT11                   _ATD1DR7.Bits.BIT11
#define ATD1DR7_BIT12                   _ATD1DR7.Bits.BIT12
#define ATD1DR7_BIT13                   _ATD1DR7.Bits.BIT13
#define ATD1DR7_BIT14                   _ATD1DR7.Bits.BIT14
#define ATD1DR7_BIT15                   _ATD1DR7.Bits.BIT15

#define ATD1DR7_BIT0_MASK               1
#define ATD1DR7_BIT1_MASK               2
#define ATD1DR7_BIT2_MASK               4
#define ATD1DR7_BIT3_MASK               8
#define ATD1DR7_BIT4_MASK               16
#define ATD1DR7_BIT5_MASK               32
#define ATD1DR7_BIT6_MASK               64
#define ATD1DR7_BIT7_MASK               128
#define ATD1DR7_BIT8_MASK               256
#define ATD1DR7_BIT9_MASK               512
#define ATD1DR7_BIT10_MASK              1024
#define ATD1DR7_BIT11_MASK              2048
#define ATD1DR7_BIT12_MASK              4096
#define ATD1DR7_BIT13_MASK              8192
#define ATD1DR7_BIT14_MASK              16384
#define ATD1DR7_BIT15_MASK              32768


/*** ATD1DR8 - ATD 1 Conversion Result Register 8; 0x000000A0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DR8H - ATD 1 Conversion Result Register 8 High; 0x000000A0 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD1DR8HSTR;
    #define ATD1DR8H                    _ATD1DR8.Overlap_STR.ATD1DR8HSTR.Byte
    #define ATD1DR8H_BIT8               _ATD1DR8.Overlap_STR.ATD1DR8HSTR.Bits.BIT8
    #define ATD1DR8H_BIT9               _ATD1DR8.Overlap_STR.ATD1DR8HSTR.Bits.BIT9
    #define ATD1DR8H_BIT10              _ATD1DR8.Overlap_STR.ATD1DR8HSTR.Bits.BIT10
    #define ATD1DR8H_BIT11              _ATD1DR8.Overlap_STR.ATD1DR8HSTR.Bits.BIT11
    #define ATD1DR8H_BIT12              _ATD1DR8.Overlap_STR.ATD1DR8HSTR.Bits.BIT12
    #define ATD1DR8H_BIT13              _ATD1DR8.Overlap_STR.ATD1DR8HSTR.Bits.BIT13
    #define ATD1DR8H_BIT14              _ATD1DR8.Overlap_STR.ATD1DR8HSTR.Bits.BIT14
    #define ATD1DR8H_BIT15              _ATD1DR8.Overlap_STR.ATD1DR8HSTR.Bits.BIT15
    
    #define ATD1DR8H_BIT8_MASK          1
    #define ATD1DR8H_BIT9_MASK          2
    #define ATD1DR8H_BIT10_MASK         4
    #define ATD1DR8H_BIT11_MASK         8
    #define ATD1DR8H_BIT12_MASK         16
    #define ATD1DR8H_BIT13_MASK         32
    #define ATD1DR8H_BIT14_MASK         64
    #define ATD1DR8H_BIT15_MASK         128
    

    /*** ATD1DR8L - ATD 1 Conversion Result Register 8 Low; 0x000000A1 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Bit 0 */
        byte BIT1        :1;                                       /* Bit 1 */
        byte BIT2        :1;                                       /* Bit 2 */
        byte BIT3        :1;                                       /* Bit 3 */
        byte BIT4        :1;                                       /* Bit 4 */
        byte BIT5        :1;                                       /* Bit 5 */
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
    } ATD1DR8LSTR;
    #define ATD1DR8L                    _ATD1DR8.Overlap_STR.ATD1DR8LSTR.Byte
    #define ATD1DR8L_BIT0               _ATD1DR8.Overlap_STR.ATD1DR8LSTR.Bits.BIT0
    #define ATD1DR8L_BIT1               _ATD1DR8.Overlap_STR.ATD1DR8LSTR.Bits.BIT1
    #define ATD1DR8L_BIT2               _ATD1DR8.Overlap_STR.ATD1DR8LSTR.Bits.BIT2
    #define ATD1DR8L_BIT3               _ATD1DR8.Overlap_STR.ATD1DR8LSTR.Bits.BIT3
    #define ATD1DR8L_BIT4               _ATD1DR8.Overlap_STR.ATD1DR8LSTR.Bits.BIT4
    #define ATD1DR8L_BIT5               _ATD1DR8.Overlap_STR.ATD1DR8LSTR.Bits.BIT5
    #define ATD1DR8L_BIT6               _ATD1DR8.Overlap_STR.ATD1DR8LSTR.Bits.BIT6
    #define ATD1DR8L_BIT7               _ATD1DR8.Overlap_STR.ATD1DR8LSTR.Bits.BIT7
    
