Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define SCI2DRH_T8_MASK                 64
#define SCI2DRH_R8_MASK                 128


/*** SCI2DRL - SCI 2 Data Register Low; 0x000000BF ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Received bit 0 or Transmit bit 0 */
    byte R1_T1       :1;                                       /* Received bit 1 or Transmit bit 1 */
    byte R2_T2       :1;                                       /* Received bit 2 or Transmit bit 2 */
    byte R3_T3       :1;                                       /* Received bit 3 or Transmit bit 3 */
    byte R4_T4       :1;                                       /* Received bit 4 or Transmit bit 4 */
    byte R5_T5       :1;                                       /* Received bit 5 or Transmit bit 5 */
    byte R6_T6       :1;                                       /* Received bit 6 or Transmit bit 6 */
    byte R7_T7       :1;                                       /* Received bit 7 or Transmit bit 7 */
  } Bits;
} SCI2DRLSTR;
extern volatile SCI2DRLSTR _SCI2DRL @(REG_BASE + 0x000000BF);
#define SCI2DRL                         _SCI2DRL.Byte
#define SCI2DRL_R0_T0                   _SCI2DRL.Bits.R0_T0
#define SCI2DRL_R1_T1                   _SCI2DRL.Bits.R1_T1
#define SCI2DRL_R2_T2                   _SCI2DRL.Bits.R2_T2
#define SCI2DRL_R3_T3                   _SCI2DRL.Bits.R3_T3
#define SCI2DRL_R4_T4                   _SCI2DRL.Bits.R4_T4
#define SCI2DRL_R5_T5                   _SCI2DRL.Bits.R5_T5
#define SCI2DRL_R6_T6                   _SCI2DRL.Bits.R6_T6
#define SCI2DRL_R7_T7                   _SCI2DRL.Bits.R7_T7

#define SCI2DRL_R0_T0_MASK              1
#define SCI2DRL_R1_T1_MASK              2
#define SCI2DRL_R2_T2_MASK              4
#define SCI2DRL_R3_T3_MASK              8
#define SCI2DRL_R4_T4_MASK              16
#define SCI2DRL_R5_T5_MASK              32
#define SCI2DRL_R6_T6_MASK              64
#define SCI2DRL_R7_T7_MASK              128


/*** SCI3BD - SCI 3 Baud Rate Register; 0x000000C0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SCI3ASR1 - SCI 3 Alternative Status Register 1; 0x000000C0 ***/
    union {
      byte Byte;
      union { /* Several registers at the same address */
        /*** SCI3ASR1 - SCI 3 Alternative Status Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIF       :1;                                       /* Break Detect Interrupt Flag */
            byte BERRIF      :1;                                       /* Bit Error Interrupt Flag */
            byte BERRV       :1;                                       /* Bit Error Value */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIF     :1;                                       /* Receive Input Active Edge Interrupt Flag */
          } Bits;
        } SCI3ASR1STR;
        #define SCI3ASR1                _SCI3BD.Overlap_STR.SCI3ASR1STR.Byte
        #define SCI3ASR1_BKDIF          _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3ASR1STR.Bits.BKDIF
        #define SCI3ASR1_BERRIF         _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3ASR1STR.Bits.BERRIF
        #define SCI3ASR1_BERRV          _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3ASR1STR.Bits.BERRV
        #define SCI3ASR1_RXEDGIF        _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3ASR1STR.Bits.RXEDGIF
        
        #define SCI3ASR1_BKDIF_MASK     1
        #define SCI3ASR1_BERRIF_MASK    2
        #define SCI3ASR1_BERRV_MASK     4
        #define SCI3ASR1_RXEDGIF_MASK   128
        
        /*** SCI3BDH - SCI 3 Baud Rate Register High; Several registers at the same address ***/
        union {
          struct {
            byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
            byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
            byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
            byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
            byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
            byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
            byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
            byte IREN        :1;                                       /* Infrared Enable Bit */
          } Bits;
          struct {
            byte grpSBR_8 :5;
            byte grpTNP :2;
            byte :1;
          } MergedBits;
        } SCI3BDHSTR;
        #define SCI3BDH                 _SCI3BD.Overlap_STR.SCI3ASR1STR.Byte
        #define SCI3BDH_SBR8            _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3BDHSTR.Bits.SBR8
        #define SCI3BDH_SBR9            _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3BDHSTR.Bits.SBR9
        #define SCI3BDH_SBR10           _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3BDHSTR.Bits.SBR10
        #define SCI3BDH_SBR11           _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3BDHSTR.Bits.SBR11
        #define SCI3BDH_SBR12           _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3BDHSTR.Bits.SBR12
        #define SCI3BDH_TNP0            _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3BDHSTR.Bits.TNP0
        #define SCI3BDH_TNP1            _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3BDHSTR.Bits.TNP1
        #define SCI3BDH_IREN            _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3BDHSTR.Bits.IREN
        #define SCI3BDH_SBR_8           _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3BDHSTR.MergedBits.grpSBR_8
        #define SCI3BDH_TNP             _SCI3BD.Overlap_STR.SCI3ASR1STR.SameAddr_STR.SCI3BDHSTR.MergedBits.grpTNP
        #define SCI3BDH_SBR             SCI3BDH_SBR_8
        
