Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
  } SameAddr_STR; /*Several registers at the same address */

} SCI3ACR2STR;
extern volatile SCI3ACR2STR _SCI3ACR2 @(REG_BASE + 0x000000C2);


/*** SCI3CR2 - SCI 3 Control Register 2; 0x000000C3 ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break Bit */
    byte RWU         :1;                                       /* Receiver Wakeup Bit */
    byte RE          :1;                                       /* Receiver Enable Bit */
    byte TE          :1;                                       /* Transmitter Enable Bit */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable Bit */
    byte RIE         :1;                                       /* Receiver Full Interrupt Enable Bit */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable Bit */
    byte TIE         :1;                                       /* Transmitter Interrupt Enable Bit */
  } Bits;
} SCI3CR2STR;
extern volatile SCI3CR2STR _SCI3CR2 @(REG_BASE + 0x000000C3);
#define SCI3CR2                         _SCI3CR2.Byte
#define SCI3CR2_SBK                     _SCI3CR2.Bits.SBK
#define SCI3CR2_RWU                     _SCI3CR2.Bits.RWU
#define SCI3CR2_RE                      _SCI3CR2.Bits.RE
#define SCI3CR2_TE                      _SCI3CR2.Bits.TE
#define SCI3CR2_ILIE                    _SCI3CR2.Bits.ILIE
#define SCI3CR2_RIE                     _SCI3CR2.Bits.RIE
#define SCI3CR2_TCIE                    _SCI3CR2.Bits.TCIE
#define SCI3CR2_TIE                     _SCI3CR2.Bits.TIE

#define SCI3CR2_SBK_MASK                1
#define SCI3CR2_RWU_MASK                2
#define SCI3CR2_RE_MASK                 4
#define SCI3CR2_TE_MASK                 8
#define SCI3CR2_ILIE_MASK               16
#define SCI3CR2_RIE_MASK                32
#define SCI3CR2_TCIE_MASK               64
#define SCI3CR2_TIE_MASK                128


/*** SCI3SR1 - SCI 3 Status Register 1; 0x000000C4 ***/
typedef union {
  byte Byte;
  struct {
    byte PF          :1;                                       /* Parity Error Flag */
    byte FE          :1;                                       /* Framing Error Flag */
    byte NF          :1;                                       /* Noise Flag */
    byte OR          :1;                                       /* Overrun Flag */
    byte IDLE        :1;                                       /* Idle Line Flag */
    byte RDRF_bit    :1;                                       /* Receive Data Register Full Flag */ /*Warning: group name is duplicated with register name*/
    byte TC          :1;                                       /* Transmit Complete Flag */
    byte TDRE        :1;                                       /* Transmit Data Register Empty Flag */
  } Bits;
} SCI3SR1STR;
extern volatile SCI3SR1STR _SCI3SR1 @(REG_BASE + 0x000000C4);
#define SCI3SR1                         _SCI3SR1.Byte
#define SCI3SR1_PF                      _SCI3SR1.Bits.PF
#define SCI3SR1_FE                      _SCI3SR1.Bits.FE
#define SCI3SR1_NF                      _SCI3SR1.Bits.NF
#define SCI3SR1_OR                      _SCI3SR1.Bits.OR
#define SCI3SR1_IDLE                    _SCI3SR1.Bits.IDLE
#define SCI3SR1_RDRF                    _SCI3SR1.Bits.RDRF_bit
#define SCI3SR1_TC                      _SCI3SR1.Bits.TC
#define SCI3SR1_TDRE                    _SCI3SR1.Bits.TDRE

#define SCI3SR1_PF_MASK                 1
#define SCI3SR1_FE_MASK                 2
#define SCI3SR1_NF_MASK                 4
#define SCI3SR1_OR_MASK                 8
#define SCI3SR1_IDLE_MASK               16
#define SCI3SR1_RDRF_MASK               32
#define SCI3SR1_TC_MASK                 64
#define SCI3SR1_TDRE_MASK               128


/*** SCI3SR2 - SCI 3 Status Register 2; 0x000000C5 ***/
typedef union {
  byte Byte;
  struct {
    byte RAF         :1;                                       /* Receiver Active Flag */
    byte TXDIR       :1;                                       /* Transmitter pin data direction in Single-Wire mode */
    byte BRK13       :1;                                       /* Break Transmit character length */
    byte RXPOL       :1;                                       /* Receive Polarity */
    byte TXPOL       :1;                                       /* Transmit Polarity */
    byte             :1; 
    byte             :1; 
    byte AMAP        :1;                                       /* Alternative Map */
  } Bits;
} SCI3SR2STR;
extern volatile SCI3SR2STR _SCI3SR2 @(REG_BASE + 0x000000C5);
#define SCI3SR2                         _SCI3SR2.Byte
#define SCI3SR2_RAF                     _SCI3SR2.Bits.RAF
#define SCI3SR2_TXDIR                   _SCI3SR2.Bits.TXDIR
#define SCI3SR2_BRK13                   _SCI3SR2.Bits.BRK13
#define SCI3SR2_RXPOL                   _SCI3SR2.Bits.RXPOL
#define SCI3SR2_TXPOL                   _SCI3SR2.Bits.TXPOL
#define SCI3SR2_AMAP                    _SCI3SR2.Bits.AMAP

#define SCI3SR2_RAF_MASK                1
#define SCI3SR2_TXDIR_MASK              2
#define SCI3SR2_BRK13_MASK              4
#define SCI3SR2_RXPOL_MASK              8
#define SCI3SR2_TXPOL_MASK              16
#define SCI3SR2_AMAP_MASK               128


/*** SCI3DRH - SCI 3 Data Register High; 0x000000C6 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte T8          :1;                                       /* Transmit Bit 8 */
    byte R8          :1;                                       /* Received Bit 8 */
  } Bits;
} SCI3DRHSTR;
extern volatile SCI3DRHSTR _SCI3DRH @(REG_BASE + 0x000000C6);
#define SCI3DRH                         _SCI3DRH.Byte
#define SCI3DRH_T8                      _SCI3DRH.Bits.T8
#define SCI3DRH_R8                      _SCI3DRH.Bits.R8

#define SCI3DRH_T8_MASK                 64
#define SCI3DRH_R8_MASK                 128


/*** SCI3DRL - SCI 3 Data Register Low; 0x000000C7 ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Received bit 0 or Transmit bit 0 */
    byte R1_T1       :1;                                       /* Received bit 1 or Transmit bit 1 */
    byte R2_T2       :1;                                       /* Received bit 2 or Transmit bit 2 */
    byte R3_T3       :1;                                       /* Received bit 3 or Transmit bit 3 */
    byte R4_T4       :1;                                       /* Received bit 4 or Transmit bit 4 */
    byte R5_T5       :1;                                       /* Received bit 5 or Transmit bit 5 */
    byte R6_T6       :1;                                       /* Received bit 6 or Transmit bit 6 */
    byte R7_T7       :1;                                       /* Received bit 7 or Transmit bit 7 */
  } Bits;
} SCI3DRLSTR;
extern volatile SCI3DRLSTR _SCI3DRL @(REG_BASE + 0x000000C7);
#define SCI3DRL                         _SCI3DRL.Byte
#define SCI3DRL_R0_T0                   _SCI3DRL.Bits.R0_T0
#define SCI3DRL_R1_T1                   _SCI3DRL.Bits.R1_T1
#define SCI3DRL_R2_T2                   _SCI3DRL.Bits.R2_T2
#define SCI3DRL_R3_T3                   _SCI3DRL.Bits.R3_T3
#define SCI3DRL_R4_T4                   _SCI3DRL.Bits.R4_T4
#define SCI3DRL_R5_T5                   _SCI3DRL.Bits.R5_T5
#define SCI3DRL_R6_T6                   _SCI3DRL.Bits.R6_T6
#define SCI3DRL_R7_T7                   _SCI3DRL.Bits.R7_T7

#define SCI3DRL_R0_T0_MASK              1
#define SCI3DRL_R1_T1_MASK              2
#define SCI3DRL_R2_T2_MASK              4
#define SCI3DRL_R3_T3_MASK              8
#define SCI3DRL_R4_T4_MASK              16
#define SCI3DRL_R5_T5_MASK              32
#define SCI3DRL_R6_T6_MASK              64
#define SCI3DRL_R7_T7_MASK              128


/*** SCI0BD - SCI 0 Baud Rate Register; 0x000000C8 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SCI0ASR1 - SCI 0 Alternative Status Register 1; 0x000000C8 ***/
    union {
      byte Byte;
      union { /* Several registers at the same address */
        /*** SCI0ASR1 - SCI 0 Alternative Status Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIF       :1;                                       /* Break Detect Interrupt Flag */
            byte BERRIF      :1;                                       /* Bit Error Interrupt Flag */
            byte BERRV       :1;                                       /* Bit Error Value */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIF     :1;                                       /* Receive Input Active Edge Interrupt Flag */
          } Bits;
        } SCI0ASR1STR;
        #define SCI0ASR1                _SCI0BD.Overlap_STR.SCI0ASR1STR.Byte
        #define SCI0ASR1_BKDIF          _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0ASR1STR.Bits.BKDIF
        #define SCI0ASR1_BERRIF         _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0ASR1STR.Bits.BERRIF
        #define SCI0ASR1_BERRV          _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0ASR1STR.Bits.BERRV
        #define SCI0ASR1_RXEDGIF        _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0ASR1STR.Bits.RXEDGIF
        
        #define SCI0ASR1_BKDIF_MASK     1
        #define SCI0ASR1_BERRIF_MASK    2
        #define SCI0ASR1_BERRV_MASK     4
        #define SCI0ASR1_RXEDGIF_MASK   128
        
        /*** SCI0BDH - SCI 0 Baud Rate Register High; Several registers at the same address ***/
        union {
          struct {
            byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
            byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
            byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
            byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
            byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
            byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
            byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
            byte IREN        :1;                                       /* Infrared Enable Bit */
          } Bits;
          struct {
            byte grpSBR_8 :5;
            byte grpTNP :2;
            byte :1;
          } MergedBits;
        } SCI0BDHSTR;
        #define SCI0BDH                 _SCI0BD.Overlap_STR.SCI0ASR1STR.Byte
        #define SCI0BDH_SBR8            _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0BDHSTR.Bits.SBR8
        #define SCI0BDH_SBR9            _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0BDHSTR.Bits.SBR9
        #define SCI0BDH_SBR10           _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0BDHSTR.Bits.SBR10
        #define SCI0BDH_SBR11           _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0BDHSTR.Bits.SBR11
        #define SCI0BDH_SBR12           _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0BDHSTR.Bits.SBR12
        #define SCI0BDH_TNP0            _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0BDHSTR.Bits.TNP0
        #define SCI0BDH_TNP1            _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0BDHSTR.Bits.TNP1
        #define SCI0BDH_IREN            _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0BDHSTR.Bits.IREN
        #define SCI0BDH_SBR_8           _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0BDHSTR.MergedBits.grpSBR_8
        #define SCI0BDH_TNP             _SCI0BD.Overlap_STR.SCI0ASR1STR.SameAddr_STR.SCI0BDHSTR.MergedBits.grpTNP
        #define SCI0BDH_SBR             SCI0BDH_SBR_8
        
