Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
/*** MPUASTAT1 - MPU Address Status Register 1; 0x00000116 ***/
typedef union {
  byte Byte;
  struct {
    byte ADDR8       :1;                                       /* Access violation address bits, bit 8 */
    byte ADDR9       :1;                                       /* Access violation address bits, bit 9 */
    byte ADDR10      :1;                                       /* Access violation address bits, bit 10 */
    byte ADDR11      :1;                                       /* Access violation address bits, bit 11 */
    byte ADDR12      :1;                                       /* Access violation address bits, bit 12 */
    byte ADDR13      :1;                                       /* Access violation address bits, bit 13 */
    byte ADDR14      :1;                                       /* Access violation address bits, bit 14 */
    byte ADDR15      :1;                                       /* Access violation address bits, bit 15 */
  } Bits;
} MPUASTAT1STR;
extern volatile MPUASTAT1STR _MPUASTAT1 @(REG_BASE + 0x00000116);
#define MPUASTAT1                       _MPUASTAT1.Byte
#define MPUASTAT1_ADDR8                 _MPUASTAT1.Bits.ADDR8
#define MPUASTAT1_ADDR9                 _MPUASTAT1.Bits.ADDR9
#define MPUASTAT1_ADDR10                _MPUASTAT1.Bits.ADDR10
#define MPUASTAT1_ADDR11                _MPUASTAT1.Bits.ADDR11
#define MPUASTAT1_ADDR12                _MPUASTAT1.Bits.ADDR12
#define MPUASTAT1_ADDR13                _MPUASTAT1.Bits.ADDR13
#define MPUASTAT1_ADDR14                _MPUASTAT1.Bits.ADDR14
#define MPUASTAT1_ADDR15                _MPUASTAT1.Bits.ADDR15

#define MPUASTAT1_ADDR8_MASK            1
#define MPUASTAT1_ADDR9_MASK            2
#define MPUASTAT1_ADDR10_MASK           4
#define MPUASTAT1_ADDR11_MASK           8
#define MPUASTAT1_ADDR12_MASK           16
#define MPUASTAT1_ADDR13_MASK           32
#define MPUASTAT1_ADDR14_MASK           64
#define MPUASTAT1_ADDR15_MASK           128


/*** MPUASTAT2 - MPU Address Status Register 2; 0x00000117 ***/
typedef union {
  byte Byte;
  struct {
    byte ADDR0       :1;                                       /* Access violation address bits, bit 0 */
    byte ADDR1       :1;                                       /* Access violation address bits, bit 1 */
    byte ADDR2       :1;                                       /* Access violation address bits, bit 2 */
    byte ADDR3       :1;                                       /* Access violation address bits, bit 3 */
    byte ADDR4       :1;                                       /* Access violation address bits, bit 4 */
    byte ADDR5       :1;                                       /* Access violation address bits, bit 5 */
    byte ADDR6       :1;                                       /* Access violation address bits, bit 6 */
    byte ADDR7       :1;                                       /* Access violation address bits, bit 7 */
  } Bits;
} MPUASTAT2STR;
extern volatile MPUASTAT2STR _MPUASTAT2 @(REG_BASE + 0x00000117);
#define MPUASTAT2                       _MPUASTAT2.Byte
#define MPUASTAT2_ADDR0                 _MPUASTAT2.Bits.ADDR0
#define MPUASTAT2_ADDR1                 _MPUASTAT2.Bits.ADDR1
#define MPUASTAT2_ADDR2                 _MPUASTAT2.Bits.ADDR2
#define MPUASTAT2_ADDR3                 _MPUASTAT2.Bits.ADDR3
#define MPUASTAT2_ADDR4                 _MPUASTAT2.Bits.ADDR4
#define MPUASTAT2_ADDR5                 _MPUASTAT2.Bits.ADDR5
#define MPUASTAT2_ADDR6                 _MPUASTAT2.Bits.ADDR6
#define MPUASTAT2_ADDR7                 _MPUASTAT2.Bits.ADDR7

#define MPUASTAT2_ADDR0_MASK            1
#define MPUASTAT2_ADDR1_MASK            2
#define MPUASTAT2_ADDR2_MASK            4
#define MPUASTAT2_ADDR3_MASK            8
#define MPUASTAT2_ADDR4_MASK            16
#define MPUASTAT2_ADDR5_MASK            32
#define MPUASTAT2_ADDR6_MASK            64
#define MPUASTAT2_ADDR7_MASK            128


/*** MPUSEL - MPU Descriptor Select Register; 0x00000119 ***/
typedef union {
  byte Byte;
  struct {
    byte SEL         :3;                                       /* Descriptor select */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte SVSEN       :1;                                       /* MPU supervisor state enable bit */
  } Bits;
} MPUSELSTR;
extern volatile MPUSELSTR _MPUSEL @(REG_BASE + 0x00000119);
#define MPUSEL                          _MPUSEL.Byte
#define MPUSEL_SEL                      _MPUSEL.Bits.SEL
#define MPUSEL_SVSEN                    _MPUSEL.Bits.SVSEN

#define MPUSEL_SEL_MASK                 7
#define MPUSEL_SEL_BITNUM               0
#define MPUSEL_SVSEN_MASK               128


/*** MPUDESC0 - MPU Descriptor Register 0; 0x0000011A ***/
typedef union {
  byte Byte;
  struct {
    byte LOW_ADDR19  :1;                                       /* Memory range lower boundary address bits, bit 19 */
    byte LOW_ADDR20  :1;                                       /* Memory range lower boundary address bits, bit 20 */
    byte LOW_ADDR21  :1;                                       /* Memory range lower boundary address bits, bit 21 */
    byte LOW_ADDR22  :1;                                       /* Memory range lower boundary address bits, bit 22 */
    byte MSTR3       :1;                                       /* Master 3 select bit */
    byte MSTR2       :1;                                       /* Master 2 select bit */
    byte MSTR1       :1;                                       /* Master 1 select bit */
    byte MSTR0       :1;                                       /* Master 0 select bit */
  } Bits;
  struct {
    byte grpLOW_ADDR_19 :4;
    byte grpMSTR_3 :1;
    byte grpMSTR_2 :1;
    byte grpMSTR_1 :1;
    byte grpMSTR :1;
  } MergedBits;
} MPUDESC0STR;
extern volatile MPUDESC0STR _MPUDESC0 @(REG_BASE + 0x0000011A);
#define MPUDESC0                        _MPUDESC0.Byte
#define MPUDESC0_LOW_ADDR19             _MPUDESC0.Bits.LOW_ADDR19
#define MPUDESC0_LOW_ADDR20             _MPUDESC0.Bits.LOW_ADDR20
#define MPUDESC0_LOW_ADDR21             _MPUDESC0.Bits.LOW_ADDR21
#define MPUDESC0_LOW_ADDR22             _MPUDESC0.Bits.LOW_ADDR22
#define MPUDESC0_MSTR3                  _MPUDESC0.Bits.MSTR3
#define MPUDESC0_MSTR2                  _MPUDESC0.Bits.MSTR2
#define MPUDESC0_MSTR1                  _MPUDESC0.Bits.MSTR1
#define MPUDESC0_MSTR0                  _MPUDESC0.Bits.MSTR0
/* MPUDESC_ARR: Access 6 MPUDESCx registers in an array */
#define MPUDESC_ARR                     ((volatile byte *) &MPUDESC0)
#define MPUDESC0_LOW_ADDR_19            _MPUDESC0.MergedBits.grpLOW_ADDR_19
#define MPUDESC0_LOW_ADDR               MPUDESC0_LOW_ADDR_19

#define MPUDESC0_LOW_ADDR19_MASK        1
#define MPUDESC0_LOW_ADDR20_MASK        2
#define MPUDESC0_LOW_ADDR21_MASK        4
#define MPUDESC0_LOW_ADDR22_MASK        8
#define MPUDESC0_MSTR3_MASK             16
#define MPUDESC0_MSTR2_MASK             32
#define MPUDESC0_MSTR1_MASK             64
#define MPUDESC0_MSTR0_MASK             128
#define MPUDESC0_LOW_ADDR_19_MASK       15
#define MPUDESC0_LOW_ADDR_19_BITNUM     0


/*** MPUDESC1 - MPU Descriptor Register 1; 0x0000011B ***/
typedef union {
  byte Byte;
  struct {
    byte LOW_ADDR11  :1;                                       /* Memory range lower boundary address bits, bit 11 */
    byte LOW_ADDR12  :1;                                       /* Memory range lower boundary address bits, bit 12 */
    byte LOW_ADDR13  :1;                                       /* Memory range lower boundary address bits, bit 13 */
    byte LOW_ADDR14  :1;                                       /* Memory range lower boundary address bits, bit 14 */
    byte LOW_ADDR15  :1;                                       /* Memory range lower boundary address bits, bit 15 */
    byte LOW_ADDR16  :1;                                       /* Memory range lower boundary address bits, bit 16 */
    byte LOW_ADDR17  :1;                                       /* Memory range lower boundary address bits, bit 17 */
    byte LOW_ADDR18  :1;                                       /* Memory range lower boundary address bits, bit 18 */
  } Bits;
} MPUDESC1STR;
extern volatile MPUDESC1STR _MPUDESC1 @(REG_BASE + 0x0000011B);
#define MPUDESC1                        _MPUDESC1.Byte
#define MPUDESC1_LOW_ADDR11             _MPUDESC1.Bits.LOW_ADDR11
#define MPUDESC1_LOW_ADDR12             _MPUDESC1.Bits.LOW_ADDR12
#define MPUDESC1_LOW_ADDR13             _MPUDESC1.Bits.LOW_ADDR13
#define MPUDESC1_LOW_ADDR14             _MPUDESC1.Bits.LOW_ADDR14
#define MPUDESC1_LOW_ADDR15             _MPUDESC1.Bits.LOW_ADDR15
#define MPUDESC1_LOW_ADDR16             _MPUDESC1.Bits.LOW_ADDR16
#define MPUDESC1_LOW_ADDR17             _MPUDESC1.Bits.LOW_ADDR17
#define MPUDESC1_LOW_ADDR18             _MPUDESC1.Bits.LOW_ADDR18

#define MPUDESC1_LOW_ADDR11_MASK        1
#define MPUDESC1_LOW_ADDR12_MASK        2
#define MPUDESC1_LOW_ADDR13_MASK        4
#define MPUDESC1_LOW_ADDR14_MASK        8
#define MPUDESC1_LOW_ADDR15_MASK        16
#define MPUDESC1_LOW_ADDR16_MASK        32
#define MPUDESC1_LOW_ADDR17_MASK        64
#define MPUDESC1_LOW_ADDR18_MASK        128


