Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
extern volatile CAN2RFLGSTR _CAN2RFLG @(REG_BASE + 0x000001C4);
#define CAN2RFLG                        _CAN2RFLG.Byte
#define CAN2RFLG_RXF                    _CAN2RFLG.Bits.RXF
#define CAN2RFLG_OVRIF                  _CAN2RFLG.Bits.OVRIF
#define CAN2RFLG_TSTAT0                 _CAN2RFLG.Bits.TSTAT0
#define CAN2RFLG_TSTAT1                 _CAN2RFLG.Bits.TSTAT1
#define CAN2RFLG_RSTAT0                 _CAN2RFLG.Bits.RSTAT0
#define CAN2RFLG_RSTAT1                 _CAN2RFLG.Bits.RSTAT1
#define CAN2RFLG_CSCIF                  _CAN2RFLG.Bits.CSCIF
#define CAN2RFLG_WUPIF                  _CAN2RFLG.Bits.WUPIF
#define CAN2RFLG_TSTAT                  _CAN2RFLG.MergedBits.grpTSTAT
#define CAN2RFLG_RSTAT                  _CAN2RFLG.MergedBits.grpRSTAT

#define CAN2RFLG_RXF_MASK               1
#define CAN2RFLG_OVRIF_MASK             2
#define CAN2RFLG_TSTAT0_MASK            4
#define CAN2RFLG_TSTAT1_MASK            8
#define CAN2RFLG_RSTAT0_MASK            16
#define CAN2RFLG_RSTAT1_MASK            32
#define CAN2RFLG_CSCIF_MASK             64
#define CAN2RFLG_WUPIF_MASK             128
#define CAN2RFLG_TSTAT_MASK             12
#define CAN2RFLG_TSTAT_BITNUM           2
#define CAN2RFLG_RSTAT_MASK             48
#define CAN2RFLG_RSTAT_BITNUM           4


/*** CAN2RIER - MSCAN2 Receiver Interrupt Enable Register; 0x000001C5 ***/
typedef union {
  byte Byte;
  struct {
    byte RXFIE       :1;                                       /* Receiver Full Interrupt Enable */
    byte OVRIE       :1;                                       /* Overrun Interrupt Enable */
    byte TSTATE0     :1;                                       /* Transmitter Status Change Enable 0 */
    byte TSTATE1     :1;                                       /* Transmitter Status Change Enable 1 */
    byte RSTATE0     :1;                                       /* Receiver Status Change Enable 0 */
    byte RSTATE1     :1;                                       /* Receiver Status Change Enable 1 */
    byte CSCIE       :1;                                       /* CAN Status Change Interrupt Enable */
    byte WUPIE       :1;                                       /* Wake-up Interrupt Enable */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTATE :2;
    byte grpRSTATE :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2RIERSTR;
extern volatile CAN2RIERSTR _CAN2RIER @(REG_BASE + 0x000001C5);
#define CAN2RIER                        _CAN2RIER.Byte
#define CAN2RIER_RXFIE                  _CAN2RIER.Bits.RXFIE
#define CAN2RIER_OVRIE                  _CAN2RIER.Bits.OVRIE
#define CAN2RIER_TSTATE0                _CAN2RIER.Bits.TSTATE0
#define CAN2RIER_TSTATE1                _CAN2RIER.Bits.TSTATE1
#define CAN2RIER_RSTATE0                _CAN2RIER.Bits.RSTATE0
#define CAN2RIER_RSTATE1                _CAN2RIER.Bits.RSTATE1
#define CAN2RIER_CSCIE                  _CAN2RIER.Bits.CSCIE
#define CAN2RIER_WUPIE                  _CAN2RIER.Bits.WUPIE
#define CAN2RIER_TSTATE                 _CAN2RIER.MergedBits.grpTSTATE
#define CAN2RIER_RSTATE                 _CAN2RIER.MergedBits.grpRSTATE

#define CAN2RIER_RXFIE_MASK             1
#define CAN2RIER_OVRIE_MASK             2
#define CAN2RIER_TSTATE0_MASK           4
#define CAN2RIER_TSTATE1_MASK           8
#define CAN2RIER_RSTATE0_MASK           16
#define CAN2RIER_RSTATE1_MASK           32
#define CAN2RIER_CSCIE_MASK             64
#define CAN2RIER_WUPIE_MASK             128
#define CAN2RIER_TSTATE_MASK            12
#define CAN2RIER_TSTATE_BITNUM          2
#define CAN2RIER_RSTATE_MASK            48
#define CAN2RIER_RSTATE_BITNUM          4


/*** CAN2TFLG - MSCAN2 Transmitter Flag Register; 0x000001C6 ***/
typedef union {
  byte Byte;
  struct {
    byte TXE0        :1;                                       /* Transmitter Buffer Empty 0 */
    byte TXE1        :1;                                       /* Transmitter Buffer Empty 1 */
    byte TXE2        :1;                                       /* Transmitter Buffer Empty 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXE  :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TFLGSTR;
extern volatile CAN2TFLGSTR _CAN2TFLG @(REG_BASE + 0x000001C6);
#define CAN2TFLG                        _CAN2TFLG.Byte
#define CAN2TFLG_TXE0                   _CAN2TFLG.Bits.TXE0
#define CAN2TFLG_TXE1                   _CAN2TFLG.Bits.TXE1
#define CAN2TFLG_TXE2                   _CAN2TFLG.Bits.TXE2
#define CAN2TFLG_TXE                    _CAN2TFLG.MergedBits.grpTXE

#define CAN2TFLG_TXE0_MASK              1
#define CAN2TFLG_TXE1_MASK              2
#define CAN2TFLG_TXE2_MASK              4
#define CAN2TFLG_TXE_MASK               7
#define CAN2TFLG_TXE_BITNUM             0


/*** CAN2TIER - MSCAN2 Transmitter Interrupt Enable Register; 0x000001C7 ***/
typedef union {
  byte Byte;
  struct {
    byte TXEIE0      :1;                                       /* Transmitter Empty Interrupt Enable 0 */
    byte TXEIE1      :1;                                       /* Transmitter Empty Interrupt Enable 1 */
    byte TXEIE2      :1;                                       /* Transmitter Empty Interrupt Enable 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXEIE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TIERSTR;
extern volatile CAN2TIERSTR _CAN2TIER @(REG_BASE + 0x000001C7);
#define CAN2TIER                        _CAN2TIER.Byte
#define CAN2TIER_TXEIE0                 _CAN2TIER.Bits.TXEIE0
#define CAN2TIER_TXEIE1                 _CAN2TIER.Bits.TXEIE1
#define CAN2TIER_TXEIE2                 _CAN2TIER.Bits.TXEIE2
#define CAN2TIER_TXEIE                  _CAN2TIER.MergedBits.grpTXEIE

#define CAN2TIER_TXEIE0_MASK            1
#define CAN2TIER_TXEIE1_MASK            2
#define CAN2TIER_TXEIE2_MASK            4
#define CAN2TIER_TXEIE_MASK             7
#define CAN2TIER_TXEIE_BITNUM           0


