Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
extern volatile CAN2IDMR3STR _CAN2IDMR3 @(REG_BASE + 0x000001D7);
#define CAN2IDMR3                       _CAN2IDMR3.Byte
#define CAN2IDMR3_AM0                   _CAN2IDMR3.Bits.AM0
#define CAN2IDMR3_AM1                   _CAN2IDMR3.Bits.AM1
#define CAN2IDMR3_AM2                   _CAN2IDMR3.Bits.AM2
#define CAN2IDMR3_AM3                   _CAN2IDMR3.Bits.AM3
#define CAN2IDMR3_AM4                   _CAN2IDMR3.Bits.AM4
#define CAN2IDMR3_AM5                   _CAN2IDMR3.Bits.AM5
#define CAN2IDMR3_AM6                   _CAN2IDMR3.Bits.AM6
#define CAN2IDMR3_AM7                   _CAN2IDMR3.Bits.AM7

#define CAN2IDMR3_AM0_MASK              1
#define CAN2IDMR3_AM1_MASK              2
#define CAN2IDMR3_AM2_MASK              4
#define CAN2IDMR3_AM3_MASK              8
#define CAN2IDMR3_AM4_MASK              16
#define CAN2IDMR3_AM5_MASK              32
#define CAN2IDMR3_AM6_MASK              64
#define CAN2IDMR3_AM7_MASK              128


/*** CAN2IDAR4 - MSCAN2 Identifier Acceptance Register 4; 0x000001D8 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR4STR;
extern volatile CAN2IDAR4STR _CAN2IDAR4 @(REG_BASE + 0x000001D8);
#define CAN2IDAR4                       _CAN2IDAR4.Byte
#define CAN2IDAR4_AC0                   _CAN2IDAR4.Bits.AC0
#define CAN2IDAR4_AC1                   _CAN2IDAR4.Bits.AC1
#define CAN2IDAR4_AC2                   _CAN2IDAR4.Bits.AC2
#define CAN2IDAR4_AC3                   _CAN2IDAR4.Bits.AC3
#define CAN2IDAR4_AC4                   _CAN2IDAR4.Bits.AC4
#define CAN2IDAR4_AC5                   _CAN2IDAR4.Bits.AC5
#define CAN2IDAR4_AC6                   _CAN2IDAR4.Bits.AC6
#define CAN2IDAR4_AC7                   _CAN2IDAR4.Bits.AC7

#define CAN2IDAR4_AC0_MASK              1
#define CAN2IDAR4_AC1_MASK              2
#define CAN2IDAR4_AC2_MASK              4
#define CAN2IDAR4_AC3_MASK              8
#define CAN2IDAR4_AC4_MASK              16
#define CAN2IDAR4_AC5_MASK              32
#define CAN2IDAR4_AC6_MASK              64
#define CAN2IDAR4_AC7_MASK              128


/*** CAN2IDAR5 - MSCAN2 Identifier Acceptance Register 5; 0x000001D9 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR5STR;
extern volatile CAN2IDAR5STR _CAN2IDAR5 @(REG_BASE + 0x000001D9);
#define CAN2IDAR5                       _CAN2IDAR5.Byte
#define CAN2IDAR5_AC0                   _CAN2IDAR5.Bits.AC0
#define CAN2IDAR5_AC1                   _CAN2IDAR5.Bits.AC1
#define CAN2IDAR5_AC2                   _CAN2IDAR5.Bits.AC2
#define CAN2IDAR5_AC3                   _CAN2IDAR5.Bits.AC3
#define CAN2IDAR5_AC4                   _CAN2IDAR5.Bits.AC4
#define CAN2IDAR5_AC5                   _CAN2IDAR5.Bits.AC5
#define CAN2IDAR5_AC6                   _CAN2IDAR5.Bits.AC6
#define CAN2IDAR5_AC7                   _CAN2IDAR5.Bits.AC7

#define CAN2IDAR5_AC0_MASK              1
#define CAN2IDAR5_AC1_MASK              2
#define CAN2IDAR5_AC2_MASK              4
#define CAN2IDAR5_AC3_MASK              8
#define CAN2IDAR5_AC4_MASK              16
#define CAN2IDAR5_AC5_MASK              32
#define CAN2IDAR5_AC6_MASK              64
#define CAN2IDAR5_AC7_MASK              128


/*** CAN2IDAR6 - MSCAN2 Identifier Acceptance Register 6; 0x000001DA ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR6STR;
extern volatile CAN2IDAR6STR _CAN2IDAR6 @(REG_BASE + 0x000001DA);
#define CAN2IDAR6                       _CAN2IDAR6.Byte
#define CAN2IDAR6_AC0                   _CAN2IDAR6.Bits.AC0
#define CAN2IDAR6_AC1                   _CAN2IDAR6.Bits.AC1
#define CAN2IDAR6_AC2                   _CAN2IDAR6.Bits.AC2
#define CAN2IDAR6_AC3                   _CAN2IDAR6.Bits.AC3
#define CAN2IDAR6_AC4                   _CAN2IDAR6.Bits.AC4
#define CAN2IDAR6_AC5                   _CAN2IDAR6.Bits.AC5
#define CAN2IDAR6_AC6                   _CAN2IDAR6.Bits.AC6
#define CAN2IDAR6_AC7                   _CAN2IDAR6.Bits.AC7

#define CAN2IDAR6_AC0_MASK              1
#define CAN2IDAR6_AC1_MASK              2
#define CAN2IDAR6_AC2_MASK              4
#define CAN2IDAR6_AC3_MASK              8
#define CAN2IDAR6_AC4_MASK              16
#define CAN2IDAR6_AC5_MASK              32
#define CAN2IDAR6_AC6_MASK              64
#define CAN2IDAR6_AC7_MASK              128


