Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define CAN2RXIDR2_ID7_MASK             1
#define CAN2RXIDR2_ID8_MASK             2
#define CAN2RXIDR2_ID9_MASK             4
#define CAN2RXIDR2_ID10_MASK            8
#define CAN2RXIDR2_ID11_MASK            16
#define CAN2RXIDR2_ID12_MASK            32
#define CAN2RXIDR2_ID13_MASK            64
#define CAN2RXIDR2_ID14_MASK            128


/*** CAN2RXIDR3 - MSCAN2 Receive Identifier Register 3; 0x000001E3 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN2RXIDR3STR;
extern volatile CAN2RXIDR3STR _CAN2RXIDR3 @(REG_BASE + 0x000001E3);
#define CAN2RXIDR3                      _CAN2RXIDR3.Byte
#define CAN2RXIDR3_RTR                  _CAN2RXIDR3.Bits.RTR
#define CAN2RXIDR3_ID0                  _CAN2RXIDR3.Bits.ID0
#define CAN2RXIDR3_ID1                  _CAN2RXIDR3.Bits.ID1
#define CAN2RXIDR3_ID2                  _CAN2RXIDR3.Bits.ID2
#define CAN2RXIDR3_ID3                  _CAN2RXIDR3.Bits.ID3
#define CAN2RXIDR3_ID4                  _CAN2RXIDR3.Bits.ID4
#define CAN2RXIDR3_ID5                  _CAN2RXIDR3.Bits.ID5
#define CAN2RXIDR3_ID6                  _CAN2RXIDR3.Bits.ID6
#define CAN2RXIDR3_ID                   _CAN2RXIDR3.MergedBits.grpID

#define CAN2RXIDR3_RTR_MASK             1
#define CAN2RXIDR3_ID0_MASK             2
#define CAN2RXIDR3_ID1_MASK             4
#define CAN2RXIDR3_ID2_MASK             8
#define CAN2RXIDR3_ID3_MASK             16
#define CAN2RXIDR3_ID4_MASK             32
#define CAN2RXIDR3_ID5_MASK             64
#define CAN2RXIDR3_ID6_MASK             128
#define CAN2RXIDR3_ID_MASK              254
#define CAN2RXIDR3_ID_BITNUM            1


/*** CAN2RXDSR0 - MSCAN2 Receive Data Segment Register 0; 0x000001E4 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR0STR;
extern volatile CAN2RXDSR0STR _CAN2RXDSR0 @(REG_BASE + 0x000001E4);
#define CAN2RXDSR0                      _CAN2RXDSR0.Byte
#define CAN2RXDSR0_DB0                  _CAN2RXDSR0.Bits.DB0
#define CAN2RXDSR0_DB1                  _CAN2RXDSR0.Bits.DB1
#define CAN2RXDSR0_DB2                  _CAN2RXDSR0.Bits.DB2
#define CAN2RXDSR0_DB3                  _CAN2RXDSR0.Bits.DB3
#define CAN2RXDSR0_DB4                  _CAN2RXDSR0.Bits.DB4
#define CAN2RXDSR0_DB5                  _CAN2RXDSR0.Bits.DB5
#define CAN2RXDSR0_DB6                  _CAN2RXDSR0.Bits.DB6
#define CAN2RXDSR0_DB7                  _CAN2RXDSR0.Bits.DB7
/* CAN2RXDSR_ARR: Access 8 CAN2RXDSRx registers in an array */
#define CAN2RXDSR_ARR                   ((volatile byte *) &CAN2RXDSR0)

#define CAN2RXDSR0_DB0_MASK             1
#define CAN2RXDSR0_DB1_MASK             2
#define CAN2RXDSR0_DB2_MASK             4
#define CAN2RXDSR0_DB3_MASK             8
#define CAN2RXDSR0_DB4_MASK             16
#define CAN2RXDSR0_DB5_MASK             32
#define CAN2RXDSR0_DB6_MASK             64
#define CAN2RXDSR0_DB7_MASK             128


/*** CAN2RXDSR1 - MSCAN2 Receive Data Segment Register 1; 0x000001E5 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR1STR;
extern volatile CAN2RXDSR1STR _CAN2RXDSR1 @(REG_BASE + 0x000001E5);
#define CAN2RXDSR1                      _CAN2RXDSR1.Byte
#define CAN2RXDSR1_DB0                  _CAN2RXDSR1.Bits.DB0
#define CAN2RXDSR1_DB1                  _CAN2RXDSR1.Bits.DB1
#define CAN2RXDSR1_DB2                  _CAN2RXDSR1.Bits.DB2
#define CAN2RXDSR1_DB3                  _CAN2RXDSR1.Bits.DB3
#define CAN2RXDSR1_DB4                  _CAN2RXDSR1.Bits.DB4
#define CAN2RXDSR1_DB5                  _CAN2RXDSR1.Bits.DB5
#define CAN2RXDSR1_DB6                  _CAN2RXDSR1.Bits.DB6
#define CAN2RXDSR1_DB7                  _CAN2RXDSR1.Bits.DB7

#define CAN2RXDSR1_DB0_MASK             1
#define CAN2RXDSR1_DB1_MASK             2
#define CAN2RXDSR1_DB2_MASK             4
#define CAN2RXDSR1_DB3_MASK             8
#define CAN2RXDSR1_DB4_MASK             16
#define CAN2RXDSR1_DB5_MASK             32
#define CAN2RXDSR1_DB6_MASK             64
#define CAN2RXDSR1_DB7_MASK             128


/*** CAN2RXDSR2 - MSCAN2 Receive Data Segment Register 2; 0x000001E6 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR2STR;
extern volatile CAN2RXDSR2STR _CAN2RXDSR2 @(REG_BASE + 0x000001E6);
#define CAN2RXDSR2                      _CAN2RXDSR2.Byte
#define CAN2RXDSR2_DB0                  _CAN2RXDSR2.Bits.DB0
#define CAN2RXDSR2_DB1                  _CAN2RXDSR2.Bits.DB1
#define CAN2RXDSR2_DB2                  _CAN2RXDSR2.Bits.DB2
#define CAN2RXDSR2_DB3                  _CAN2RXDSR2.Bits.DB3
#define CAN2RXDSR2_DB4                  _CAN2RXDSR2.Bits.DB4
#define CAN2RXDSR2_DB5                  _CAN2RXDSR2.Bits.DB5
#define CAN2RXDSR2_DB6                  _CAN2RXDSR2.Bits.DB6
#define CAN2RXDSR2_DB7                  _CAN2RXDSR2.Bits.DB7

#define CAN2RXDSR2_DB0_MASK             1
#define CAN2RXDSR2_DB1_MASK             2
#define CAN2RXDSR2_DB2_MASK             4
#define CAN2RXDSR2_DB3_MASK             8
#define CAN2RXDSR2_DB4_MASK             16
#define CAN2RXDSR2_DB5_MASK             32
#define CAN2RXDSR2_DB6_MASK             64
#define CAN2RXDSR2_DB7_MASK             128


/*** CAN2RXDSR3 - MSCAN2 Receive Data Segment Register 3; 0x000001E7 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR3STR;
extern volatile CAN2RXDSR3STR _CAN2RXDSR3 @(REG_BASE + 0x000001E7);
#define CAN2RXDSR3                      _CAN2RXDSR3.Byte
#define CAN2RXDSR3_DB0                  _CAN2RXDSR3.Bits.DB0
#define CAN2RXDSR3_DB1                  _CAN2RXDSR3.Bits.DB1
#define CAN2RXDSR3_DB2                  _CAN2RXDSR3.Bits.DB2
#define CAN2RXDSR3_DB3                  _CAN2RXDSR3.Bits.DB3
#define CAN2RXDSR3_DB4                  _CAN2RXDSR3.Bits.DB4
#define CAN2RXDSR3_DB5                  _CAN2RXDSR3.Bits.DB5
#define CAN2RXDSR3_DB6                  _CAN2RXDSR3.Bits.DB6
#define CAN2RXDSR3_DB7                  _CAN2RXDSR3.Bits.DB7

#define CAN2RXDSR3_DB0_MASK             1
#define CAN2RXDSR3_DB1_MASK             2
#define CAN2RXDSR3_DB2_MASK             4
#define CAN2RXDSR3_DB3_MASK             8
#define CAN2RXDSR3_DB4_MASK             16
#define CAN2RXDSR3_DB5_MASK             32
#define CAN2RXDSR3_DB6_MASK             64
#define CAN2RXDSR3_DB7_MASK             128


