Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
extern volatile CAN2TXDSR0STR _CAN2TXDSR0 @(REG_BASE + 0x000001F4);
#define CAN2TXDSR0                      _CAN2TXDSR0.Byte
#define CAN2TXDSR0_DB0                  _CAN2TXDSR0.Bits.DB0
#define CAN2TXDSR0_DB1                  _CAN2TXDSR0.Bits.DB1
#define CAN2TXDSR0_DB2                  _CAN2TXDSR0.Bits.DB2
#define CAN2TXDSR0_DB3                  _CAN2TXDSR0.Bits.DB3
#define CAN2TXDSR0_DB4                  _CAN2TXDSR0.Bits.DB4
#define CAN2TXDSR0_DB5                  _CAN2TXDSR0.Bits.DB5
#define CAN2TXDSR0_DB6                  _CAN2TXDSR0.Bits.DB6
#define CAN2TXDSR0_DB7                  _CAN2TXDSR0.Bits.DB7
/* CAN2TXDSR_ARR: Access 8 CAN2TXDSRx registers in an array */
#define CAN2TXDSR_ARR                   ((volatile byte *) &CAN2TXDSR0)

#define CAN2TXDSR0_DB0_MASK             1
#define CAN2TXDSR0_DB1_MASK             2
#define CAN2TXDSR0_DB2_MASK             4
#define CAN2TXDSR0_DB3_MASK             8
#define CAN2TXDSR0_DB4_MASK             16
#define CAN2TXDSR0_DB5_MASK             32
#define CAN2TXDSR0_DB6_MASK             64
#define CAN2TXDSR0_DB7_MASK             128


/*** CAN2TXDSR1 - MSCAN2 Transmit Data Segment Register 1; 0x000001F5 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR1STR;
extern volatile CAN2TXDSR1STR _CAN2TXDSR1 @(REG_BASE + 0x000001F5);
#define CAN2TXDSR1                      _CAN2TXDSR1.Byte
#define CAN2TXDSR1_DB0                  _CAN2TXDSR1.Bits.DB0
#define CAN2TXDSR1_DB1                  _CAN2TXDSR1.Bits.DB1
#define CAN2TXDSR1_DB2                  _CAN2TXDSR1.Bits.DB2
#define CAN2TXDSR1_DB3                  _CAN2TXDSR1.Bits.DB3
#define CAN2TXDSR1_DB4                  _CAN2TXDSR1.Bits.DB4
#define CAN2TXDSR1_DB5                  _CAN2TXDSR1.Bits.DB5
#define CAN2TXDSR1_DB6                  _CAN2TXDSR1.Bits.DB6
#define CAN2TXDSR1_DB7                  _CAN2TXDSR1.Bits.DB7

#define CAN2TXDSR1_DB0_MASK             1
#define CAN2TXDSR1_DB1_MASK             2
#define CAN2TXDSR1_DB2_MASK             4
#define CAN2TXDSR1_DB3_MASK             8
#define CAN2TXDSR1_DB4_MASK             16
#define CAN2TXDSR1_DB5_MASK             32
#define CAN2TXDSR1_DB6_MASK             64
#define CAN2TXDSR1_DB7_MASK             128


/*** CAN2TXDSR2 - MSCAN2 Transmit Data Segment Register 2; 0x000001F6 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR2STR;
extern volatile CAN2TXDSR2STR _CAN2TXDSR2 @(REG_BASE + 0x000001F6);
#define CAN2TXDSR2                      _CAN2TXDSR2.Byte
#define CAN2TXDSR2_DB0                  _CAN2TXDSR2.Bits.DB0
#define CAN2TXDSR2_DB1                  _CAN2TXDSR2.Bits.DB1
#define CAN2TXDSR2_DB2                  _CAN2TXDSR2.Bits.DB2
#define CAN2TXDSR2_DB3                  _CAN2TXDSR2.Bits.DB3
#define CAN2TXDSR2_DB4                  _CAN2TXDSR2.Bits.DB4
#define CAN2TXDSR2_DB5                  _CAN2TXDSR2.Bits.DB5
#define CAN2TXDSR2_DB6                  _CAN2TXDSR2.Bits.DB6
#define CAN2TXDSR2_DB7                  _CAN2TXDSR2.Bits.DB7

#define CAN2TXDSR2_DB0_MASK             1
#define CAN2TXDSR2_DB1_MASK             2
#define CAN2TXDSR2_DB2_MASK             4
#define CAN2TXDSR2_DB3_MASK             8
#define CAN2TXDSR2_DB4_MASK             16
#define CAN2TXDSR2_DB5_MASK             32
#define CAN2TXDSR2_DB6_MASK             64
#define CAN2TXDSR2_DB7_MASK             128


/*** CAN2TXDSR3 - MSCAN2 Transmit Data Segment Register 3; 0x000001F7 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR3STR;
extern volatile CAN2TXDSR3STR _CAN2TXDSR3 @(REG_BASE + 0x000001F7);
#define CAN2TXDSR3                      _CAN2TXDSR3.Byte
#define CAN2TXDSR3_DB0                  _CAN2TXDSR3.Bits.DB0
#define CAN2TXDSR3_DB1                  _CAN2TXDSR3.Bits.DB1
#define CAN2TXDSR3_DB2                  _CAN2TXDSR3.Bits.DB2
#define CAN2TXDSR3_DB3                  _CAN2TXDSR3.Bits.DB3
#define CAN2TXDSR3_DB4                  _CAN2TXDSR3.Bits.DB4
#define CAN2TXDSR3_DB5                  _CAN2TXDSR3.Bits.DB5
#define CAN2TXDSR3_DB6                  _CAN2TXDSR3.Bits.DB6
#define CAN2TXDSR3_DB7                  _CAN2TXDSR3.Bits.DB7

#define CAN2TXDSR3_DB0_MASK             1
#define CAN2TXDSR3_DB1_MASK             2
#define CAN2TXDSR3_DB2_MASK             4
#define CAN2TXDSR3_DB3_MASK             8
#define CAN2TXDSR3_DB4_MASK             16
#define CAN2TXDSR3_DB5_MASK             32
#define CAN2TXDSR3_DB6_MASK             64
#define CAN2TXDSR3_DB7_MASK             128


