Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define CAN2TXDSR7_DB0_MASK             1
#define CAN2TXDSR7_DB1_MASK             2
#define CAN2TXDSR7_DB2_MASK             4
#define CAN2TXDSR7_DB3_MASK             8
#define CAN2TXDSR7_DB4_MASK             16
#define CAN2TXDSR7_DB5_MASK             32
#define CAN2TXDSR7_DB6_MASK             64
#define CAN2TXDSR7_DB7_MASK             128


/*** CAN2TXDLR - MSCAN2 Transmit Data Length Register; 0x000001FC ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TXDLRSTR;
extern volatile CAN2TXDLRSTR _CAN2TXDLR @(REG_BASE + 0x000001FC);
#define CAN2TXDLR                       _CAN2TXDLR.Byte
#define CAN2TXDLR_DLC0                  _CAN2TXDLR.Bits.DLC0
#define CAN2TXDLR_DLC1                  _CAN2TXDLR.Bits.DLC1
#define CAN2TXDLR_DLC2                  _CAN2TXDLR.Bits.DLC2
#define CAN2TXDLR_DLC3                  _CAN2TXDLR.Bits.DLC3
#define CAN2TXDLR_DLC                   _CAN2TXDLR.MergedBits.grpDLC

#define CAN2TXDLR_DLC0_MASK             1
#define CAN2TXDLR_DLC1_MASK             2
#define CAN2TXDLR_DLC2_MASK             4
#define CAN2TXDLR_DLC3_MASK             8
#define CAN2TXDLR_DLC_MASK              15
#define CAN2TXDLR_DLC_BITNUM            0


/*** CAN2TXTBPR - MSCAN2 Transmit Buffer Priority; 0x000001FD ***/
typedef union {
  byte Byte;
  struct {
    byte PRIO0       :1;                                       /* Transmit Buffer Priority Bit 0 */
    byte PRIO1       :1;                                       /* Transmit Buffer Priority Bit 1 */
    byte PRIO2       :1;                                       /* Transmit Buffer Priority Bit 2 */
    byte PRIO3       :1;                                       /* Transmit Buffer Priority Bit 3 */
    byte PRIO4       :1;                                       /* Transmit Buffer Priority Bit 4 */
    byte PRIO5       :1;                                       /* Transmit Buffer Priority Bit 5 */
    byte PRIO6       :1;                                       /* Transmit Buffer Priority Bit 6 */
    byte PRIO7       :1;                                       /* Transmit Buffer Priority Bit 7 */
  } Bits;
} CAN2TXTBPRSTR;
extern volatile CAN2TXTBPRSTR _CAN2TXTBPR @(REG_BASE + 0x000001FD);
#define CAN2TXTBPR                      _CAN2TXTBPR.Byte
#define CAN2TXTBPR_PRIO0                _CAN2TXTBPR.Bits.PRIO0
#define CAN2TXTBPR_PRIO1                _CAN2TXTBPR.Bits.PRIO1
#define CAN2TXTBPR_PRIO2                _CAN2TXTBPR.Bits.PRIO2
#define CAN2TXTBPR_PRIO3                _CAN2TXTBPR.Bits.PRIO3
#define CAN2TXTBPR_PRIO4                _CAN2TXTBPR.Bits.PRIO4
#define CAN2TXTBPR_PRIO5                _CAN2TXTBPR.Bits.PRIO5
#define CAN2TXTBPR_PRIO6                _CAN2TXTBPR.Bits.PRIO6
#define CAN2TXTBPR_PRIO7                _CAN2TXTBPR.Bits.PRIO7

#define CAN2TXTBPR_PRIO0_MASK           1
#define CAN2TXTBPR_PRIO1_MASK           2
#define CAN2TXTBPR_PRIO2_MASK           4
#define CAN2TXTBPR_PRIO3_MASK           8
#define CAN2TXTBPR_PRIO4_MASK           16
#define CAN2TXTBPR_PRIO5_MASK           32
#define CAN2TXTBPR_PRIO6_MASK           64
#define CAN2TXTBPR_PRIO7_MASK           128


/*** CAN2TXTSR - MSCAN2 Transmit Time Stamp Register; 0x000001FE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN2TXTSRH - MSCAN2 Transmit Time Stamp Register High; 0x000001FE ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
    } CAN2TXTSRHSTR;
    #define CAN2TXTSRH                  _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Byte
    #define CAN2TXTSRH_TSR8             _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR8
    #define CAN2TXTSRH_TSR9             _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR9
    #define CAN2TXTSRH_TSR10            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR10
    #define CAN2TXTSRH_TSR11            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR11
    #define CAN2TXTSRH_TSR12            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR12
    #define CAN2TXTSRH_TSR13            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR13
    #define CAN2TXTSRH_TSR14            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR14
    #define CAN2TXTSRH_TSR15            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR15
    
    #define CAN2TXTSRH_TSR8_MASK        1
    #define CAN2TXTSRH_TSR9_MASK        2
    #define CAN2TXTSRH_TSR10_MASK       4
    #define CAN2TXTSRH_TSR11_MASK       8
    #define CAN2TXTSRH_TSR12_MASK       16
    #define CAN2TXTSRH_TSR13_MASK       32
    #define CAN2TXTSRH_TSR14_MASK       64
    #define CAN2TXTSRH_TSR15_MASK       128
    

    /*** CAN2TXTSRL - MSCAN2 Transmit Time Stamp Register Low; 0x000001FF ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
    } CAN2TXTSRLSTR;
    #define CAN2TXTSRL                  _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Byte
    #define CAN2TXTSRL_TSR0             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR0
    #define CAN2TXTSRL_TSR1             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR1
    #define CAN2TXTSRL_TSR2             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR2
    #define CAN2TXTSRL_TSR3             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR3
    #define CAN2TXTSRL_TSR4             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR4
    #define CAN2TXTSRL_TSR5             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR5
    #define CAN2TXTSRL_TSR6             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR6
    #define CAN2TXTSRL_TSR7             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR7
    
    #define CAN2TXTSRL_TSR0_MASK        1
    #define CAN2TXTSRL_TSR1_MASK        2
    #define CAN2TXTSRL_TSR2_MASK        4
    #define CAN2TXTSRL_TSR3_MASK        8
    #define CAN2TXTSRL_TSR4_MASK        16
    #define CAN2TXTSRL_TSR5_MASK        32
    #define CAN2TXTSRL_TSR6_MASK        64
    #define CAN2TXTSRL_TSR7_MASK        128
    
  } Overlap_STR;

