Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
} CAN2TXTSRSTR;
extern volatile CAN2TXTSRSTR _CAN2TXTSR @(REG_BASE + 0x000001FE);
#define CAN2TXTSR                       _CAN2TXTSR.Word
#define CAN2TXTSR_TSR0                  _CAN2TXTSR.Bits.TSR0
#define CAN2TXTSR_TSR1                  _CAN2TXTSR.Bits.TSR1
#define CAN2TXTSR_TSR2                  _CAN2TXTSR.Bits.TSR2
#define CAN2TXTSR_TSR3                  _CAN2TXTSR.Bits.TSR3
#define CAN2TXTSR_TSR4                  _CAN2TXTSR.Bits.TSR4
#define CAN2TXTSR_TSR5                  _CAN2TXTSR.Bits.TSR5
#define CAN2TXTSR_TSR6                  _CAN2TXTSR.Bits.TSR6
#define CAN2TXTSR_TSR7                  _CAN2TXTSR.Bits.TSR7
#define CAN2TXTSR_TSR8                  _CAN2TXTSR.Bits.TSR8
#define CAN2TXTSR_TSR9                  _CAN2TXTSR.Bits.TSR9
#define CAN2TXTSR_TSR10                 _CAN2TXTSR.Bits.TSR10
#define CAN2TXTSR_TSR11                 _CAN2TXTSR.Bits.TSR11
#define CAN2TXTSR_TSR12                 _CAN2TXTSR.Bits.TSR12
#define CAN2TXTSR_TSR13                 _CAN2TXTSR.Bits.TSR13
#define CAN2TXTSR_TSR14                 _CAN2TXTSR.Bits.TSR14
#define CAN2TXTSR_TSR15                 _CAN2TXTSR.Bits.TSR15

#define CAN2TXTSR_TSR0_MASK             1
#define CAN2TXTSR_TSR1_MASK             2
#define CAN2TXTSR_TSR2_MASK             4
#define CAN2TXTSR_TSR3_MASK             8
#define CAN2TXTSR_TSR4_MASK             16
#define CAN2TXTSR_TSR5_MASK             32
#define CAN2TXTSR_TSR6_MASK             64
#define CAN2TXTSR_TSR7_MASK             128
#define CAN2TXTSR_TSR8_MASK             256
#define CAN2TXTSR_TSR9_MASK             512
#define CAN2TXTSR_TSR10_MASK            1024
#define CAN2TXTSR_TSR11_MASK            2048
#define CAN2TXTSR_TSR12_MASK            4096
#define CAN2TXTSR_TSR13_MASK            8192
#define CAN2TXTSR_TSR14_MASK            16384
#define CAN2TXTSR_TSR15_MASK            32768


/*** CAN3CTL0 - MSCAN3 Control 0 Register; 0x00000200 ***/
typedef union {
  byte Byte;
  struct {
    byte INITRQ      :1;                                       /* Initialization Mode Request */
    byte SLPRQ       :1;                                       /* Sleep Mode Request */
    byte WUPE        :1;                                       /* Wake-Up Enable */
    byte TIME        :1;                                       /* Timer Enable */
    byte SYNCH       :1;                                       /* Synchronized Status */
    byte CSWAI       :1;                                       /* CAN Stops in Wait Mode */
    byte RXACT       :1;                                       /* Receiver Active Status */
    byte RXFRM       :1;                                       /* Received Frame Flag */
  } Bits;
} CAN3CTL0STR;
extern volatile CAN3CTL0STR _CAN3CTL0 @(REG_BASE + 0x00000200);
#define CAN3CTL0                        _CAN3CTL0.Byte
#define CAN3CTL0_INITRQ                 _CAN3CTL0.Bits.INITRQ
#define CAN3CTL0_SLPRQ                  _CAN3CTL0.Bits.SLPRQ
#define CAN3CTL0_WUPE                   _CAN3CTL0.Bits.WUPE
#define CAN3CTL0_TIME                   _CAN3CTL0.Bits.TIME
#define CAN3CTL0_SYNCH                  _CAN3CTL0.Bits.SYNCH
#define CAN3CTL0_CSWAI                  _CAN3CTL0.Bits.CSWAI
#define CAN3CTL0_RXACT                  _CAN3CTL0.Bits.RXACT
#define CAN3CTL0_RXFRM                  _CAN3CTL0.Bits.RXFRM
/* CAN3CTL_ARR: Access 2 CAN3CTLx registers in an array */
#define CAN3CTL_ARR                     ((volatile byte *) &CAN3CTL0)

#define CAN3CTL0_INITRQ_MASK            1
#define CAN3CTL0_SLPRQ_MASK             2
#define CAN3CTL0_WUPE_MASK              4
#define CAN3CTL0_TIME_MASK              8
#define CAN3CTL0_SYNCH_MASK             16
#define CAN3CTL0_CSWAI_MASK             32
#define CAN3CTL0_RXACT_MASK             64
#define CAN3CTL0_RXFRM_MASK             128


/*** CAN3CTL1 - MSCAN3 Control 1 Register; 0x00000201 ***/
typedef union {
  byte Byte;
  struct {
    byte INITAK      :1;                                       /* Initialization Mode Acknowledge */
    byte SLPAK       :1;                                       /* Sleep Mode Acknowledge */
    byte WUPM        :1;                                       /* Wake-Up Mode */
    byte BORM        :1;                                       /* Bus-Off Recovery Mode */
    byte LISTEN      :1;                                       /* Listen Only Mode */
    byte LOOPB       :1;                                       /* Loop Back Self Test Mode */
    byte CLKSRC      :1;                                       /* MSCAN Clock Source */
    byte CANE        :1;                                       /* MSCAN Enable */
  } Bits;
} CAN3CTL1STR;
extern volatile CAN3CTL1STR _CAN3CTL1 @(REG_BASE + 0x00000201);
#define CAN3CTL1                        _CAN3CTL1.Byte
#define CAN3CTL1_INITAK                 _CAN3CTL1.Bits.INITAK
#define CAN3CTL1_SLPAK                  _CAN3CTL1.Bits.SLPAK
#define CAN3CTL1_WUPM                   _CAN3CTL1.Bits.WUPM
#define CAN3CTL1_BORM                   _CAN3CTL1.Bits.BORM
#define CAN3CTL1_LISTEN                 _CAN3CTL1.Bits.LISTEN
#define CAN3CTL1_LOOPB                  _CAN3CTL1.Bits.LOOPB
#define CAN3CTL1_CLKSRC                 _CAN3CTL1.Bits.CLKSRC
#define CAN3CTL1_CANE                   _CAN3CTL1.Bits.CANE

#define CAN3CTL1_INITAK_MASK            1
#define CAN3CTL1_SLPAK_MASK             2
#define CAN3CTL1_WUPM_MASK              4
#define CAN3CTL1_BORM_MASK              8
#define CAN3CTL1_LISTEN_MASK            16
#define CAN3CTL1_LOOPB_MASK             32
#define CAN3CTL1_CLKSRC_MASK            64
#define CAN3CTL1_CANE_MASK              128


