Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
/*** CAN3BTR0 - MSCAN3 Bus Timing Register 0; 0x00000202 ***/
typedef union {
  byte Byte;
  struct {
    byte BRP0        :1;                                       /* Baud Rate Prescaler 0 */
    byte BRP1        :1;                                       /* Baud Rate Prescaler 1 */
    byte BRP2        :1;                                       /* Baud Rate Prescaler 2 */
    byte BRP3        :1;                                       /* Baud Rate Prescaler 3 */
    byte BRP4        :1;                                       /* Baud Rate Prescaler 4 */
    byte BRP5        :1;                                       /* Baud Rate Prescaler 5 */
    byte SJW0        :1;                                       /* Synchronization Jump Width 0 */
    byte SJW1        :1;                                       /* Synchronization Jump Width 1 */
  } Bits;
  struct {
    byte grpBRP  :6;
    byte grpSJW  :2;
  } MergedBits;
} CAN3BTR0STR;
extern volatile CAN3BTR0STR _CAN3BTR0 @(REG_BASE + 0x00000202);
#define CAN3BTR0                        _CAN3BTR0.Byte
#define CAN3BTR0_BRP0                   _CAN3BTR0.Bits.BRP0
#define CAN3BTR0_BRP1                   _CAN3BTR0.Bits.BRP1
#define CAN3BTR0_BRP2                   _CAN3BTR0.Bits.BRP2
#define CAN3BTR0_BRP3                   _CAN3BTR0.Bits.BRP3
#define CAN3BTR0_BRP4                   _CAN3BTR0.Bits.BRP4
#define CAN3BTR0_BRP5                   _CAN3BTR0.Bits.BRP5
#define CAN3BTR0_SJW0                   _CAN3BTR0.Bits.SJW0
#define CAN3BTR0_SJW1                   _CAN3BTR0.Bits.SJW1
/* CAN3BTR_ARR: Access 2 CAN3BTRx registers in an array */
#define CAN3BTR_ARR                     ((volatile byte *) &CAN3BTR0)
#define CAN3BTR0_BRP                    _CAN3BTR0.MergedBits.grpBRP
#define CAN3BTR0_SJW                    _CAN3BTR0.MergedBits.grpSJW

#define CAN3BTR0_BRP0_MASK              1
#define CAN3BTR0_BRP1_MASK              2
#define CAN3BTR0_BRP2_MASK              4
#define CAN3BTR0_BRP3_MASK              8
#define CAN3BTR0_BRP4_MASK              16
#define CAN3BTR0_BRP5_MASK              32
#define CAN3BTR0_SJW0_MASK              64
#define CAN3BTR0_SJW1_MASK              128
#define CAN3BTR0_BRP_MASK               63
#define CAN3BTR0_BRP_BITNUM             0
#define CAN3BTR0_SJW_MASK               192
#define CAN3BTR0_SJW_BITNUM             6


/*** CAN3BTR1 - MSCAN3 Bus Timing Register 1; 0x00000203 ***/
typedef union {
  byte Byte;
  struct {
    byte TSEG10      :1;                                       /* Time Segment 10 */
    byte TSEG11      :1;                                       /* Time Segment 11 */
    byte TSEG12      :1;                                       /* Time Segment 12 */
    byte TSEG13      :1;                                       /* Time Segment 13 */
    byte TSEG20      :1;                                       /* Time Segment 20 */
    byte TSEG21      :1;                                       /* Time Segment 21 */
    byte TSEG22      :1;                                       /* Time Segment 22 */
    byte SAMP        :1;                                       /* Sampling */
  } Bits;
  struct {
    byte grpTSEG_10 :4;
    byte grpTSEG_20 :3;
    byte         :1;
  } MergedBits;
} CAN3BTR1STR;
extern volatile CAN3BTR1STR _CAN3BTR1 @(REG_BASE + 0x00000203);
#define CAN3BTR1                        _CAN3BTR1.Byte
#define CAN3BTR1_TSEG10                 _CAN3BTR1.Bits.TSEG10
#define CAN3BTR1_TSEG11                 _CAN3BTR1.Bits.TSEG11
#define CAN3BTR1_TSEG12                 _CAN3BTR1.Bits.TSEG12
#define CAN3BTR1_TSEG13                 _CAN3BTR1.Bits.TSEG13
#define CAN3BTR1_TSEG20                 _CAN3BTR1.Bits.TSEG20
#define CAN3BTR1_TSEG21                 _CAN3BTR1.Bits.TSEG21
#define CAN3BTR1_TSEG22                 _CAN3BTR1.Bits.TSEG22
#define CAN3BTR1_SAMP                   _CAN3BTR1.Bits.SAMP
#define CAN3BTR1_TSEG_10                _CAN3BTR1.MergedBits.grpTSEG_10
#define CAN3BTR1_TSEG_20                _CAN3BTR1.MergedBits.grpTSEG_20
#define CAN3BTR1_TSEG                   CAN3BTR1_TSEG_10

#define CAN3BTR1_TSEG10_MASK            1
#define CAN3BTR1_TSEG11_MASK            2
#define CAN3BTR1_TSEG12_MASK            4
#define CAN3BTR1_TSEG13_MASK            8
#define CAN3BTR1_TSEG20_MASK            16
#define CAN3BTR1_TSEG21_MASK            32
#define CAN3BTR1_TSEG22_MASK            64
#define CAN3BTR1_SAMP_MASK              128
#define CAN3BTR1_TSEG_10_MASK           15
#define CAN3BTR1_TSEG_10_BITNUM         0
#define CAN3BTR1_TSEG_20_MASK           112
#define CAN3BTR1_TSEG_20_BITNUM         4


/*** CAN3RFLG - MSCAN3 Receiver Flag Register; 0x00000204 ***/
typedef union {
  byte Byte;
  struct {
    byte RXF         :1;                                       /* Receive Buffer Full */
    byte OVRIF       :1;                                       /* Overrun Interrupt Flag */
    byte TSTAT0      :1;                                       /* Transmitter Status Bit 0 */
    byte TSTAT1      :1;                                       /* Transmitter Status Bit 1 */
    byte RSTAT0      :1;                                       /* Receiver Status Bit 0 */
    byte RSTAT1      :1;                                       /* Receiver Status Bit 1 */
    byte CSCIF       :1;                                       /* CAN Status Change Interrupt Flag */
    byte WUPIF       :1;                                       /* Wake-up Interrupt Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTAT :2;
    byte grpRSTAT :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3RFLGSTR;
extern volatile CAN3RFLGSTR _CAN3RFLG @(REG_BASE + 0x00000204);
#define CAN3RFLG                        _CAN3RFLG.Byte
#define CAN3RFLG_RXF                    _CAN3RFLG.Bits.RXF
#define CAN3RFLG_OVRIF                  _CAN3RFLG.Bits.OVRIF
#define CAN3RFLG_TSTAT0                 _CAN3RFLG.Bits.TSTAT0
#define CAN3RFLG_TSTAT1                 _CAN3RFLG.Bits.TSTAT1
#define CAN3RFLG_RSTAT0                 _CAN3RFLG.Bits.RSTAT0
#define CAN3RFLG_RSTAT1                 _CAN3RFLG.Bits.RSTAT1
#define CAN3RFLG_CSCIF                  _CAN3RFLG.Bits.CSCIF
#define CAN3RFLG_WUPIF                  _CAN3RFLG.Bits.WUPIF
#define CAN3RFLG_TSTAT                  _CAN3RFLG.MergedBits.grpTSTAT
#define CAN3RFLG_RSTAT                  _CAN3RFLG.MergedBits.grpRSTAT

