Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define CAN3RXERR_RXERR0_MASK           1
#define CAN3RXERR_RXERR1_MASK           2
#define CAN3RXERR_RXERR2_MASK           4
#define CAN3RXERR_RXERR3_MASK           8
#define CAN3RXERR_RXERR4_MASK           16
#define CAN3RXERR_RXERR5_MASK           32
#define CAN3RXERR_RXERR6_MASK           64
#define CAN3RXERR_RXERR7_MASK           128


/*** CAN3TXERR - MSCAN3 Transmit Error Counter Register; 0x0000020F ***/
typedef union {
  byte Byte;
  struct {
    byte TXERR0      :1;                                       /* Bit 0 */
    byte TXERR1      :1;                                       /* Bit 1 */
    byte TXERR2      :1;                                       /* Bit 2 */
    byte TXERR3      :1;                                       /* Bit 3 */
    byte TXERR4      :1;                                       /* Bit 4 */
    byte TXERR5      :1;                                       /* Bit 5 */
    byte TXERR6      :1;                                       /* Bit 6 */
    byte TXERR7      :1;                                       /* Bit 7 */
  } Bits;
} CAN3TXERRSTR;
extern volatile CAN3TXERRSTR _CAN3TXERR @(REG_BASE + 0x0000020F);
#define CAN3TXERR                       _CAN3TXERR.Byte
#define CAN3TXERR_TXERR0                _CAN3TXERR.Bits.TXERR0
#define CAN3TXERR_TXERR1                _CAN3TXERR.Bits.TXERR1
#define CAN3TXERR_TXERR2                _CAN3TXERR.Bits.TXERR2
#define CAN3TXERR_TXERR3                _CAN3TXERR.Bits.TXERR3
#define CAN3TXERR_TXERR4                _CAN3TXERR.Bits.TXERR4
#define CAN3TXERR_TXERR5                _CAN3TXERR.Bits.TXERR5
#define CAN3TXERR_TXERR6                _CAN3TXERR.Bits.TXERR6
#define CAN3TXERR_TXERR7                _CAN3TXERR.Bits.TXERR7

#define CAN3TXERR_TXERR0_MASK           1
#define CAN3TXERR_TXERR1_MASK           2
#define CAN3TXERR_TXERR2_MASK           4
#define CAN3TXERR_TXERR3_MASK           8
#define CAN3TXERR_TXERR4_MASK           16
#define CAN3TXERR_TXERR5_MASK           32
#define CAN3TXERR_TXERR6_MASK           64
#define CAN3TXERR_TXERR7_MASK           128


/*** CAN3IDAR0 - MSCAN3 Identifier Acceptance Register 0; 0x00000210 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN3IDAR0STR;
extern volatile CAN3IDAR0STR _CAN3IDAR0 @(REG_BASE + 0x00000210);
#define CAN3IDAR0                       _CAN3IDAR0.Byte
#define CAN3IDAR0_AC0                   _CAN3IDAR0.Bits.AC0
#define CAN3IDAR0_AC1                   _CAN3IDAR0.Bits.AC1
#define CAN3IDAR0_AC2                   _CAN3IDAR0.Bits.AC2
#define CAN3IDAR0_AC3                   _CAN3IDAR0.Bits.AC3
#define CAN3IDAR0_AC4                   _CAN3IDAR0.Bits.AC4
#define CAN3IDAR0_AC5                   _CAN3IDAR0.Bits.AC5
#define CAN3IDAR0_AC6                   _CAN3IDAR0.Bits.AC6
#define CAN3IDAR0_AC7                   _CAN3IDAR0.Bits.AC7
/* CAN3IDAR_ARR: Access 4 CAN3IDARx registers in an array */
#define CAN3IDAR_ARR                    ((volatile byte *) &CAN3IDAR0)

#define CAN3IDAR0_AC0_MASK              1
#define CAN3IDAR0_AC1_MASK              2
#define CAN3IDAR0_AC2_MASK              4
#define CAN3IDAR0_AC3_MASK              8
#define CAN3IDAR0_AC4_MASK              16
#define CAN3IDAR0_AC5_MASK              32
#define CAN3IDAR0_AC6_MASK              64
#define CAN3IDAR0_AC7_MASK              128


/*** CAN3IDAR1 - MSCAN3 Identifier Acceptance Register 1; 0x00000211 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN3IDAR1STR;
extern volatile CAN3IDAR1STR _CAN3IDAR1 @(REG_BASE + 0x00000211);
#define CAN3IDAR1                       _CAN3IDAR1.Byte
#define CAN3IDAR1_AC0                   _CAN3IDAR1.Bits.AC0
#define CAN3IDAR1_AC1                   _CAN3IDAR1.Bits.AC1
#define CAN3IDAR1_AC2                   _CAN3IDAR1.Bits.AC2
#define CAN3IDAR1_AC3                   _CAN3IDAR1.Bits.AC3
#define CAN3IDAR1_AC4                   _CAN3IDAR1.Bits.AC4
#define CAN3IDAR1_AC5                   _CAN3IDAR1.Bits.AC5
#define CAN3IDAR1_AC6                   _CAN3IDAR1.Bits.AC6
#define CAN3IDAR1_AC7                   _CAN3IDAR1.Bits.AC7

#define CAN3IDAR1_AC0_MASK              1
#define CAN3IDAR1_AC1_MASK              2
#define CAN3IDAR1_AC2_MASK              4
#define CAN3IDAR1_AC3_MASK              8
#define CAN3IDAR1_AC4_MASK              16
#define CAN3IDAR1_AC5_MASK              32
#define CAN3IDAR1_AC6_MASK              64
#define CAN3IDAR1_AC7_MASK              128


/*** CAN3IDAR2 - MSCAN3 Identifier Acceptance Register 2; 0x00000212 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN3IDAR2STR;
extern volatile CAN3IDAR2STR _CAN3IDAR2 @(REG_BASE + 0x00000212);
#define CAN3IDAR2                       _CAN3IDAR2.Byte
#define CAN3IDAR2_AC0                   _CAN3IDAR2.Bits.AC0
#define CAN3IDAR2_AC1                   _CAN3IDAR2.Bits.AC1
#define CAN3IDAR2_AC2                   _CAN3IDAR2.Bits.AC2
#define CAN3IDAR2_AC3                   _CAN3IDAR2.Bits.AC3
#define CAN3IDAR2_AC4                   _CAN3IDAR2.Bits.AC4
#define CAN3IDAR2_AC5                   _CAN3IDAR2.Bits.AC5
#define CAN3IDAR2_AC6                   _CAN3IDAR2.Bits.AC6
#define CAN3IDAR2_AC7                   _CAN3IDAR2.Bits.AC7

#define CAN3IDAR2_AC0_MASK              1
#define CAN3IDAR2_AC1_MASK              2
#define CAN3IDAR2_AC2_MASK              4
#define CAN3IDAR2_AC3_MASK              8
#define CAN3IDAR2_AC4_MASK              16
#define CAN3IDAR2_AC5_MASK              32
#define CAN3IDAR2_AC6_MASK              64
#define CAN3IDAR2_AC7_MASK              128


/*** CAN3IDAR3 - MSCAN3 Identifier Acceptance Register 3; 0x00000213 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN3IDAR3STR;
extern volatile CAN3IDAR3STR _CAN3IDAR3 @(REG_BASE + 0x00000213);
#define CAN3IDAR3                       _CAN3IDAR3.Byte
#define CAN3IDAR3_AC0                   _CAN3IDAR3.Bits.AC0
#define CAN3IDAR3_AC1                   _CAN3IDAR3.Bits.AC1
#define CAN3IDAR3_AC2                   _CAN3IDAR3.Bits.AC2
#define CAN3IDAR3_AC3                   _CAN3IDAR3.Bits.AC3
#define CAN3IDAR3_AC4                   _CAN3IDAR3.Bits.AC4
#define CAN3IDAR3_AC5                   _CAN3IDAR3.Bits.AC5
#define CAN3IDAR3_AC6                   _CAN3IDAR3.Bits.AC6
#define CAN3IDAR3_AC7                   _CAN3IDAR3.Bits.AC7

