Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define CAN3IDAR3_AC0_MASK              1
#define CAN3IDAR3_AC1_MASK              2
#define CAN3IDAR3_AC2_MASK              4
#define CAN3IDAR3_AC3_MASK              8
#define CAN3IDAR3_AC4_MASK              16
#define CAN3IDAR3_AC5_MASK              32
#define CAN3IDAR3_AC6_MASK              64
#define CAN3IDAR3_AC7_MASK              128


/*** CAN3IDMR0 - MSCAN3 Identifier Mask Register 0; 0x00000214 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN3IDMR0STR;
extern volatile CAN3IDMR0STR _CAN3IDMR0 @(REG_BASE + 0x00000214);
#define CAN3IDMR0                       _CAN3IDMR0.Byte
#define CAN3IDMR0_AM0                   _CAN3IDMR0.Bits.AM0
#define CAN3IDMR0_AM1                   _CAN3IDMR0.Bits.AM1
#define CAN3IDMR0_AM2                   _CAN3IDMR0.Bits.AM2
#define CAN3IDMR0_AM3                   _CAN3IDMR0.Bits.AM3
#define CAN3IDMR0_AM4                   _CAN3IDMR0.Bits.AM4
#define CAN3IDMR0_AM5                   _CAN3IDMR0.Bits.AM5
#define CAN3IDMR0_AM6                   _CAN3IDMR0.Bits.AM6
#define CAN3IDMR0_AM7                   _CAN3IDMR0.Bits.AM7
/* CAN3IDMR_ARR: Access 4 CAN3IDMRx registers in an array */
#define CAN3IDMR_ARR                    ((volatile byte *) &CAN3IDMR0)

#define CAN3IDMR0_AM0_MASK              1
#define CAN3IDMR0_AM1_MASK              2
#define CAN3IDMR0_AM2_MASK              4
#define CAN3IDMR0_AM3_MASK              8
#define CAN3IDMR0_AM4_MASK              16
#define CAN3IDMR0_AM5_MASK              32
#define CAN3IDMR0_AM6_MASK              64
#define CAN3IDMR0_AM7_MASK              128


/*** CAN3IDMR1 - MSCAN3 Identifier Mask Register 1; 0x00000215 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN3IDMR1STR;
extern volatile CAN3IDMR1STR _CAN3IDMR1 @(REG_BASE + 0x00000215);
#define CAN3IDMR1                       _CAN3IDMR1.Byte
#define CAN3IDMR1_AM0                   _CAN3IDMR1.Bits.AM0
#define CAN3IDMR1_AM1                   _CAN3IDMR1.Bits.AM1
#define CAN3IDMR1_AM2                   _CAN3IDMR1.Bits.AM2
#define CAN3IDMR1_AM3                   _CAN3IDMR1.Bits.AM3
#define CAN3IDMR1_AM4                   _CAN3IDMR1.Bits.AM4
#define CAN3IDMR1_AM5                   _CAN3IDMR1.Bits.AM5
#define CAN3IDMR1_AM6                   _CAN3IDMR1.Bits.AM6
#define CAN3IDMR1_AM7                   _CAN3IDMR1.Bits.AM7

#define CAN3IDMR1_AM0_MASK              1
#define CAN3IDMR1_AM1_MASK              2
#define CAN3IDMR1_AM2_MASK              4
#define CAN3IDMR1_AM3_MASK              8
#define CAN3IDMR1_AM4_MASK              16
#define CAN3IDMR1_AM5_MASK              32
#define CAN3IDMR1_AM6_MASK              64
#define CAN3IDMR1_AM7_MASK              128


/*** CAN3IDMR2 - MSCAN3 Identifier Mask Register 2; 0x00000216 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN3IDMR2STR;
extern volatile CAN3IDMR2STR _CAN3IDMR2 @(REG_BASE + 0x00000216);
#define CAN3IDMR2                       _CAN3IDMR2.Byte
#define CAN3IDMR2_AM0                   _CAN3IDMR2.Bits.AM0
#define CAN3IDMR2_AM1                   _CAN3IDMR2.Bits.AM1
#define CAN3IDMR2_AM2                   _CAN3IDMR2.Bits.AM2
#define CAN3IDMR2_AM3                   _CAN3IDMR2.Bits.AM3
#define CAN3IDMR2_AM4                   _CAN3IDMR2.Bits.AM4
#define CAN3IDMR2_AM5                   _CAN3IDMR2.Bits.AM5
#define CAN3IDMR2_AM6                   _CAN3IDMR2.Bits.AM6
#define CAN3IDMR2_AM7                   _CAN3IDMR2.Bits.AM7

#define CAN3IDMR2_AM0_MASK              1
#define CAN3IDMR2_AM1_MASK              2
#define CAN3IDMR2_AM2_MASK              4
#define CAN3IDMR2_AM3_MASK              8
#define CAN3IDMR2_AM4_MASK              16
#define CAN3IDMR2_AM5_MASK              32
#define CAN3IDMR2_AM6_MASK              64
#define CAN3IDMR2_AM7_MASK              128


/*** CAN3IDMR3 - MSCAN3 Identifier Mask Register 3; 0x00000217 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN3IDMR3STR;
extern volatile CAN3IDMR3STR _CAN3IDMR3 @(REG_BASE + 0x00000217);
#define CAN3IDMR3                       _CAN3IDMR3.Byte
#define CAN3IDMR3_AM0                   _CAN3IDMR3.Bits.AM0
#define CAN3IDMR3_AM1                   _CAN3IDMR3.Bits.AM1
#define CAN3IDMR3_AM2                   _CAN3IDMR3.Bits.AM2
#define CAN3IDMR3_AM3                   _CAN3IDMR3.Bits.AM3
#define CAN3IDMR3_AM4                   _CAN3IDMR3.Bits.AM4
#define CAN3IDMR3_AM5                   _CAN3IDMR3.Bits.AM5
#define CAN3IDMR3_AM6                   _CAN3IDMR3.Bits.AM6
#define CAN3IDMR3_AM7                   _CAN3IDMR3.Bits.AM7

#define CAN3IDMR3_AM0_MASK              1
#define CAN3IDMR3_AM1_MASK              2
#define CAN3IDMR3_AM2_MASK              4
#define CAN3IDMR3_AM3_MASK              8
#define CAN3IDMR3_AM4_MASK              16
#define CAN3IDMR3_AM5_MASK              32
#define CAN3IDMR3_AM6_MASK              64
#define CAN3IDMR3_AM7_MASK              128


/*** CAN3IDAR4 - MSCAN3 Identifier Acceptance Register 4; 0x00000218 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN3IDAR4STR;
extern volatile CAN3IDAR4STR _CAN3IDAR4 @(REG_BASE + 0x00000218);
#define CAN3IDAR4                       _CAN3IDAR4.Byte
#define CAN3IDAR4_AC0                   _CAN3IDAR4.Bits.AC0
#define CAN3IDAR4_AC1                   _CAN3IDAR4.Bits.AC1
#define CAN3IDAR4_AC2                   _CAN3IDAR4.Bits.AC2
#define CAN3IDAR4_AC3                   _CAN3IDAR4.Bits.AC3
#define CAN3IDAR4_AC4                   _CAN3IDAR4.Bits.AC4
#define CAN3IDAR4_AC5                   _CAN3IDAR4.Bits.AC5
#define CAN3IDAR4_AC6                   _CAN3IDAR4.Bits.AC6
#define CAN3IDAR4_AC7                   _CAN3IDAR4.Bits.AC7

