Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
/*** CAN3RXDSR5 - MSCAN3 Receive Data Segment Register 5; 0x00000229 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR5STR;
extern volatile CAN3RXDSR5STR _CAN3RXDSR5 @(REG_BASE + 0x00000229);
#define CAN3RXDSR5                      _CAN3RXDSR5.Byte
#define CAN3RXDSR5_DB0                  _CAN3RXDSR5.Bits.DB0
#define CAN3RXDSR5_DB1                  _CAN3RXDSR5.Bits.DB1
#define CAN3RXDSR5_DB2                  _CAN3RXDSR5.Bits.DB2
#define CAN3RXDSR5_DB3                  _CAN3RXDSR5.Bits.DB3
#define CAN3RXDSR5_DB4                  _CAN3RXDSR5.Bits.DB4
#define CAN3RXDSR5_DB5                  _CAN3RXDSR5.Bits.DB5
#define CAN3RXDSR5_DB6                  _CAN3RXDSR5.Bits.DB6
#define CAN3RXDSR5_DB7                  _CAN3RXDSR5.Bits.DB7

#define CAN3RXDSR5_DB0_MASK             1
#define CAN3RXDSR5_DB1_MASK             2
#define CAN3RXDSR5_DB2_MASK             4
#define CAN3RXDSR5_DB3_MASK             8
#define CAN3RXDSR5_DB4_MASK             16
#define CAN3RXDSR5_DB5_MASK             32
#define CAN3RXDSR5_DB6_MASK             64
#define CAN3RXDSR5_DB7_MASK             128


/*** CAN3RXDSR6 - MSCAN3 Receive Data Segment Register 6; 0x0000022A ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR6STR;
extern volatile CAN3RXDSR6STR _CAN3RXDSR6 @(REG_BASE + 0x0000022A);
#define CAN3RXDSR6                      _CAN3RXDSR6.Byte
#define CAN3RXDSR6_DB0                  _CAN3RXDSR6.Bits.DB0
#define CAN3RXDSR6_DB1                  _CAN3RXDSR6.Bits.DB1
#define CAN3RXDSR6_DB2                  _CAN3RXDSR6.Bits.DB2
#define CAN3RXDSR6_DB3                  _CAN3RXDSR6.Bits.DB3
#define CAN3RXDSR6_DB4                  _CAN3RXDSR6.Bits.DB4
#define CAN3RXDSR6_DB5                  _CAN3RXDSR6.Bits.DB5
#define CAN3RXDSR6_DB6                  _CAN3RXDSR6.Bits.DB6
#define CAN3RXDSR6_DB7                  _CAN3RXDSR6.Bits.DB7

#define CAN3RXDSR6_DB0_MASK             1
#define CAN3RXDSR6_DB1_MASK             2
#define CAN3RXDSR6_DB2_MASK             4
#define CAN3RXDSR6_DB3_MASK             8
#define CAN3RXDSR6_DB4_MASK             16
#define CAN3RXDSR6_DB5_MASK             32
#define CAN3RXDSR6_DB6_MASK             64
#define CAN3RXDSR6_DB7_MASK             128


/*** CAN3RXDSR7 - MSCAN3 Receive Data Segment Register 7; 0x0000022B ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR7STR;
extern volatile CAN3RXDSR7STR _CAN3RXDSR7 @(REG_BASE + 0x0000022B);
#define CAN3RXDSR7                      _CAN3RXDSR7.Byte
#define CAN3RXDSR7_DB0                  _CAN3RXDSR7.Bits.DB0
#define CAN3RXDSR7_DB1                  _CAN3RXDSR7.Bits.DB1
#define CAN3RXDSR7_DB2                  _CAN3RXDSR7.Bits.DB2
#define CAN3RXDSR7_DB3                  _CAN3RXDSR7.Bits.DB3
#define CAN3RXDSR7_DB4                  _CAN3RXDSR7.Bits.DB4
#define CAN3RXDSR7_DB5                  _CAN3RXDSR7.Bits.DB5
#define CAN3RXDSR7_DB6                  _CAN3RXDSR7.Bits.DB6
#define CAN3RXDSR7_DB7                  _CAN3RXDSR7.Bits.DB7

#define CAN3RXDSR7_DB0_MASK             1
#define CAN3RXDSR7_DB1_MASK             2
#define CAN3RXDSR7_DB2_MASK             4
#define CAN3RXDSR7_DB3_MASK             8
#define CAN3RXDSR7_DB4_MASK             16
#define CAN3RXDSR7_DB5_MASK             32
#define CAN3RXDSR7_DB6_MASK             64
#define CAN3RXDSR7_DB7_MASK             128


/*** CAN3RXDLR - MSCAN3 Receive Data Length Register; 0x0000022C ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3RXDLRSTR;
extern volatile CAN3RXDLRSTR _CAN3RXDLR @(REG_BASE + 0x0000022C);
#define CAN3RXDLR                       _CAN3RXDLR.Byte
#define CAN3RXDLR_DLC0                  _CAN3RXDLR.Bits.DLC0
#define CAN3RXDLR_DLC1                  _CAN3RXDLR.Bits.DLC1
#define CAN3RXDLR_DLC2                  _CAN3RXDLR.Bits.DLC2
#define CAN3RXDLR_DLC3                  _CAN3RXDLR.Bits.DLC3
#define CAN3RXDLR_DLC                   _CAN3RXDLR.MergedBits.grpDLC

#define CAN3RXDLR_DLC0_MASK             1
#define CAN3RXDLR_DLC1_MASK             2
#define CAN3RXDLR_DLC2_MASK             4
#define CAN3RXDLR_DLC3_MASK             8
#define CAN3RXDLR_DLC_MASK              15
#define CAN3RXDLR_DLC_BITNUM            0


/*** CAN3RXTSR - MSCAN3 Receive Time Stamp Register; 0x0000022E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN3RXTSRH - MSCAN3 Receive Time Stamp Register High; 0x0000022E ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
    } CAN3RXTSRHSTR;
    #define CAN3RXTSRH                  _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Byte
    #define CAN3RXTSRH_TSR8             _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR8
    #define CAN3RXTSRH_TSR9             _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR9
    #define CAN3RXTSRH_TSR10            _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR10
    #define CAN3RXTSRH_TSR11            _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR11
    #define CAN3RXTSRH_TSR12            _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR12
    #define CAN3RXTSRH_TSR13            _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR13
    #define CAN3RXTSRH_TSR14            _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR14
    #define CAN3RXTSRH_TSR15            _CAN3RXTSR.Overlap_STR.CAN3RXTSRHSTR.Bits.TSR15
    
    #define CAN3RXTSRH_TSR8_MASK        1
    #define CAN3RXTSRH_TSR9_MASK        2
    #define CAN3RXTSRH_TSR10_MASK       4
    #define CAN3RXTSRH_TSR11_MASK       8
    #define CAN3RXTSRH_TSR12_MASK       16
    #define CAN3RXTSRH_TSR13_MASK       32
    #define CAN3RXTSRH_TSR14_MASK       64
    #define CAN3RXTSRH_TSR15_MASK       128
    

