Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
    /*** CAN3RXTSRL - MSCAN3 Receive Time Stamp Register Low; 0x0000022F ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
    } CAN3RXTSRLSTR;
    #define CAN3RXTSRL                  _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Byte
    #define CAN3RXTSRL_TSR0             _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR0
    #define CAN3RXTSRL_TSR1             _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR1
    #define CAN3RXTSRL_TSR2             _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR2
    #define CAN3RXTSRL_TSR3             _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR3
    #define CAN3RXTSRL_TSR4             _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR4
    #define CAN3RXTSRL_TSR5             _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR5
    #define CAN3RXTSRL_TSR6             _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR6
    #define CAN3RXTSRL_TSR7             _CAN3RXTSR.Overlap_STR.CAN3RXTSRLSTR.Bits.TSR7
    
    #define CAN3RXTSRL_TSR0_MASK        1
    #define CAN3RXTSRL_TSR1_MASK        2
    #define CAN3RXTSRL_TSR2_MASK        4
    #define CAN3RXTSRL_TSR3_MASK        8
    #define CAN3RXTSRL_TSR4_MASK        16
    #define CAN3RXTSRL_TSR5_MASK        32
    #define CAN3RXTSRL_TSR6_MASK        64
    #define CAN3RXTSRL_TSR7_MASK        128
    
  } Overlap_STR;

  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
} CAN3RXTSRSTR;
extern volatile CAN3RXTSRSTR _CAN3RXTSR @(REG_BASE + 0x0000022E);
#define CAN3RXTSR                       _CAN3RXTSR.Word
#define CAN3RXTSR_TSR0                  _CAN3RXTSR.Bits.TSR0
#define CAN3RXTSR_TSR1                  _CAN3RXTSR.Bits.TSR1
#define CAN3RXTSR_TSR2                  _CAN3RXTSR.Bits.TSR2
#define CAN3RXTSR_TSR3                  _CAN3RXTSR.Bits.TSR3
#define CAN3RXTSR_TSR4                  _CAN3RXTSR.Bits.TSR4
#define CAN3RXTSR_TSR5                  _CAN3RXTSR.Bits.TSR5
#define CAN3RXTSR_TSR6                  _CAN3RXTSR.Bits.TSR6
#define CAN3RXTSR_TSR7                  _CAN3RXTSR.Bits.TSR7
#define CAN3RXTSR_TSR8                  _CAN3RXTSR.Bits.TSR8
#define CAN3RXTSR_TSR9                  _CAN3RXTSR.Bits.TSR9
#define CAN3RXTSR_TSR10                 _CAN3RXTSR.Bits.TSR10
#define CAN3RXTSR_TSR11                 _CAN3RXTSR.Bits.TSR11
#define CAN3RXTSR_TSR12                 _CAN3RXTSR.Bits.TSR12
#define CAN3RXTSR_TSR13                 _CAN3RXTSR.Bits.TSR13
#define CAN3RXTSR_TSR14                 _CAN3RXTSR.Bits.TSR14
#define CAN3RXTSR_TSR15                 _CAN3RXTSR.Bits.TSR15

#define CAN3RXTSR_TSR0_MASK             1
#define CAN3RXTSR_TSR1_MASK             2
#define CAN3RXTSR_TSR2_MASK             4
#define CAN3RXTSR_TSR3_MASK             8
#define CAN3RXTSR_TSR4_MASK             16
#define CAN3RXTSR_TSR5_MASK             32
#define CAN3RXTSR_TSR6_MASK             64
#define CAN3RXTSR_TSR7_MASK             128
#define CAN3RXTSR_TSR8_MASK             256
#define CAN3RXTSR_TSR9_MASK             512
#define CAN3RXTSR_TSR10_MASK            1024
#define CAN3RXTSR_TSR11_MASK            2048
#define CAN3RXTSR_TSR12_MASK            4096
#define CAN3RXTSR_TSR13_MASK            8192
#define CAN3RXTSR_TSR14_MASK            16384
#define CAN3RXTSR_TSR15_MASK            32768


/*** CAN3TXIDR0 - MSCAN3 Transmit Identifier Register 0; 0x00000230 ***/
typedef union {
  byte Byte;
  struct {
    byte ID21        :1;                                       /* Extended format identifier Bit 21 */
    byte ID22        :1;                                       /* Extended format identifier Bit 22 */
    byte ID23        :1;                                       /* Extended format identifier Bit 23 */
    byte ID24        :1;                                       /* Extended format identifier Bit 24 */
    byte ID25        :1;                                       /* Extended format identifier Bit 25 */
    byte ID26        :1;                                       /* Extended format identifier Bit 26 */
    byte ID27        :1;                                       /* Extended format identifier Bit 27 */
    byte ID28        :1;                                       /* Extended format identifier Bit 28 */
  } Bits;
} CAN3TXIDR0STR;
extern volatile CAN3TXIDR0STR _CAN3TXIDR0 @(REG_BASE + 0x00000230);
#define CAN3TXIDR0                      _CAN3TXIDR0.Byte
#define CAN3TXIDR0_ID21                 _CAN3TXIDR0.Bits.ID21
#define CAN3TXIDR0_ID22                 _CAN3TXIDR0.Bits.ID22
#define CAN3TXIDR0_ID23                 _CAN3TXIDR0.Bits.ID23
#define CAN3TXIDR0_ID24                 _CAN3TXIDR0.Bits.ID24
#define CAN3TXIDR0_ID25                 _CAN3TXIDR0.Bits.ID25
#define CAN3TXIDR0_ID26                 _CAN3TXIDR0.Bits.ID26
#define CAN3TXIDR0_ID27                 _CAN3TXIDR0.Bits.ID27
#define CAN3TXIDR0_ID28                 _CAN3TXIDR0.Bits.ID28
/* CAN3TXIDR_ARR: Access 4 CAN3TXIDRx registers in an array */
#define CAN3TXIDR_ARR                   ((volatile byte *) &CAN3TXIDR0)

