Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
/*** CAN3TXDSR0 - MSCAN3 Transmit Data Segment Register 0; 0x00000234 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR0STR;
extern volatile CAN3TXDSR0STR _CAN3TXDSR0 @(REG_BASE + 0x00000234);
#define CAN3TXDSR0                      _CAN3TXDSR0.Byte
#define CAN3TXDSR0_DB0                  _CAN3TXDSR0.Bits.DB0
#define CAN3TXDSR0_DB1                  _CAN3TXDSR0.Bits.DB1
#define CAN3TXDSR0_DB2                  _CAN3TXDSR0.Bits.DB2
#define CAN3TXDSR0_DB3                  _CAN3TXDSR0.Bits.DB3
#define CAN3TXDSR0_DB4                  _CAN3TXDSR0.Bits.DB4
#define CAN3TXDSR0_DB5                  _CAN3TXDSR0.Bits.DB5
#define CAN3TXDSR0_DB6                  _CAN3TXDSR0.Bits.DB6
#define CAN3TXDSR0_DB7                  _CAN3TXDSR0.Bits.DB7
/* CAN3TXDSR_ARR: Access 8 CAN3TXDSRx registers in an array */
#define CAN3TXDSR_ARR                   ((volatile byte *) &CAN3TXDSR0)

#define CAN3TXDSR0_DB0_MASK             1
#define CAN3TXDSR0_DB1_MASK             2
#define CAN3TXDSR0_DB2_MASK             4
#define CAN3TXDSR0_DB3_MASK             8
#define CAN3TXDSR0_DB4_MASK             16
#define CAN3TXDSR0_DB5_MASK             32
#define CAN3TXDSR0_DB6_MASK             64
#define CAN3TXDSR0_DB7_MASK             128


/*** CAN3TXDSR1 - MSCAN3 Transmit Data Segment Register 1; 0x00000235 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR1STR;
extern volatile CAN3TXDSR1STR _CAN3TXDSR1 @(REG_BASE + 0x00000235);
#define CAN3TXDSR1                      _CAN3TXDSR1.Byte
#define CAN3TXDSR1_DB0                  _CAN3TXDSR1.Bits.DB0
#define CAN3TXDSR1_DB1                  _CAN3TXDSR1.Bits.DB1
#define CAN3TXDSR1_DB2                  _CAN3TXDSR1.Bits.DB2
#define CAN3TXDSR1_DB3                  _CAN3TXDSR1.Bits.DB3
#define CAN3TXDSR1_DB4                  _CAN3TXDSR1.Bits.DB4
#define CAN3TXDSR1_DB5                  _CAN3TXDSR1.Bits.DB5
#define CAN3TXDSR1_DB6                  _CAN3TXDSR1.Bits.DB6
#define CAN3TXDSR1_DB7                  _CAN3TXDSR1.Bits.DB7

#define CAN3TXDSR1_DB0_MASK             1
#define CAN3TXDSR1_DB1_MASK             2
#define CAN3TXDSR1_DB2_MASK             4
#define CAN3TXDSR1_DB3_MASK             8
#define CAN3TXDSR1_DB4_MASK             16
#define CAN3TXDSR1_DB5_MASK             32
#define CAN3TXDSR1_DB6_MASK             64
#define CAN3TXDSR1_DB7_MASK             128


/*** CAN3TXDSR2 - MSCAN3 Transmit Data Segment Register 2; 0x00000236 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR2STR;
extern volatile CAN3TXDSR2STR _CAN3TXDSR2 @(REG_BASE + 0x00000236);
#define CAN3TXDSR2                      _CAN3TXDSR2.Byte
#define CAN3TXDSR2_DB0                  _CAN3TXDSR2.Bits.DB0
#define CAN3TXDSR2_DB1                  _CAN3TXDSR2.Bits.DB1
#define CAN3TXDSR2_DB2                  _CAN3TXDSR2.Bits.DB2
#define CAN3TXDSR2_DB3                  _CAN3TXDSR2.Bits.DB3
#define CAN3TXDSR2_DB4                  _CAN3TXDSR2.Bits.DB4
#define CAN3TXDSR2_DB5                  _CAN3TXDSR2.Bits.DB5
#define CAN3TXDSR2_DB6                  _CAN3TXDSR2.Bits.DB6
#define CAN3TXDSR2_DB7                  _CAN3TXDSR2.Bits.DB7

#define CAN3TXDSR2_DB0_MASK             1
#define CAN3TXDSR2_DB1_MASK             2
#define CAN3TXDSR2_DB2_MASK             4
#define CAN3TXDSR2_DB3_MASK             8
#define CAN3TXDSR2_DB4_MASK             16
#define CAN3TXDSR2_DB5_MASK             32
#define CAN3TXDSR2_DB6_MASK             64
#define CAN3TXDSR2_DB7_MASK             128


/*** CAN3TXDSR3 - MSCAN3 Transmit Data Segment Register 3; 0x00000237 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR3STR;
