Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define CAN3TXDSR7_DB0_MASK             1
#define CAN3TXDSR7_DB1_MASK             2
#define CAN3TXDSR7_DB2_MASK             4
#define CAN3TXDSR7_DB3_MASK             8
#define CAN3TXDSR7_DB4_MASK             16
#define CAN3TXDSR7_DB5_MASK             32
#define CAN3TXDSR7_DB6_MASK             64
#define CAN3TXDSR7_DB7_MASK             128


/*** CAN3TXDLR - MSCAN3 Transmit Data Length Register; 0x0000023C ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TXDLRSTR;
extern volatile CAN3TXDLRSTR _CAN3TXDLR @(REG_BASE + 0x0000023C);
#define CAN3TXDLR                       _CAN3TXDLR.Byte
#define CAN3TXDLR_DLC0                  _CAN3TXDLR.Bits.DLC0
#define CAN3TXDLR_DLC1                  _CAN3TXDLR.Bits.DLC1
#define CAN3TXDLR_DLC2                  _CAN3TXDLR.Bits.DLC2
#define CAN3TXDLR_DLC3                  _CAN3TXDLR.Bits.DLC3
#define CAN3TXDLR_DLC                   _CAN3TXDLR.MergedBits.grpDLC

#define CAN3TXDLR_DLC0_MASK             1
#define CAN3TXDLR_DLC1_MASK             2
#define CAN3TXDLR_DLC2_MASK             4
#define CAN3TXDLR_DLC3_MASK             8
#define CAN3TXDLR_DLC_MASK              15
#define CAN3TXDLR_DLC_BITNUM            0


/*** CAN3TXTBPR - MSCAN3 Transmit Buffer Priority; 0x0000023D ***/
typedef union {
  byte Byte;
  struct {
    byte PRIO0       :1;                                       /* Transmit Buffer Priority Bit 0 */
    byte PRIO1       :1;                                       /* Transmit Buffer Priority Bit 1 */
    byte PRIO2       :1;                                       /* Transmit Buffer Priority Bit 2 */
    byte PRIO3       :1;                                       /* Transmit Buffer Priority Bit 3 */
    byte PRIO4       :1;                                       /* Transmit Buffer Priority Bit 4 */
    byte PRIO5       :1;                                       /* Transmit Buffer Priority Bit 5 */
    byte PRIO6       :1;                                       /* Transmit Buffer Priority Bit 6 */
    byte PRIO7       :1;                                       /* Transmit Buffer Priority Bit 7 */
  } Bits;
} CAN3TXTBPRSTR;
extern volatile CAN3TXTBPRSTR _CAN3TXTBPR @(REG_BASE + 0x0000023D);
#define CAN3TXTBPR                      _CAN3TXTBPR.Byte
#define CAN3TXTBPR_PRIO0                _CAN3TXTBPR.Bits.PRIO0
#define CAN3TXTBPR_PRIO1                _CAN3TXTBPR.Bits.PRIO1
#define CAN3TXTBPR_PRIO2                _CAN3TXTBPR.Bits.PRIO2
#define CAN3TXTBPR_PRIO3                _CAN3TXTBPR.Bits.PRIO3
#define CAN3TXTBPR_PRIO4                _CAN3TXTBPR.Bits.PRIO4
#define CAN3TXTBPR_PRIO5                _CAN3TXTBPR.Bits.PRIO5
#define CAN3TXTBPR_PRIO6                _CAN3TXTBPR.Bits.PRIO6
#define CAN3TXTBPR_PRIO7                _CAN3TXTBPR.Bits.PRIO7

#define CAN3TXTBPR_PRIO0_MASK           1
#define CAN3TXTBPR_PRIO1_MASK           2
#define CAN3TXTBPR_PRIO2_MASK           4
#define CAN3TXTBPR_PRIO3_MASK           8
#define CAN3TXTBPR_PRIO4_MASK           16
#define CAN3TXTBPR_PRIO5_MASK           32
#define CAN3TXTBPR_PRIO6_MASK           64
#define CAN3TXTBPR_PRIO7_MASK           128


/*** CAN3TXTSR - MSCAN3 Transmit Time Stamp Register; 0x0000023E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN3TXTSRH - MSCAN3 Transmit Time Stamp Register High; 0x0000023E ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
    } CAN3TXTSRHSTR;
    #define CAN3TXTSRH                  _CAN3TXTSR.Overlap_STR.CAN3TXTSRHSTR.Byte
    #define CAN3TXTSRH_TSR8             _CAN3TXTSR.Overlap_STR.CAN3TXTSRHSTR.Bits.TSR8
    #define CAN3TXTSRH_TSR9             _CAN3TXTSR.Overlap_STR.CAN3TXTSRHSTR.Bits.TSR9
    #define CAN3TXTSRH_TSR10            _CAN3TXTSR.Overlap_STR.CAN3TXTSRHSTR.Bits.TSR10
    #define CAN3TXTSRH_TSR11            _CAN3TXTSR.Overlap_STR.CAN3TXTSRHSTR.Bits.TSR11
    #define CAN3TXTSRH_TSR12            _CAN3TXTSR.Overlap_STR.CAN3TXTSRHSTR.Bits.TSR12
    #define CAN3TXTSRH_TSR13            _CAN3TXTSR.Overlap_STR.CAN3TXTSRHSTR.Bits.TSR13
    #define CAN3TXTSRH_TSR14            _CAN3TXTSR.Overlap_STR.CAN3TXTSRHSTR.Bits.TSR14
    #define CAN3TXTSRH_TSR15            _CAN3TXTSR.Overlap_STR.CAN3TXTSRHSTR.Bits.TSR15
    
    #define CAN3TXTSRH_TSR8_MASK        1
    #define CAN3TXTSRH_TSR9_MASK        2
    #define CAN3TXTSRH_TSR10_MASK       4
    #define CAN3TXTSRH_TSR11_MASK       8
    #define CAN3TXTSRH_TSR12_MASK       16
    #define CAN3TXTSRH_TSR13_MASK       32
    #define CAN3TXTSRH_TSR14_MASK       64
    #define CAN3TXTSRH_TSR15_MASK       128
    

    /*** CAN3TXTSRL - MSCAN3 Transmit Time Stamp Register Low; 0x0000023F ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
    } CAN3TXTSRLSTR;
    #define CAN3TXTSRL                  _CAN3TXTSR.Overlap_STR.CAN3TXTSRLSTR.Byte
    #define CAN3TXTSRL_TSR0             _CAN3TXTSR.Overlap_STR.CAN3TXTSRLSTR.Bits.TSR0
    #define CAN3TXTSRL_TSR1             _CAN3TXTSR.Overlap_STR.CAN3TXTSRLSTR.Bits.TSR1
    #define CAN3TXTSRL_TSR2             _CAN3TXTSR.Overlap_STR.CAN3TXTSRLSTR.Bits.TSR2
    #define CAN3TXTSRL_TSR3             _CAN3TXTSR.Overlap_STR.CAN3TXTSRLSTR.Bits.TSR3
    #define CAN3TXTSRL_TSR4             _CAN3TXTSR.Overlap_STR.CAN3TXTSRLSTR.Bits.TSR4
    #define CAN3TXTSRL_TSR5             _CAN3TXTSR.Overlap_STR.CAN3TXTSRLSTR.Bits.TSR5
    #define CAN3TXTSRL_TSR6             _CAN3TXTSR.Overlap_STR.CAN3TXTSRLSTR.Bits.TSR6
    #define CAN3TXTSRL_TSR7             _CAN3TXTSR.Overlap_STR.CAN3TXTSRLSTR.Bits.TSR7
    
    #define CAN3TXTSRL_TSR0_MASK        1
    #define CAN3TXTSRL_TSR1_MASK        2
    #define CAN3TXTSRL_TSR2_MASK        4
    #define CAN3TXTSRL_TSR3_MASK        8
    #define CAN3TXTSRL_TSR4_MASK        16
    #define CAN3TXTSRL_TSR5_MASK        32
    #define CAN3TXTSRL_TSR6_MASK        64
    #define CAN3TXTSRL_TSR7_MASK        128
    
  } Overlap_STR;

