Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
} CAN4TXTSRSTR;
extern volatile CAN4TXTSRSTR _CAN4TXTSR @(REG_BASE + 0x000002BE);
#define CAN4TXTSR                       _CAN4TXTSR.Word
#define CAN4TXTSR_TSR0                  _CAN4TXTSR.Bits.TSR0
#define CAN4TXTSR_TSR1                  _CAN4TXTSR.Bits.TSR1
#define CAN4TXTSR_TSR2                  _CAN4TXTSR.Bits.TSR2
#define CAN4TXTSR_TSR3                  _CAN4TXTSR.Bits.TSR3
#define CAN4TXTSR_TSR4                  _CAN4TXTSR.Bits.TSR4
#define CAN4TXTSR_TSR5                  _CAN4TXTSR.Bits.TSR5
#define CAN4TXTSR_TSR6                  _CAN4TXTSR.Bits.TSR6
#define CAN4TXTSR_TSR7                  _CAN4TXTSR.Bits.TSR7
#define CAN4TXTSR_TSR8                  _CAN4TXTSR.Bits.TSR8
#define CAN4TXTSR_TSR9                  _CAN4TXTSR.Bits.TSR9
#define CAN4TXTSR_TSR10                 _CAN4TXTSR.Bits.TSR10
#define CAN4TXTSR_TSR11                 _CAN4TXTSR.Bits.TSR11
#define CAN4TXTSR_TSR12                 _CAN4TXTSR.Bits.TSR12
#define CAN4TXTSR_TSR13                 _CAN4TXTSR.Bits.TSR13
#define CAN4TXTSR_TSR14                 _CAN4TXTSR.Bits.TSR14
#define CAN4TXTSR_TSR15                 _CAN4TXTSR.Bits.TSR15

#define CAN4TXTSR_TSR0_MASK             1
#define CAN4TXTSR_TSR1_MASK             2
#define CAN4TXTSR_TSR2_MASK             4
#define CAN4TXTSR_TSR3_MASK             8
#define CAN4TXTSR_TSR4_MASK             16
#define CAN4TXTSR_TSR5_MASK             32
#define CAN4TXTSR_TSR6_MASK             64
#define CAN4TXTSR_TSR7_MASK             128
#define CAN4TXTSR_TSR8_MASK             256
#define CAN4TXTSR_TSR9_MASK             512
#define CAN4TXTSR_TSR10_MASK            1024
#define CAN4TXTSR_TSR11_MASK            2048
#define CAN4TXTSR_TSR12_MASK            4096
#define CAN4TXTSR_TSR13_MASK            8192
#define CAN4TXTSR_TSR14_MASK            16384
#define CAN4TXTSR_TSR15_MASK            32768


/*** ATD0CTL01 - ATD 0 Control Register 01; 0x000002C0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0CTL0 - ATD 0 Control Register 0; 0x000002C0 ***/
    union {
      byte Byte;
      struct {
        byte WRAP0       :1;                                       /* Wrap Around Channel Select Bit 0 */
        byte WRAP1       :1;                                       /* Wrap Around Channel Select Bit 1 */
        byte WRAP2       :1;                                       /* Wrap Around Channel Select Bit 2 */
        byte WRAP3       :1;                                       /* Wrap Around Channel Select Bit 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpWRAP :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } ATD0CTL0STR;
    #define ATD0CTL0                    _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Byte
    #define ATD0CTL0_WRAP0              _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Bits.WRAP0
    #define ATD0CTL0_WRAP1              _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Bits.WRAP1
    #define ATD0CTL0_WRAP2              _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Bits.WRAP2
    #define ATD0CTL0_WRAP3              _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Bits.WRAP3
    /* ATD0CTL_ARR: Access 6 ATD0CTLx registers in an array */
    #define ATD0CTL_ARR                 ((volatile byte *) &ATD0CTL0)
    #define ATD0CTL0_WRAP               _ATD0CTL01.Overlap_STR.ATD0CTL0STR.MergedBits.grpWRAP
    
    #define ATD0CTL0_WRAP0_MASK         1
    #define ATD0CTL0_WRAP1_MASK         2
    #define ATD0CTL0_WRAP2_MASK         4
    #define ATD0CTL0_WRAP3_MASK         8
    #define ATD0CTL0_WRAP_MASK          15
    #define ATD0CTL0_WRAP_BITNUM        0
    

    /*** ATD0CTL1 - ATD 0 Control Register 1; 0x000002C1 ***/
    union {
      byte Byte;
      struct {
        byte ETRIGCH0    :1;                                       /* External Trigger Channel Select Bit 0 */
        byte ETRIGCH1    :1;                                       /* External Trigger Channel Select Bit 1 */
        byte ETRIGCH2    :1;                                       /* External Trigger Channel Select Bit 2 */
        byte ETRIGCH3    :1;                                       /* External Trigger Channel Select Bit 3 */
        byte SMP_DIS     :1;                                       /* Discharge Before Sampling Bit */
        byte SRES0       :1;                                       /* A/D Resolution Select Bit 0 */
        byte SRES1       :1;                                       /* A/D Resolution Select Bit 1 */
        byte ETRIGSEL    :1;                                       /* External Trigger Source Select */
      } Bits;
      struct {
        byte grpETRIGCH :4;
        byte     :1;
        byte grpSRES :2;
        byte     :1;
      } MergedBits;
    } ATD0CTL1STR;
    #define ATD0CTL1                    _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Byte
    #define ATD0CTL1_ETRIGCH0           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGCH0
    #define ATD0CTL1_ETRIGCH1           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGCH1
    #define ATD0CTL1_ETRIGCH2           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGCH2
    #define ATD0CTL1_ETRIGCH3           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGCH3
    #define ATD0CTL1_SMP_DIS            _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.SMP_DIS
    #define ATD0CTL1_SRES0              _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.SRES0
    #define ATD0CTL1_SRES1              _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.SRES1
    #define ATD0CTL1_ETRIGSEL           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGSEL
    #define ATD0CTL1_ETRIGCH            _ATD0CTL01.Overlap_STR.ATD0CTL1STR.MergedBits.grpETRIGCH
    #define ATD0CTL1_SRES               _ATD0CTL01.Overlap_STR.ATD0CTL1STR.MergedBits.grpSRES
    
    #define ATD0CTL1_ETRIGCH0_MASK      1
    #define ATD0CTL1_ETRIGCH1_MASK      2
    #define ATD0CTL1_ETRIGCH2_MASK      4
    #define ATD0CTL1_ETRIGCH3_MASK      8
    #define ATD0CTL1_SMP_DIS_MASK       16
    #define ATD0CTL1_SRES0_MASK         32
    #define ATD0CTL1_SRES1_MASK         64
    #define ATD0CTL1_ETRIGSEL_MASK      128
    #define ATD0CTL1_ETRIGCH_MASK       15
    #define ATD0CTL1_ETRIGCH_BITNUM     0
    #define ATD0CTL1_SRES_MASK          96
    #define ATD0CTL1_SRES_BITNUM        5
    
  } Overlap_STR;

