Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
  struct {
    word ETRIGCH0    :1;                                       /* External Trigger Channel Select Bit 0 */
    word ETRIGCH1    :1;                                       /* External Trigger Channel Select Bit 1 */
    word ETRIGCH2    :1;                                       /* External Trigger Channel Select Bit 2 */
    word ETRIGCH3    :1;                                       /* External Trigger Channel Select Bit 3 */
    word SMP_DIS     :1;                                       /* Discharge Before Sampling Bit */
    word SRES0       :1;                                       /* A/D Resolution Select Bit 0 */
    word SRES1       :1;                                       /* A/D Resolution Select Bit 1 */
    word ETRIGSEL    :1;                                       /* External Trigger Source Select */
    word WRAP0       :1;                                       /* Wrap Around Channel Select Bit 0 */
    word WRAP1       :1;                                       /* Wrap Around Channel Select Bit 1 */
    word WRAP2       :1;                                       /* Wrap Around Channel Select Bit 2 */
    word WRAP3       :1;                                       /* Wrap Around Channel Select Bit 3 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpETRIGCH :4;
    word         :1;
    word grpSRES :2;
    word         :1;
    word grpWRAP :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} ATD0CTL01STR;
extern volatile ATD0CTL01STR _ATD0CTL01 @(REG_BASE + 0x000002C0);
#define ATD0CTL01                       _ATD0CTL01.Word
#define ATD0CTL01_ETRIGCH0              _ATD0CTL01.Bits.ETRIGCH0
#define ATD0CTL01_ETRIGCH1              _ATD0CTL01.Bits.ETRIGCH1
#define ATD0CTL01_ETRIGCH2              _ATD0CTL01.Bits.ETRIGCH2
#define ATD0CTL01_ETRIGCH3              _ATD0CTL01.Bits.ETRIGCH3
#define ATD0CTL01_SMP_DIS               _ATD0CTL01.Bits.SMP_DIS
#define ATD0CTL01_SRES0                 _ATD0CTL01.Bits.SRES0
#define ATD0CTL01_SRES1                 _ATD0CTL01.Bits.SRES1
#define ATD0CTL01_ETRIGSEL              _ATD0CTL01.Bits.ETRIGSEL
#define ATD0CTL01_WRAP0                 _ATD0CTL01.Bits.WRAP0
#define ATD0CTL01_WRAP1                 _ATD0CTL01.Bits.WRAP1
#define ATD0CTL01_WRAP2                 _ATD0CTL01.Bits.WRAP2
#define ATD0CTL01_WRAP3                 _ATD0CTL01.Bits.WRAP3
#define ATD0CTL01_ETRIGCH               _ATD0CTL01.MergedBits.grpETRIGCH
#define ATD0CTL01_SRES                  _ATD0CTL01.MergedBits.grpSRES
#define ATD0CTL01_WRAP                  _ATD0CTL01.MergedBits.grpWRAP

#define ATD0CTL01_ETRIGCH0_MASK         1
#define ATD0CTL01_ETRIGCH1_MASK         2
#define ATD0CTL01_ETRIGCH2_MASK         4
#define ATD0CTL01_ETRIGCH3_MASK         8
#define ATD0CTL01_SMP_DIS_MASK          16
#define ATD0CTL01_SRES0_MASK            32
#define ATD0CTL01_SRES1_MASK            64
#define ATD0CTL01_ETRIGSEL_MASK         128
#define ATD0CTL01_WRAP0_MASK            256
#define ATD0CTL01_WRAP1_MASK            512
#define ATD0CTL01_WRAP2_MASK            1024
#define ATD0CTL01_WRAP3_MASK            2048
#define ATD0CTL01_ETRIGCH_MASK          15
#define ATD0CTL01_ETRIGCH_BITNUM        0
#define ATD0CTL01_SRES_MASK             96
#define ATD0CTL01_SRES_BITNUM           5
#define ATD0CTL01_WRAP_MASK             3840
#define ATD0CTL01_WRAP_BITNUM           8


/*** ATD0CTL23 - ATD 0 Control Register 23; 0x000002C2 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0CTL2 - ATD 0 Control Register 2; 0x000002C2 ***/
    union {
      byte Byte;
      struct {
        byte ACMPIE      :1;                                       /* ATD Compare Interrupt Enable */
        byte ASCIE       :1;                                       /* ATD Sequence Complete Interrupt Enable */
        byte ETRIGE      :1;                                       /* External Trigger Mode enable */
        byte ETRIGP      :1;                                       /* External Trigger Polarity */
        byte ETRIGLE     :1;                                       /* External Trigger Level/Edge control */
        byte ICLKSTP     :1;                                       /* Internal Clock in Stop Mode Bit */
        byte AFFC        :1;                                       /* ATD Fast Conversion Complete Flag Clear */
        byte             :1; 
      } Bits;
    } ATD0CTL2STR;
    #define ATD0CTL2                    _ATD0CTL23.Overlap_STR.ATD0CTL2STR.Byte
    #define ATD0CTL2_ACMPIE             _ATD0CTL23.Overlap_STR.ATD0CTL2STR.Bits.ACMPIE
    #define ATD0CTL2_ASCIE              _ATD0CTL23.Overlap_STR.ATD0CTL2STR.Bits.ASCIE
    #define ATD0CTL2_ETRIGE             _ATD0CTL23.Overlap_STR.ATD0CTL2STR.Bits.ETRIGE
    #define ATD0CTL2_ETRIGP             _ATD0CTL23.Overlap_STR.ATD0CTL2STR.Bits.ETRIGP
    #define ATD0CTL2_ETRIGLE            _ATD0CTL23.Overlap_STR.ATD0CTL2STR.Bits.ETRIGLE
    #define ATD0CTL2_ICLKSTP            _ATD0CTL23.Overlap_STR.ATD0CTL2STR.Bits.ICLKSTP
    #define ATD0CTL2_AFFC               _ATD0CTL23.Overlap_STR.ATD0CTL2STR.Bits.AFFC
    
    #define ATD0CTL2_ACMPIE_MASK        1
    #define ATD0CTL2_ASCIE_MASK         2
    #define ATD0CTL2_ETRIGE_MASK        4
    #define ATD0CTL2_ETRIGP_MASK        8
    #define ATD0CTL2_ETRIGLE_MASK       16
    #define ATD0CTL2_ICLKSTP_MASK       32
    #define ATD0CTL2_AFFC_MASK          64
    

    /*** ATD0CTL3 - ATD 0 Control Register 3; 0x000002C3 ***/
    union {
      byte Byte;
      struct {
        byte FRZ0        :1;                                       /* Background Debug Freeze Enable Bit 0 */
        byte FRZ1        :1;                                       /* Background Debug Freeze Enable Bit 1 */
        byte FIFO        :1;                                       /* Result Register FIFO Mode */
        byte S1C         :1;                                       /* Conversion Sequence Length 1 */
        byte S2C         :1;                                       /* Conversion Sequence Length 2 */
        byte S4C         :1;                                       /* Conversion Sequence Length 4 */
        byte S8C         :1;                                       /* Conversion Sequence Length 8 */
        byte DJM         :1;                                       /* Result Register Data Justification */
      } Bits;
      struct {
        byte grpFRZ :2;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } ATD0CTL3STR;
    #define ATD0CTL3                    _ATD0CTL23.Overlap_STR.ATD0CTL3STR.Byte
    #define ATD0CTL3_FRZ0               _ATD0CTL23.Overlap_STR.ATD0CTL3STR.Bits.FRZ0
    #define ATD0CTL3_FRZ1               _ATD0CTL23.Overlap_STR.ATD0CTL3STR.Bits.FRZ1
    #define ATD0CTL3_FIFO               _ATD0CTL23.Overlap_STR.ATD0CTL3STR.Bits.FIFO
    #define ATD0CTL3_S1C                _ATD0CTL23.Overlap_STR.ATD0CTL3STR.Bits.S1C
    #define ATD0CTL3_S2C                _ATD0CTL23.Overlap_STR.ATD0CTL3STR.Bits.S2C
    #define ATD0CTL3_S4C                _ATD0CTL23.Overlap_STR.ATD0CTL3STR.Bits.S4C
    #define ATD0CTL3_S8C                _ATD0CTL23.Overlap_STR.ATD0CTL3STR.Bits.S8C
    #define ATD0CTL3_DJM                _ATD0CTL23.Overlap_STR.ATD0CTL3STR.Bits.DJM
    #define ATD0CTL3_FRZ                _ATD0CTL23.Overlap_STR.ATD0CTL3STR.MergedBits.grpFRZ
    
    #define ATD0CTL3_FRZ0_MASK          1
    #define ATD0CTL3_FRZ1_MASK          2
    #define ATD0CTL3_FIFO_MASK          4
    #define ATD0CTL3_S1C_MASK           8
    #define ATD0CTL3_S2C_MASK           16
    #define ATD0CTL3_S4C_MASK           32
    #define ATD0CTL3_S8C_MASK           64
    #define ATD0CTL3_DJM_MASK           128
    #define ATD0CTL3_FRZ_MASK           3
    #define ATD0CTL3_FRZ_BITNUM         0
    
  } Overlap_STR;

