Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD0DR8STR;
extern volatile ATD0DR8STR _ATD0DR8 @(REG_BASE + 0x000002E0);
#define ATD0DR8                         _ATD0DR8.Word
#define ATD0DR8_BIT0                    _ATD0DR8.Bits.BIT0
#define ATD0DR8_BIT1                    _ATD0DR8.Bits.BIT1
#define ATD0DR8_BIT2                    _ATD0DR8.Bits.BIT2
#define ATD0DR8_BIT3                    _ATD0DR8.Bits.BIT3
#define ATD0DR8_BIT4                    _ATD0DR8.Bits.BIT4
#define ATD0DR8_BIT5                    _ATD0DR8.Bits.BIT5
#define ATD0DR8_BIT6                    _ATD0DR8.Bits.BIT6
#define ATD0DR8_BIT7                    _ATD0DR8.Bits.BIT7
#define ATD0DR8_BIT8                    _ATD0DR8.Bits.BIT8
#define ATD0DR8_BIT9                    _ATD0DR8.Bits.BIT9
#define ATD0DR8_BIT10                   _ATD0DR8.Bits.BIT10
#define ATD0DR8_BIT11                   _ATD0DR8.Bits.BIT11
#define ATD0DR8_BIT12                   _ATD0DR8.Bits.BIT12
#define ATD0DR8_BIT13                   _ATD0DR8.Bits.BIT13
#define ATD0DR8_BIT14                   _ATD0DR8.Bits.BIT14
#define ATD0DR8_BIT15                   _ATD0DR8.Bits.BIT15

#define ATD0DR8_BIT0_MASK               1
#define ATD0DR8_BIT1_MASK               2
#define ATD0DR8_BIT2_MASK               4
#define ATD0DR8_BIT3_MASK               8
#define ATD0DR8_BIT4_MASK               16
#define ATD0DR8_BIT5_MASK               32
#define ATD0DR8_BIT6_MASK               64
#define ATD0DR8_BIT7_MASK               128
#define ATD0DR8_BIT8_MASK               256
#define ATD0DR8_BIT9_MASK               512
#define ATD0DR8_BIT10_MASK              1024
#define ATD0DR8_BIT11_MASK              2048
#define ATD0DR8_BIT12_MASK              4096
#define ATD0DR8_BIT13_MASK              8192
#define ATD0DR8_BIT14_MASK              16384
#define ATD0DR8_BIT15_MASK              32768


/*** ATD0DR9 - ATD 0 Conversion Result Register 9; 0x000002E2 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0DR9H - ATD 0 Conversion Result Register 9 High; 0x000002E2 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD0DR9HSTR;
    #define ATD0DR9H                    _ATD0DR9.Overlap_STR.ATD0DR9HSTR.Byte
    #define ATD0DR9H_BIT8               _ATD0DR9.Overlap_STR.ATD0DR9HSTR.Bits.BIT8
    #define ATD0DR9H_BIT9               _ATD0DR9.Overlap_STR.ATD0DR9HSTR.Bits.BIT9
    #define ATD0DR9H_BIT10              _ATD0DR9.Overlap_STR.ATD0DR9HSTR.Bits.BIT10
    #define ATD0DR9H_BIT11              _ATD0DR9.Overlap_STR.ATD0DR9HSTR.Bits.BIT11
    #define ATD0DR9H_BIT12              _ATD0DR9.Overlap_STR.ATD0DR9HSTR.Bits.BIT12
    #define ATD0DR9H_BIT13              _ATD0DR9.Overlap_STR.ATD0DR9HSTR.Bits.BIT13
    #define ATD0DR9H_BIT14              _ATD0DR9.Overlap_STR.ATD0DR9HSTR.Bits.BIT14
    #define ATD0DR9H_BIT15              _ATD0DR9.Overlap_STR.ATD0DR9HSTR.Bits.BIT15
    
    #define ATD0DR9H_BIT8_MASK          1
    #define ATD0DR9H_BIT9_MASK          2
    #define ATD0DR9H_BIT10_MASK         4
    #define ATD0DR9H_BIT11_MASK         8
    #define ATD0DR9H_BIT12_MASK         16
    #define ATD0DR9H_BIT13_MASK         32
    #define ATD0DR9H_BIT14_MASK         64
    #define ATD0DR9H_BIT15_MASK         128
    

    /*** ATD0DR9L - ATD 0 Conversion Result Register 9 Low; 0x000002E3 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Bit 0 */
        byte BIT1        :1;                                       /* Bit 1 */
        byte BIT2        :1;                                       /* Bit 2 */
        byte BIT3        :1;                                       /* Bit 3 */
        byte BIT4        :1;                                       /* Bit 4 */
        byte BIT5        :1;                                       /* Bit 5 */
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
    } ATD0DR9LSTR;
    #define ATD0DR9L                    _ATD0DR9.Overlap_STR.ATD0DR9LSTR.Byte
    #define ATD0DR9L_BIT0               _ATD0DR9.Overlap_STR.ATD0DR9LSTR.Bits.BIT0
    #define ATD0DR9L_BIT1               _ATD0DR9.Overlap_STR.ATD0DR9LSTR.Bits.BIT1
    #define ATD0DR9L_BIT2               _ATD0DR9.Overlap_STR.ATD0DR9LSTR.Bits.BIT2
    #define ATD0DR9L_BIT3               _ATD0DR9.Overlap_STR.ATD0DR9LSTR.Bits.BIT3
    #define ATD0DR9L_BIT4               _ATD0DR9.Overlap_STR.ATD0DR9LSTR.Bits.BIT4
    #define ATD0DR9L_BIT5               _ATD0DR9.Overlap_STR.ATD0DR9LSTR.Bits.BIT5
    #define ATD0DR9L_BIT6               _ATD0DR9.Overlap_STR.ATD0DR9LSTR.Bits.BIT6
    #define ATD0DR9L_BIT7               _ATD0DR9.Overlap_STR.ATD0DR9LSTR.Bits.BIT7
    
    #define ATD0DR9L_BIT0_MASK          1
    #define ATD0DR9L_BIT1_MASK          2
    #define ATD0DR9L_BIT2_MASK          4
    #define ATD0DR9L_BIT3_MASK          8
    #define ATD0DR9L_BIT4_MASK          16
    #define ATD0DR9L_BIT5_MASK          32
    #define ATD0DR9L_BIT6_MASK          64
    #define ATD0DR9L_BIT7_MASK          128
    
  } Overlap_STR;

