Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
    #define ATD0DR15L_BIT0_MASK         1
    #define ATD0DR15L_BIT1_MASK         2
    #define ATD0DR15L_BIT2_MASK         4
    #define ATD0DR15L_BIT3_MASK         8
    #define ATD0DR15L_BIT4_MASK         16
    #define ATD0DR15L_BIT5_MASK         32
    #define ATD0DR15L_BIT6_MASK         64
    #define ATD0DR15L_BIT7_MASK         128
    
  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD0DR15STR;
extern volatile ATD0DR15STR _ATD0DR15 @(REG_BASE + 0x000002EE);
#define ATD0DR15                        _ATD0DR15.Word
#define ATD0DR15_BIT0                   _ATD0DR15.Bits.BIT0
#define ATD0DR15_BIT1                   _ATD0DR15.Bits.BIT1
#define ATD0DR15_BIT2                   _ATD0DR15.Bits.BIT2
#define ATD0DR15_BIT3                   _ATD0DR15.Bits.BIT3
#define ATD0DR15_BIT4                   _ATD0DR15.Bits.BIT4
#define ATD0DR15_BIT5                   _ATD0DR15.Bits.BIT5
#define ATD0DR15_BIT6                   _ATD0DR15.Bits.BIT6
#define ATD0DR15_BIT7                   _ATD0DR15.Bits.BIT7
#define ATD0DR15_BIT8                   _ATD0DR15.Bits.BIT8
#define ATD0DR15_BIT9                   _ATD0DR15.Bits.BIT9
#define ATD0DR15_BIT10                  _ATD0DR15.Bits.BIT10
#define ATD0DR15_BIT11                  _ATD0DR15.Bits.BIT11
#define ATD0DR15_BIT12                  _ATD0DR15.Bits.BIT12
#define ATD0DR15_BIT13                  _ATD0DR15.Bits.BIT13
#define ATD0DR15_BIT14                  _ATD0DR15.Bits.BIT14
#define ATD0DR15_BIT15                  _ATD0DR15.Bits.BIT15

#define ATD0DR15_BIT0_MASK              1
#define ATD0DR15_BIT1_MASK              2
#define ATD0DR15_BIT2_MASK              4
#define ATD0DR15_BIT3_MASK              8
#define ATD0DR15_BIT4_MASK              16
#define ATD0DR15_BIT5_MASK              32
#define ATD0DR15_BIT6_MASK              64
#define ATD0DR15_BIT7_MASK              128
#define ATD0DR15_BIT8_MASK              256
#define ATD0DR15_BIT9_MASK              512
#define ATD0DR15_BIT10_MASK             1024
#define ATD0DR15_BIT11_MASK             2048
#define ATD0DR15_BIT12_MASK             4096
#define ATD0DR15_BIT13_MASK             8192
#define ATD0DR15_BIT14_MASK             16384
#define ATD0DR15_BIT15_MASK             32768


/*** VREGHTCL - HT Control Register; 0x000002F0 ***/
typedef union {
  byte Byte;
  struct {
    byte HTIF        :1;                                       /* High Temperature Interrupt Flag */
    byte HTIE        :1;                                       /* High Temperature Interrupt Enable Bit */
    byte HTDS        :1;                                       /* High Temperature Detect Status Bi */
    byte HTEN        :1;                                       /* High Temperature Enable Bit */
    byte VAE         :1;                                       /* Voltage Access Enable Bit */
    byte VSEL        :1;                                       /* Voltage Access Select Bit */
    byte             :1; 
    byte             :1; 
  } Bits;
} VREGHTCLSTR;
extern volatile VREGHTCLSTR _VREGHTCL @(REG_BASE + 0x000002F0);
#define VREGHTCL                        _VREGHTCL.Byte
#define VREGHTCL_HTIF                   _VREGHTCL.Bits.HTIF
#define VREGHTCL_HTIE                   _VREGHTCL.Bits.HTIE
#define VREGHTCL_HTDS                   _VREGHTCL.Bits.HTDS
#define VREGHTCL_HTEN                   _VREGHTCL.Bits.HTEN
#define VREGHTCL_VAE                    _VREGHTCL.Bits.VAE
#define VREGHTCL_VSEL                   _VREGHTCL.Bits.VSEL

#define VREGHTCL_HTIF_MASK              1
#define VREGHTCL_HTIE_MASK              2
#define VREGHTCL_HTDS_MASK              4
#define VREGHTCL_HTEN_MASK              8
#define VREGHTCL_VAE_MASK               16
#define VREGHTCL_VSEL_MASK              32


/*** VREGCTRL - Control Register; 0x000002F1 ***/
typedef union {
  byte Byte;
  struct {
    byte LVIF        :1;                                       /* Low-Voltage Interrupt Flag */
    byte LVIE        :1;                                       /* Low-Voltage Interrupt Enable Bit */
    byte LVDS        :1;                                       /* Low-Voltage Detect Status Bit */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} VREGCTRLSTR;
extern volatile VREGCTRLSTR _VREGCTRL @(REG_BASE + 0x000002F1);
#define VREGCTRL                        _VREGCTRL.Byte
#define VREGCTRL_LVIF                   _VREGCTRL.Bits.LVIF
#define VREGCTRL_LVIE                   _VREGCTRL.Bits.LVIE
#define VREGCTRL_LVDS                   _VREGCTRL.Bits.LVDS

#define VREGCTRL_LVIF_MASK              1
#define VREGCTRL_LVIE_MASK              2
#define VREGCTRL_LVDS_MASK              4


/*** VREGAPICL - Autonomous Periodical Interrupt Control Register; 0x000002F2 ***/
typedef union {
  byte Byte;
  struct {
    byte APIF        :1;                                       /* Autonomous Periodical Interrupt Flag */
    byte APIE        :1;                                       /* Autonomous Periodical Interrupt Enable Bit */
    byte APIFE       :1;                                       /* Autonomous Periodical Interrupt Feature Enable Bit */
    byte APIEA       :1;                                       /* Autonomous Periodical Interrupt External Access Enable Bit */
    byte APIES       :1;                                       /* Autonomous Periodical Interrupt External Select Bit */
    byte             :1; 
    byte             :1; 
    byte APICLK      :1;                                       /* Autonomous Periodical Interrupt Clock Select Bit */
  } Bits;
} VREGAPICLSTR;
extern volatile VREGAPICLSTR _VREGAPICL @(REG_BASE + 0x000002F2);
#define VREGAPICL                       _VREGAPICL.Byte
#define VREGAPICL_APIF                  _VREGAPICL.Bits.APIF
#define VREGAPICL_APIE                  _VREGAPICL.Bits.APIE
#define VREGAPICL_APIFE                 _VREGAPICL.Bits.APIFE
#define VREGAPICL_APIEA                 _VREGAPICL.Bits.APIEA
#define VREGAPICL_APIES                 _VREGAPICL.Bits.APIES
#define VREGAPICL_APICLK                _VREGAPICL.Bits.APICLK

#define VREGAPICL_APIF_MASK             1
#define VREGAPICL_APIE_MASK             2
#define VREGAPICL_APIFE_MASK            4
#define VREGAPICL_APIEA_MASK            8
#define VREGAPICL_APIES_MASK            16
#define VREGAPICL_APICLK_MASK           128


/*** VREGAPITR - Autonomous Periodical Interrupt Trimming Register; 0x000002F3 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte APITR0      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 0 */
    byte APITR1      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 1 */
    byte APITR2      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 2 */
    byte APITR3      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 3 */
    byte APITR4      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 4 */
    byte APITR5      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 5 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpAPITR :6;
  } MergedBits;
} VREGAPITRSTR;
extern volatile VREGAPITRSTR _VREGAPITR @(REG_BASE + 0x000002F3);
#define VREGAPITR                       _VREGAPITR.Byte
#define VREGAPITR_APITR0                _VREGAPITR.Bits.APITR0
#define VREGAPITR_APITR1                _VREGAPITR.Bits.APITR1
#define VREGAPITR_APITR2                _VREGAPITR.Bits.APITR2
#define VREGAPITR_APITR3                _VREGAPITR.Bits.APITR3
#define VREGAPITR_APITR4                _VREGAPITR.Bits.APITR4
#define VREGAPITR_APITR5                _VREGAPITR.Bits.APITR5
#define VREGAPITR_APITR                 _VREGAPITR.MergedBits.grpAPITR

#define VREGAPITR_APITR0_MASK           4
#define VREGAPITR_APITR1_MASK           8
#define VREGAPITR_APITR2_MASK           16
#define VREGAPITR_APITR3_MASK           32
#define VREGAPITR_APITR4_MASK           64
#define VREGAPITR_APITR5_MASK           128
#define VREGAPITR_APITR_MASK            252
#define VREGAPITR_APITR_BITNUM          2


/*** VREGAPIR - Autonomous Periodical Interrupt Rate Register; 0x000002F4 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** VREGAPIRH - Autonomous Periodical Interrupt Rate Register High; 0x000002F4 ***/
    union {
      byte Byte;
      struct {
        byte APIR8       :1;                                       /* Autonomous Periodical Interrupt Rate Bit 8 */
        byte APIR9       :1;                                       /* Autonomous Periodical Interrupt Rate Bit 9 */
        byte APIR10      :1;                                       /* Autonomous Periodical Interrupt Rate Bit 10 */
        byte APIR11      :1;                                       /* Autonomous Periodical Interrupt Rate Bit 11 */
        byte APIR12      :1;                                       /* Autonomous Periodical Interrupt Rate Bit 12 */
        byte APIR13      :1;                                       /* Autonomous Periodical Interrupt Rate Bit 13 */
        byte APIR14      :1;                                       /* Autonomous Periodical Interrupt Rate Bit 14 */
        byte APIR15      :1;                                       /* Autonomous Periodical Interrupt Rate Bit 15 */
      } Bits;
    } VREGAPIRHSTR;
    #define VREGAPIRH                   _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Byte
    #define VREGAPIRH_APIR8             _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR8
    #define VREGAPIRH_APIR9             _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR9
    #define VREGAPIRH_APIR10            _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR10
    #define VREGAPIRH_APIR11            _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR11
    #define VREGAPIRH_APIR12            _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR12
    #define VREGAPIRH_APIR13            _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR13
    #define VREGAPIRH_APIR14            _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR14
    #define VREGAPIRH_APIR15            _VREGAPIR.Overlap_STR.VREGAPIRHSTR.Bits.APIR15
    
    #define VREGAPIRH_APIR8_MASK        1
    #define VREGAPIRH_APIR9_MASK        2
    #define VREGAPIRH_APIR10_MASK       4
    #define VREGAPIRH_APIR11_MASK       8
    #define VREGAPIRH_APIR12_MASK       16
    #define VREGAPIRH_APIR13_MASK       32
    #define VREGAPIRH_APIR14_MASK       64
    #define VREGAPIRH_APIR15_MASK       128
    

