Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
/*** PWMDTY45 - PWM Channel Duty 45 Register; 0x00000320 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMDTY4 - PWM Channel Duty 4 Register; 0x00000320 ***/
    union {
      byte Byte;
    } PWMDTY4STR;
    #define PWMDTY4                     _PWMDTY45.Overlap_STR.PWMDTY4STR.Byte
    

    /*** PWMDTY5 - PWM Channel Duty 5 Register; 0x00000321 ***/
    union {
      byte Byte;
    } PWMDTY5STR;
    #define PWMDTY5                     _PWMDTY45.Overlap_STR.PWMDTY5STR.Byte
    
  } Overlap_STR;

} PWMDTY45STR;
extern volatile PWMDTY45STR _PWMDTY45 @(REG_BASE + 0x00000320);
#define PWMDTY45                        _PWMDTY45.Word


/*** PWMDTY67 - PWM Channel Duty 67 Register; 0x00000322 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMDTY6 - PWM Channel Duty 6 Register; 0x00000322 ***/
    union {
      byte Byte;
    } PWMDTY6STR;
    #define PWMDTY6                     _PWMDTY67.Overlap_STR.PWMDTY6STR.Byte
    

    /*** PWMDTY7 - PWM Channel Duty 7 Register; 0x00000323 ***/
    union {
      byte Byte;
    } PWMDTY7STR;
    #define PWMDTY7                     _PWMDTY67.Overlap_STR.PWMDTY7STR.Byte
    
  } Overlap_STR;

} PWMDTY67STR;
extern volatile PWMDTY67STR _PWMDTY67 @(REG_BASE + 0x00000322);
#define PWMDTY67                        _PWMDTY67.Word


/*** PWMSDN - PWM Shutdown Register; 0x00000324 ***/
typedef union {
  byte Byte;
  struct {
    byte PWM7ENA     :1;                                       /* PWM emergency shutdown Enable */
    byte PWM7INL     :1;                                       /* PWM shutdown active input level for ch. 7 */
    byte PWM7IN      :1;                                       /* PWM channel 7 input status */
    byte             :1; 
    byte PWMLVL      :1;                                       /* PWM shutdown output Level */
    byte PWMRSTRT    :1;                                       /* PWM Restart */
    byte PWMIE       :1;                                       /* PWM Interrupt Enable */
    byte PWMIF       :1;                                       /* PWM Interrupt Flag */
  } Bits;
} PWMSDNSTR;
extern volatile PWMSDNSTR _PWMSDN @(REG_BASE + 0x00000324);
#define PWMSDN                          _PWMSDN.Byte
#define PWMSDN_PWM7ENA                  _PWMSDN.Bits.PWM7ENA
#define PWMSDN_PWM7INL                  _PWMSDN.Bits.PWM7INL
#define PWMSDN_PWM7IN                   _PWMSDN.Bits.PWM7IN
#define PWMSDN_PWMLVL                   _PWMSDN.Bits.PWMLVL
#define PWMSDN_PWMRSTRT                 _PWMSDN.Bits.PWMRSTRT
#define PWMSDN_PWMIE                    _PWMSDN.Bits.PWMIE
#define PWMSDN_PWMIF                    _PWMSDN.Bits.PWMIF

#define PWMSDN_PWM7ENA_MASK             1
#define PWMSDN_PWM7INL_MASK             2
#define PWMSDN_PWM7IN_MASK              4
#define PWMSDN_PWMLVL_MASK              16
#define PWMSDN_PWMRSTRT_MASK            32
#define PWMSDN_PWMIE_MASK               64
#define PWMSDN_PWMIF_MASK               128


/*** SCI6BD - SCI 6 Baud Rate Register; 0x00000330 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SCI6ASR1 - SCI 6 Alternative Status Register 1; 0x00000330 ***/
    union {
      byte Byte;
      union { /* Several registers at the same address */
        /*** SCI6ASR1 - SCI 6 Alternative Status Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIF       :1;                                       /* Break Detect Interrupt Flag */
            byte BERRIF      :1;                                       /* Bit Error Interrupt Flag */
            byte BERRV       :1;                                       /* Bit Error Value */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIF     :1;                                       /* Receive Input Active Edge Interrupt Flag */
          } Bits;
        } SCI6ASR1STR;
        #define SCI6ASR1                _SCI6BD.Overlap_STR.SCI6ASR1STR.Byte
        #define SCI6ASR1_BKDIF          _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6ASR1STR.Bits.BKDIF
        #define SCI6ASR1_BERRIF         _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6ASR1STR.Bits.BERRIF
        #define SCI6ASR1_BERRV          _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6ASR1STR.Bits.BERRV
        #define SCI6ASR1_RXEDGIF        _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6ASR1STR.Bits.RXEDGIF
        
        #define SCI6ASR1_BKDIF_MASK     1
        #define SCI6ASR1_BERRIF_MASK    2
        #define SCI6ASR1_BERRV_MASK     4
        #define SCI6ASR1_RXEDGIF_MASK   128
        
        /*** SCI6BDH - SCI 6 Baud Rate Register High; Several registers at the same address ***/
        union {
          struct {
            byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
            byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
            byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
            byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
            byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
            byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
            byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
            byte IREN        :1;                                       /* Infrared Enable Bit */
          } Bits;
          struct {
            byte grpSBR_8 :5;
            byte grpTNP :2;
            byte :1;
          } MergedBits;
        } SCI6BDHSTR;
        #define SCI6BDH                 _SCI6BD.Overlap_STR.SCI6ASR1STR.Byte
        #define SCI6BDH_SBR8            _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.SBR8
        #define SCI6BDH_SBR9            _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.SBR9
        #define SCI6BDH_SBR10           _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.SBR10
        #define SCI6BDH_SBR11           _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.SBR11
        #define SCI6BDH_SBR12           _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.SBR12
        #define SCI6BDH_TNP0            _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.TNP0
        #define SCI6BDH_TNP1            _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.TNP1
        #define SCI6BDH_IREN            _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.IREN
        #define SCI6BDH_SBR_8           _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.MergedBits.grpSBR_8
        #define SCI6BDH_TNP             _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.MergedBits.grpTNP
        #define SCI6BDH_SBR             SCI6BDH_SBR_8
        
