Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
/*** SCI6ACR2 - SCI 6 Alternative Control Register 2; 0x00000332 ***/
typedef union {
  byte Byte;
  union { /* Several registers at the same address */
    /*** SCI6ACR2 - SCI 6 Alternative Control Register 2; Several registers at the same address ***/
    union {
      struct {
        byte BKDFE       :1;                                       /* Break Detect Feature Enable */
        byte BERRM0      :1;                                       /* Bit Error Mode 0 */
        byte BERRM1      :1;                                       /* Bit Error Mode 1 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte     :1;
        byte grpBERRM :2;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } SCI6ACR2STR;
    #define SCI6ACR2                    _SCI6ACR2.Byte
    #define SCI6ACR2_BKDFE              _SCI6ACR2.SameAddr_STR.SCI6ACR2STR.Bits.BKDFE
    #define SCI6ACR2_BERRM0             _SCI6ACR2.SameAddr_STR.SCI6ACR2STR.Bits.BERRM0
    #define SCI6ACR2_BERRM1             _SCI6ACR2.SameAddr_STR.SCI6ACR2STR.Bits.BERRM1
    #define SCI6ACR2_BERRM              _SCI6ACR2.SameAddr_STR.SCI6ACR2STR.MergedBits.grpBERRM
    
    #define SCI6ACR2_BKDFE_MASK         1
    #define SCI6ACR2_BERRM0_MASK        2
    #define SCI6ACR2_BERRM1_MASK        4
    #define SCI6ACR2_BERRM_MASK         6
    #define SCI6ACR2_BERRM_BITNUM       1
    
    /*** SCI6CR1 - SCI 6 Control Register 1; Several registers at the same address ***/
    union {
      struct {
        byte PT          :1;                                       /* Parity Type Bit */
        byte PE          :1;                                       /* Parity Enable Bit */
        byte ILT         :1;                                       /* Idle Line Type Bit */
        byte WAKE        :1;                                       /* Wakeup Condition Bit */
        byte M           :1;                                       /* Data Format Mode Bit */
        byte RSRC        :1;                                       /* Receiver Source Bit */
        byte SCISWAI     :1;                                       /* SCI Stop in Wait Mode Bit */
        byte LOOPS       :1;                                       /* Loop Select Bit */
      } Bits;
    } SCI6CR1STR;
    #define SCI6CR1                     _SCI6ACR2.Byte
    #define SCI6CR1_PT                  _SCI6ACR2.SameAddr_STR.SCI6CR1STR.Bits.PT
    #define SCI6CR1_PE                  _SCI6ACR2.SameAddr_STR.SCI6CR1STR.Bits.PE
    #define SCI6CR1_ILT                 _SCI6ACR2.SameAddr_STR.SCI6CR1STR.Bits.ILT
    #define SCI6CR1_WAKE                _SCI6ACR2.SameAddr_STR.SCI6CR1STR.Bits.WAKE
    #define SCI6CR1_M                   _SCI6ACR2.SameAddr_STR.SCI6CR1STR.Bits.M
    #define SCI6CR1_RSRC                _SCI6ACR2.SameAddr_STR.SCI6CR1STR.Bits.RSRC
    #define SCI6CR1_SCISWAI             _SCI6ACR2.SameAddr_STR.SCI6CR1STR.Bits.SCISWAI
    #define SCI6CR1_LOOPS               _SCI6ACR2.SameAddr_STR.SCI6CR1STR.Bits.LOOPS
    
    #define SCI6CR1_PT_MASK             1
    #define SCI6CR1_PE_MASK             2
    #define SCI6CR1_ILT_MASK            4
    #define SCI6CR1_WAKE_MASK           8
    #define SCI6CR1_M_MASK              16
    #define SCI6CR1_RSRC_MASK           32
    #define SCI6CR1_SCISWAI_MASK        64
    #define SCI6CR1_LOOPS_MASK          128
    
  } SameAddr_STR; /*Several registers at the same address */

} SCI6ACR2STR;
extern volatile SCI6ACR2STR _SCI6ACR2 @(REG_BASE + 0x00000332);


/*** SCI6CR2 - SCI 6 Control Register 2; 0x00000333 ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break Bit */
    byte RWU         :1;                                       /* Receiver Wakeup Bit */
    byte RE          :1;                                       /* Receiver Enable Bit */
    byte TE          :1;                                       /* Transmitter Enable Bit */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable Bit */
    byte RIE         :1;                                       /* Receiver Full Interrupt Enable Bit */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable Bit */
    byte TIE         :1;                                       /* Transmitter Interrupt Enable Bit */
  } Bits;
} SCI6CR2STR;
extern volatile SCI6CR2STR _SCI6CR2 @(REG_BASE + 0x00000333);
#define SCI6CR2                         _SCI6CR2.Byte
#define SCI6CR2_SBK                     _SCI6CR2.Bits.SBK
#define SCI6CR2_RWU                     _SCI6CR2.Bits.RWU
#define SCI6CR2_RE                      _SCI6CR2.Bits.RE
#define SCI6CR2_TE                      _SCI6CR2.Bits.TE
#define SCI6CR2_ILIE                    _SCI6CR2.Bits.ILIE
#define SCI6CR2_RIE                     _SCI6CR2.Bits.RIE
#define SCI6CR2_TCIE                    _SCI6CR2.Bits.TCIE
#define SCI6CR2_TIE                     _SCI6CR2.Bits.TIE

#define SCI6CR2_SBK_MASK                1
#define SCI6CR2_RWU_MASK                2
#define SCI6CR2_RE_MASK                 4
#define SCI6CR2_TE_MASK                 8
#define SCI6CR2_ILIE_MASK               16
#define SCI6CR2_RIE_MASK                32
#define SCI6CR2_TCIE_MASK               64
#define SCI6CR2_TIE_MASK                128


/*** SCI6SR1 - SCI 6 Status Register 1; 0x00000334 ***/
typedef union {
  byte Byte;
  struct {
    byte PF          :1;                                       /* Parity Error Flag */
    byte FE          :1;                                       /* Framing Error Flag */
    byte NF          :1;                                       /* Noise Flag */
    byte OR          :1;                                       /* Overrun Flag */
    byte IDLE        :1;                                       /* Idle Line Flag */
    byte RDRF_bit    :1;                                       /* Receive Data Register Full Flag */ /*Warning: group name is duplicated with register name*/
    byte TC          :1;                                       /* Transmit Complete Flag */
    byte TDRE        :1;                                       /* Transmit Data Register Empty Flag */
  } Bits;
} SCI6SR1STR;
extern volatile SCI6SR1STR _SCI6SR1 @(REG_BASE + 0x00000334);
#define SCI6SR1                         _SCI6SR1.Byte
#define SCI6SR1_PF                      _SCI6SR1.Bits.PF
#define SCI6SR1_FE                      _SCI6SR1.Bits.FE
#define SCI6SR1_NF                      _SCI6SR1.Bits.NF
#define SCI6SR1_OR                      _SCI6SR1.Bits.OR
#define SCI6SR1_IDLE                    _SCI6SR1.Bits.IDLE
#define SCI6SR1_RDRF                    _SCI6SR1.Bits.RDRF_bit
#define SCI6SR1_TC                      _SCI6SR1.Bits.TC
#define SCI6SR1_TDRE                    _SCI6SR1.Bits.TDRE

#define SCI6SR1_PF_MASK                 1
#define SCI6SR1_FE_MASK                 2
#define SCI6SR1_NF_MASK                 4
#define SCI6SR1_OR_MASK                 8
#define SCI6SR1_IDLE_MASK               16
#define SCI6SR1_RDRF_MASK               32
#define SCI6SR1_TC_MASK                 64
#define SCI6SR1_TDRE_MASK               128


/*** SCI6SR2 - SCI 6 Status Register 2; 0x00000335 ***/
typedef union {
  byte Byte;
  struct {
    byte RAF         :1;                                       /* Receiver Active Flag */
    byte TXDIR       :1;                                       /* Transmitter pin data direction in Single-Wire mode */
    byte BRK13       :1;                                       /* Break Transmit character length */
    byte RXPOL       :1;                                       /* Receive Polarity */
    byte TXPOL       :1;                                       /* Transmit Polarity */
    byte             :1; 
    byte             :1; 
    byte AMAP        :1;                                       /* Alternative Map */
  } Bits;
} SCI6SR2STR;
extern volatile SCI6SR2STR _SCI6SR2 @(REG_BASE + 0x00000335);
#define SCI6SR2                         _SCI6SR2.Byte
#define SCI6SR2_RAF                     _SCI6SR2.Bits.RAF
#define SCI6SR2_TXDIR                   _SCI6SR2.Bits.TXDIR
#define SCI6SR2_BRK13                   _SCI6SR2.Bits.BRK13
#define SCI6SR2_RXPOL                   _SCI6SR2.Bits.RXPOL
#define SCI6SR2_TXPOL                   _SCI6SR2.Bits.TXPOL
#define SCI6SR2_AMAP                    _SCI6SR2.Bits.AMAP

