Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
        #define SCI7BDH_SBR8_MASK       1
        #define SCI7BDH_SBR9_MASK       2
        #define SCI7BDH_SBR10_MASK      4
        #define SCI7BDH_SBR11_MASK      8
        #define SCI7BDH_SBR12_MASK      16
        #define SCI7BDH_TNP0_MASK       32
        #define SCI7BDH_TNP1_MASK       64
        #define SCI7BDH_IREN_MASK       128
        #define SCI7BDH_SBR_8_MASK      31
        #define SCI7BDH_SBR_8_BITNUM    0
        #define SCI7BDH_TNP_MASK        96
        #define SCI7BDH_TNP_BITNUM      5
        
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI7ASR1STR;
    

    /*** SCI7ACR1 - SCI 7 Alternative Control Register 1; 0x00000339 ***/
    union {
      byte Byte;
      union { /* Several registers at the same address */
        /*** SCI7ACR1 - SCI 7 Alternative Control Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIE       :1;                                       /* Break Detect Interrupt Enable */
            byte BERRIE      :1;                                       /* Bit Error Interrupt Enable */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIE     :1;                                       /* Receive Input Active Edge Interrupt Enable */
          } Bits;
        } SCI7ACR1STR;
        #define SCI7ACR1                _SCI7BD.Overlap_STR.SCI7ACR1STR.Byte
        #define SCI7ACR1_BKDIE          _SCI7BD.Overlap_STR.SCI7ACR1STR.SameAddr_STR.SCI7ACR1STR.Bits.BKDIE
        #define SCI7ACR1_BERRIE         _SCI7BD.Overlap_STR.SCI7ACR1STR.SameAddr_STR.SCI7ACR1STR.Bits.BERRIE
        #define SCI7ACR1_RXEDGIE        _SCI7BD.Overlap_STR.SCI7ACR1STR.SameAddr_STR.SCI7ACR1STR.Bits.RXEDGIE
        
        #define SCI7ACR1_BKDIE_MASK     1
        #define SCI7ACR1_BERRIE_MASK    2
        #define SCI7ACR1_RXEDGIE_MASK   128
        
        /*** SCI7BDL - SCI 7 Baud Rate Register Low; Several registers at the same address ***/
        union {
          struct {
            byte SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
            byte SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
            byte SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
            byte SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
            byte SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
            byte SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
            byte SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
            byte SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
          } Bits;
        } SCI7BDLSTR;
        #define SCI7BDL                 _SCI7BD.Overlap_STR.SCI7ACR1STR.Byte
        #define SCI7BDL_SBR0            _SCI7BD.Overlap_STR.SCI7ACR1STR.SameAddr_STR.SCI7BDLSTR.Bits.SBR0
        #define SCI7BDL_SBR1            _SCI7BD.Overlap_STR.SCI7ACR1STR.SameAddr_STR.SCI7BDLSTR.Bits.SBR1
        #define SCI7BDL_SBR2            _SCI7BD.Overlap_STR.SCI7ACR1STR.SameAddr_STR.SCI7BDLSTR.Bits.SBR2
        #define SCI7BDL_SBR3            _SCI7BD.Overlap_STR.SCI7ACR1STR.SameAddr_STR.SCI7BDLSTR.Bits.SBR3
        #define SCI7BDL_SBR4            _SCI7BD.Overlap_STR.SCI7ACR1STR.SameAddr_STR.SCI7BDLSTR.Bits.SBR4
        #define SCI7BDL_SBR5            _SCI7BD.Overlap_STR.SCI7ACR1STR.SameAddr_STR.SCI7BDLSTR.Bits.SBR5
        #define SCI7BDL_SBR6            _SCI7BD.Overlap_STR.SCI7ACR1STR.SameAddr_STR.SCI7BDLSTR.Bits.SBR6
        #define SCI7BDL_SBR7            _SCI7BD.Overlap_STR.SCI7ACR1STR.SameAddr_STR.SCI7BDLSTR.Bits.SBR7
        
        #define SCI7BDL_SBR0_MASK       1
        #define SCI7BDL_SBR1_MASK       2
        #define SCI7BDL_SBR2_MASK       4
        #define SCI7BDL_SBR3_MASK       8
        #define SCI7BDL_SBR4_MASK       16
        #define SCI7BDL_SBR5_MASK       32
        #define SCI7BDL_SBR6_MASK       64
        #define SCI7BDL_SBR7_MASK       128
        
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI7ACR1STR;
    
  } Overlap_STR;

  struct {
    word SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
    word SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
    word SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
    word SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
    word SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
    word SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
    word SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
    word SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
    word SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
    word SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
    word SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
    word SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
    word SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
    word TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
    word TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
    word IREN        :1;                                       /* Infrared Enable Bit */
  } Bits;
  struct {
    word grpSBR  :13;
    word grpTNP  :2;
    word         :1;
  } MergedBits;
} SCI7BDSTR;
extern volatile SCI7BDSTR _SCI7BD @(REG_BASE + 0x00000338);
#define SCI7BD                          _SCI7BD.Word
#define SCI7BD_SBR0                     _SCI7BD.Bits.SBR0
#define SCI7BD_SBR1                     _SCI7BD.Bits.SBR1
#define SCI7BD_SBR2                     _SCI7BD.Bits.SBR2
#define SCI7BD_SBR3                     _SCI7BD.Bits.SBR3
#define SCI7BD_SBR4                     _SCI7BD.Bits.SBR4
#define SCI7BD_SBR5                     _SCI7BD.Bits.SBR5
#define SCI7BD_SBR6                     _SCI7BD.Bits.SBR6
#define SCI7BD_SBR7                     _SCI7BD.Bits.SBR7
#define SCI7BD_SBR8                     _SCI7BD.Bits.SBR8
#define SCI7BD_SBR9                     _SCI7BD.Bits.SBR9
#define SCI7BD_SBR10                    _SCI7BD.Bits.SBR10
#define SCI7BD_SBR11                    _SCI7BD.Bits.SBR11
#define SCI7BD_SBR12                    _SCI7BD.Bits.SBR12
#define SCI7BD_TNP0                     _SCI7BD.Bits.TNP0
#define SCI7BD_TNP1                     _SCI7BD.Bits.TNP1
#define SCI7BD_IREN                     _SCI7BD.Bits.IREN
#define SCI7BD_SBR                      _SCI7BD.MergedBits.grpSBR
#define SCI7BD_TNP                      _SCI7BD.MergedBits.grpTNP

#define SCI7BD_SBR0_MASK                1
#define SCI7BD_SBR1_MASK                2
#define SCI7BD_SBR2_MASK                4
#define SCI7BD_SBR3_MASK                8
#define SCI7BD_SBR4_MASK                16
#define SCI7BD_SBR5_MASK                32
#define SCI7BD_SBR6_MASK                64
#define SCI7BD_SBR7_MASK                128
#define SCI7BD_SBR8_MASK                256
#define SCI7BD_SBR9_MASK                512
#define SCI7BD_SBR10_MASK               1024
#define SCI7BD_SBR11_MASK               2048
#define SCI7BD_SBR12_MASK               4096
#define SCI7BD_TNP0_MASK                8192
#define SCI7BD_TNP1_MASK                16384
#define SCI7BD_IREN_MASK                32768
#define SCI7BD_SBR_MASK                 8191
#define SCI7BD_SBR_BITNUM               0
#define SCI7BD_TNP_MASK                 24576
#define SCI7BD_TNP_BITNUM               13


/*** SCI7ACR2 - SCI 7 Alternative Control Register 2; 0x0000033A ***/
typedef union {
  byte Byte;
  union { /* Several registers at the same address */
    /*** SCI7ACR2 - SCI 7 Alternative Control Register 2; Several registers at the same address ***/
    union {
      struct {
        byte BKDFE       :1;                                       /* Break Detect Feature Enable */
        byte BERRM0      :1;                                       /* Bit Error Mode 0 */
        byte BERRM1      :1;                                       /* Bit Error Mode 1 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte     :1;
        byte grpBERRM :2;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } SCI7ACR2STR;
    #define SCI7ACR2                    _SCI7ACR2.Byte
    #define SCI7ACR2_BKDFE              _SCI7ACR2.SameAddr_STR.SCI7ACR2STR.Bits.BKDFE
    #define SCI7ACR2_BERRM0             _SCI7ACR2.SameAddr_STR.SCI7ACR2STR.Bits.BERRM0
    #define SCI7ACR2_BERRM1             _SCI7ACR2.SameAddr_STR.SCI7ACR2STR.Bits.BERRM1
    #define SCI7ACR2_BERRM              _SCI7ACR2.SameAddr_STR.SCI7ACR2STR.MergedBits.grpBERRM
    
