Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
    #define SCI7ACR2_BKDFE_MASK         1
    #define SCI7ACR2_BERRM0_MASK        2
    #define SCI7ACR2_BERRM1_MASK        4
    #define SCI7ACR2_BERRM_MASK         6
    #define SCI7ACR2_BERRM_BITNUM       1
    
    /*** SCI7CR1 - SCI 7 Control Register 1; Several registers at the same address ***/
    union {
      struct {
        byte PT          :1;                                       /* Parity Type Bit */
        byte PE          :1;                                       /* Parity Enable Bit */
        byte ILT         :1;                                       /* Idle Line Type Bit */
        byte WAKE        :1;                                       /* Wakeup Condition Bit */
        byte M           :1;                                       /* Data Format Mode Bit */
        byte RSRC        :1;                                       /* Receiver Source Bit */
        byte SCISWAI     :1;                                       /* SCI Stop in Wait Mode Bit */
        byte LOOPS       :1;                                       /* Loop Select Bit */
      } Bits;
    } SCI7CR1STR;
    #define SCI7CR1                     _SCI7ACR2.Byte
    #define SCI7CR1_PT                  _SCI7ACR2.SameAddr_STR.SCI7CR1STR.Bits.PT
    #define SCI7CR1_PE                  _SCI7ACR2.SameAddr_STR.SCI7CR1STR.Bits.PE
    #define SCI7CR1_ILT                 _SCI7ACR2.SameAddr_STR.SCI7CR1STR.Bits.ILT
    #define SCI7CR1_WAKE                _SCI7ACR2.SameAddr_STR.SCI7CR1STR.Bits.WAKE
    #define SCI7CR1_M                   _SCI7ACR2.SameAddr_STR.SCI7CR1STR.Bits.M
    #define SCI7CR1_RSRC                _SCI7ACR2.SameAddr_STR.SCI7CR1STR.Bits.RSRC
    #define SCI7CR1_SCISWAI             _SCI7ACR2.SameAddr_STR.SCI7CR1STR.Bits.SCISWAI
    #define SCI7CR1_LOOPS               _SCI7ACR2.SameAddr_STR.SCI7CR1STR.Bits.LOOPS
    
    #define SCI7CR1_PT_MASK             1
    #define SCI7CR1_PE_MASK             2
    #define SCI7CR1_ILT_MASK            4
    #define SCI7CR1_WAKE_MASK           8
    #define SCI7CR1_M_MASK              16
    #define SCI7CR1_RSRC_MASK           32
    #define SCI7CR1_SCISWAI_MASK        64
    #define SCI7CR1_LOOPS_MASK          128
    
  } SameAddr_STR; /*Several registers at the same address */

} SCI7ACR2STR;
extern volatile SCI7ACR2STR _SCI7ACR2 @(REG_BASE + 0x0000033A);


/*** SCI7CR2 - SCI 7 Control Register 2; 0x0000033B ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break Bit */
    byte RWU         :1;                                       /* Receiver Wakeup Bit */
    byte RE          :1;                                       /* Receiver Enable Bit */
    byte TE          :1;                                       /* Transmitter Enable Bit */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable Bit */
    byte RIE         :1;                                       /* Receiver Full Interrupt Enable Bit */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable Bit */
    byte TIE         :1;                                       /* Transmitter Interrupt Enable Bit */
  } Bits;
} SCI7CR2STR;
extern volatile SCI7CR2STR _SCI7CR2 @(REG_BASE + 0x0000033B);
#define SCI7CR2                         _SCI7CR2.Byte
#define SCI7CR2_SBK                     _SCI7CR2.Bits.SBK
#define SCI7CR2_RWU                     _SCI7CR2.Bits.RWU
#define SCI7CR2_RE                      _SCI7CR2.Bits.RE
#define SCI7CR2_TE                      _SCI7CR2.Bits.TE
#define SCI7CR2_ILIE                    _SCI7CR2.Bits.ILIE
#define SCI7CR2_RIE                     _SCI7CR2.Bits.RIE
#define SCI7CR2_TCIE                    _SCI7CR2.Bits.TCIE
#define SCI7CR2_TIE                     _SCI7CR2.Bits.TIE

#define SCI7CR2_SBK_MASK                1
#define SCI7CR2_RWU_MASK                2
#define SCI7CR2_RE_MASK                 4
#define SCI7CR2_TE_MASK                 8
#define SCI7CR2_ILIE_MASK               16
#define SCI7CR2_RIE_MASK                32
#define SCI7CR2_TCIE_MASK               64
#define SCI7CR2_TIE_MASK                128


/*** SCI7SR1 - SCI 7 Status Register 1; 0x0000033C ***/
typedef union {
  byte Byte;
  struct {
    byte PF          :1;                                       /* Parity Error Flag */
    byte FE          :1;                                       /* Framing Error Flag */
    byte NF          :1;                                       /* Noise Flag */
    byte OR          :1;                                       /* Overrun Flag */
    byte IDLE        :1;                                       /* Idle Line Flag */
    byte RDRF_bit    :1;                                       /* Receive Data Register Full Flag */ /*Warning: group name is duplicated with register name*/
    byte TC          :1;                                       /* Transmit Complete Flag */
    byte TDRE        :1;                                       /* Transmit Data Register Empty Flag */
  } Bits;
} SCI7SR1STR;
extern volatile SCI7SR1STR _SCI7SR1 @(REG_BASE + 0x0000033C);
#define SCI7SR1                         _SCI7SR1.Byte
#define SCI7SR1_PF                      _SCI7SR1.Bits.PF
#define SCI7SR1_FE                      _SCI7SR1.Bits.FE
#define SCI7SR1_NF                      _SCI7SR1.Bits.NF
#define SCI7SR1_OR                      _SCI7SR1.Bits.OR
#define SCI7SR1_IDLE                    _SCI7SR1.Bits.IDLE
#define SCI7SR1_RDRF                    _SCI7SR1.Bits.RDRF_bit
#define SCI7SR1_TC                      _SCI7SR1.Bits.TC
#define SCI7SR1_TDRE                    _SCI7SR1.Bits.TDRE

#define SCI7SR1_PF_MASK                 1
#define SCI7SR1_FE_MASK                 2
#define SCI7SR1_NF_MASK                 4
#define SCI7SR1_OR_MASK                 8
#define SCI7SR1_IDLE_MASK               16
#define SCI7SR1_RDRF_MASK               32
#define SCI7SR1_TC_MASK                 64
#define SCI7SR1_TDRE_MASK               128


/*** SCI7SR2 - SCI 7 Status Register 2; 0x0000033D ***/
typedef union {
  byte Byte;
  struct {
    byte RAF         :1;                                       /* Receiver Active Flag */
    byte TXDIR       :1;                                       /* Transmitter pin data direction in Single-Wire mode */
    byte BRK13       :1;                                       /* Break Transmit character length */
    byte RXPOL       :1;                                       /* Receive Polarity */
    byte TXPOL       :1;                                       /* Transmit Polarity */
    byte             :1; 
    byte             :1; 
    byte AMAP        :1;                                       /* Alternative Map */
  } Bits;
} SCI7SR2STR;
