Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
extern volatile SCI7SR2STR _SCI7SR2 @(REG_BASE + 0x0000033D);
#define SCI7SR2                         _SCI7SR2.Byte
#define SCI7SR2_RAF                     _SCI7SR2.Bits.RAF
#define SCI7SR2_TXDIR                   _SCI7SR2.Bits.TXDIR
#define SCI7SR2_BRK13                   _SCI7SR2.Bits.BRK13
#define SCI7SR2_RXPOL                   _SCI7SR2.Bits.RXPOL
#define SCI7SR2_TXPOL                   _SCI7SR2.Bits.TXPOL
#define SCI7SR2_AMAP                    _SCI7SR2.Bits.AMAP

#define SCI7SR2_RAF_MASK                1
#define SCI7SR2_TXDIR_MASK              2
#define SCI7SR2_BRK13_MASK              4
#define SCI7SR2_RXPOL_MASK              8
#define SCI7SR2_TXPOL_MASK              16
#define SCI7SR2_AMAP_MASK               128


/*** SCI7DRH - SCI 7 Data Register High; 0x0000033E ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte T8          :1;                                       /* Transmit Bit 8 */
    byte R8          :1;                                       /* Received Bit 8 */
  } Bits;
} SCI7DRHSTR;
extern volatile SCI7DRHSTR _SCI7DRH @(REG_BASE + 0x0000033E);
#define SCI7DRH                         _SCI7DRH.Byte
#define SCI7DRH_T8                      _SCI7DRH.Bits.T8
#define SCI7DRH_R8                      _SCI7DRH.Bits.R8

#define SCI7DRH_T8_MASK                 64
#define SCI7DRH_R8_MASK                 128


/*** SCI7DRL - SCI 7 Data Register Low; 0x0000033F ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Received bit 0 or Transmit bit 0 */
    byte R1_T1       :1;                                       /* Received bit 1 or Transmit bit 1 */
    byte R2_T2       :1;                                       /* Received bit 2 or Transmit bit 2 */
    byte R3_T3       :1;                                       /* Received bit 3 or Transmit bit 3 */
    byte R4_T4       :1;                                       /* Received bit 4 or Transmit bit 4 */
    byte R5_T5       :1;                                       /* Received bit 5 or Transmit bit 5 */
    byte R6_T6       :1;                                       /* Received bit 6 or Transmit bit 6 */
    byte R7_T7       :1;                                       /* Received bit 7 or Transmit bit 7 */
  } Bits;
} SCI7DRLSTR;
extern volatile SCI7DRLSTR _SCI7DRL @(REG_BASE + 0x0000033F);
#define SCI7DRL                         _SCI7DRL.Byte
#define SCI7DRL_R0_T0                   _SCI7DRL.Bits.R0_T0
#define SCI7DRL_R1_T1                   _SCI7DRL.Bits.R1_T1
#define SCI7DRL_R2_T2                   _SCI7DRL.Bits.R2_T2
#define SCI7DRL_R3_T3                   _SCI7DRL.Bits.R3_T3
#define SCI7DRL_R4_T4                   _SCI7DRL.Bits.R4_T4
#define SCI7DRL_R5_T5                   _SCI7DRL.Bits.R5_T5
#define SCI7DRL_R6_T6                   _SCI7DRL.Bits.R6_T6
#define SCI7DRL_R7_T7                   _SCI7DRL.Bits.R7_T7

#define SCI7DRL_R0_T0_MASK              1
#define SCI7DRL_R1_T1_MASK              2
#define SCI7DRL_R2_T2_MASK              4
#define SCI7DRL_R3_T3_MASK              8
#define SCI7DRL_R4_T4_MASK              16
#define SCI7DRL_R5_T5_MASK              32
#define SCI7DRL_R6_T6_MASK              64
#define SCI7DRL_R7_T7_MASK              128


/*** PITCFLMT - PIT Control and Force Load Micro Timer Register; 0x00000340 ***/
typedef union {
  byte Byte;
  struct {
    byte PFLMT0      :1;                                       /* PIT Force Load Bits for Micro Timer 0 */
    byte PFLMT1      :1;                                       /* PIT Force Load Bits for Micro Timer 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PITFRZ      :1;                                       /* PIT Counter Freeze while in Freeze Mode Bit */
    byte PITSWAI     :1;                                       /* PIT Stop in Wait Mode Bit */
    byte PITE        :1;                                       /* PIT Module Enable Bit */
  } Bits;
  struct {
    byte grpPFLMT :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PITCFLMTSTR;
extern volatile PITCFLMTSTR _PITCFLMT @(REG_BASE + 0x00000340);
#define PITCFLMT                        _PITCFLMT.Byte
#define PITCFLMT_PFLMT0                 _PITCFLMT.Bits.PFLMT0
#define PITCFLMT_PFLMT1                 _PITCFLMT.Bits.PFLMT1
#define PITCFLMT_PITFRZ                 _PITCFLMT.Bits.PITFRZ
#define PITCFLMT_PITSWAI                _PITCFLMT.Bits.PITSWAI
#define PITCFLMT_PITE                   _PITCFLMT.Bits.PITE
#define PITCFLMT_PFLMT                  _PITCFLMT.MergedBits.grpPFLMT

#define PITCFLMT_PFLMT0_MASK            1
#define PITCFLMT_PFLMT1_MASK            2
#define PITCFLMT_PITFRZ_MASK            32
#define PITCFLMT_PITSWAI_MASK           64
#define PITCFLMT_PITE_MASK              128
#define PITCFLMT_PFLMT_MASK             3
#define PITCFLMT_PFLMT_BITNUM           0


/*** PITFLT - PIT Force Load Timer Register; 0x00000341 ***/
typedef union {
  byte Byte;
  struct {
    byte PFLT0       :1;                                       /* PIT Force Load Bits for Timer 0 */
    byte PFLT1       :1;                                       /* PIT Force Load Bits for Timer 1 */
    byte PFLT2       :1;                                       /* PIT Force Load Bits for Timer 2 */
    byte PFLT3       :1;                                       /* PIT Force Load Bits for Timer 3 */
    byte PFLT4       :1;                                       /* PIT Force Load Bits for Timer 4 */
    byte PFLT5       :1;                                       /* PIT Force Load Bits for Timer 5 */
    byte PFLT6       :1;                                       /* PIT Force Load Bits for Timer 6 */
    byte PFLT7       :1;                                       /* PIT Force Load Bits for Timer 7 */
  } Bits;
} PITFLTSTR;
extern volatile PITFLTSTR _PITFLT @(REG_BASE + 0x00000341);
#define PITFLT                          _PITFLT.Byte
#define PITFLT_PFLT0                    _PITFLT.Bits.PFLT0
#define PITFLT_PFLT1                    _PITFLT.Bits.PFLT1
#define PITFLT_PFLT2                    _PITFLT.Bits.PFLT2
#define PITFLT_PFLT3                    _PITFLT.Bits.PFLT3
#define PITFLT_PFLT4                    _PITFLT.Bits.PFLT4
#define PITFLT_PFLT5                    _PITFLT.Bits.PFLT5
#define PITFLT_PFLT6                    _PITFLT.Bits.PFLT6
#define PITFLT_PFLT7                    _PITFLT.Bits.PFLT7

#define PITFLT_PFLT0_MASK               1
#define PITFLT_PFLT1_MASK               2
#define PITFLT_PFLT2_MASK               4
#define PITFLT_PFLT3_MASK               8
#define PITFLT_PFLT4_MASK               16
#define PITFLT_PFLT5_MASK               32
#define PITFLT_PFLT6_MASK               64
#define PITFLT_PFLT7_MASK               128


/*** PITCE - PIT Channel Enable Register; 0x00000342 ***/
typedef union {
  byte Byte;
  struct {
    byte PCE0        :1;                                       /* PIT Enable Bits for Timer Channel 0 */
    byte PCE1        :1;                                       /* PIT Enable Bits for Timer Channel 1 */
    byte PCE2        :1;                                       /* PIT Enable Bits for Timer Channel 2 */
    byte PCE3        :1;                                       /* PIT Enable Bits for Timer Channel 3 */
    byte PCE4        :1;                                       /* PIT Enable Bits for Timer Channel 4 */
    byte PCE5        :1;                                       /* PIT Enable Bits for Timer Channel 5 */
    byte PCE6        :1;                                       /* PIT Enable Bits for Timer Channel 6 */
    byte PCE7        :1;                                       /* PIT Enable Bits for Timer Channel 7 */
  } Bits;
} PITCESTR;
extern volatile PITCESTR _PITCE @(REG_BASE + 0x00000342);
#define PITCE                           _PITCE.Byte
#define PITCE_PCE0                      _PITCE.Bits.PCE0
#define PITCE_PCE1                      _PITCE.Bits.PCE1
#define PITCE_PCE2                      _PITCE.Bits.PCE2
#define PITCE_PCE3                      _PITCE.Bits.PCE3
#define PITCE_PCE4                      _PITCE.Bits.PCE4
#define PITCE_PCE5                      _PITCE.Bits.PCE5
#define PITCE_PCE6                      _PITCE.Bits.PCE6
#define PITCE_PCE7                      _PITCE.Bits.PCE7

#define PITCE_PCE0_MASK                 1
#define PITCE_PCE1_MASK                 2
#define PITCE_PCE2_MASK                 4
#define PITCE_PCE3_MASK                 8
#define PITCE_PCE4_MASK                 16
#define PITCE_PCE5_MASK                 32
#define PITCE_PCE6_MASK                 64
#define PITCE_PCE7_MASK                 128


