Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define RDRL_RDRL0_MASK                 1
#define RDRL_RDRL1_MASK                 2
#define RDRL_RDRL2_MASK                 4
#define RDRL_RDRL3_MASK                 8
#define RDRL_RDRL4_MASK                 16
#define RDRL_RDRL5_MASK                 32
#define RDRL_RDRL6_MASK                 64
#define RDRL_RDRL7_MASK                 128


/*** PERL - Port L Pull Device Enable Register; 0x00000374 ***/
typedef union {
  byte Byte;
  struct {
    byte PERL0       :1;                                       /* Port L pull device enable bit 0 */
    byte PERL1       :1;                                       /* Port L pull device enable bit 1 */
    byte PERL2       :1;                                       /* Port L pull device enable bit 2 */
    byte PERL3       :1;                                       /* Port L pull device enable bit 3 */
    byte PERL4       :1;                                       /* Port L pull device enable bit 4 */
    byte PERL5       :1;                                       /* Port L pull device enable bit 5 */
    byte PERL6       :1;                                       /* Port L pull device enable bit 6 */
    byte PERL7       :1;                                       /* Port L pull device enable bit 7 */
  } Bits;
} PERLSTR;
extern volatile PERLSTR _PERL @(REG_BASE + 0x00000374);
#define PERL                            _PERL.Byte
#define PERL_PERL0                      _PERL.Bits.PERL0
#define PERL_PERL1                      _PERL.Bits.PERL1
#define PERL_PERL2                      _PERL.Bits.PERL2
#define PERL_PERL3                      _PERL.Bits.PERL3
#define PERL_PERL4                      _PERL.Bits.PERL4
#define PERL_PERL5                      _PERL.Bits.PERL5
#define PERL_PERL6                      _PERL.Bits.PERL6
#define PERL_PERL7                      _PERL.Bits.PERL7

#define PERL_PERL0_MASK                 1
#define PERL_PERL1_MASK                 2
#define PERL_PERL2_MASK                 4
#define PERL_PERL3_MASK                 8
#define PERL_PERL4_MASK                 16
#define PERL_PERL5_MASK                 32
#define PERL_PERL6_MASK                 64
#define PERL_PERL7_MASK                 128


/*** PPSL - Port L Polarity Select Register; 0x00000375 ***/
typedef union {
  byte Byte;
  struct {
    byte PPSL0       :1;                                       /* Port L pull device select bit 0 */
    byte PPSL1       :1;                                       /* Port L pull device select bit 1 */
    byte PPSL2       :1;                                       /* Port L pull device select bit 2 */
    byte PPSL3       :1;                                       /* Port L pull device select bit 3 */
    byte PPSL4       :1;                                       /* Port L pull device select bit 4 */
    byte PPSL5       :1;                                       /* Port L pull device select bit 5 */
    byte PPSL6       :1;                                       /* Port L pull device select bit 6 */
    byte PPSL7       :1;                                       /* Port L pull device select bit 7 */
  } Bits;
} PPSLSTR;
extern volatile PPSLSTR _PPSL @(REG_BASE + 0x00000375);
#define PPSL                            _PPSL.Byte
#define PPSL_PPSL0                      _PPSL.Bits.PPSL0
#define PPSL_PPSL1                      _PPSL.Bits.PPSL1
#define PPSL_PPSL2                      _PPSL.Bits.PPSL2
#define PPSL_PPSL3                      _PPSL.Bits.PPSL3
#define PPSL_PPSL4                      _PPSL.Bits.PPSL4
#define PPSL_PPSL5                      _PPSL.Bits.PPSL5
#define PPSL_PPSL6                      _PPSL.Bits.PPSL6
#define PPSL_PPSL7                      _PPSL.Bits.PPSL7

#define PPSL_PPSL0_MASK                 1
#define PPSL_PPSL1_MASK                 2
#define PPSL_PPSL2_MASK                 4
#define PPSL_PPSL3_MASK                 8
#define PPSL_PPSL4_MASK                 16
#define PPSL_PPSL5_MASK                 32
#define PPSL_PPSL6_MASK                 64
#define PPSL_PPSL7_MASK                 128


/*** WOML - Port L Wired-Or Mode Register; 0x00000376 ***/
typedef union {
  byte Byte;
  struct {
    byte WOML0       :1;                                       /* Port L wired-or mode bit 0 */
    byte WOML1       :1;                                       /* Port L wired-or mode bit 1 */
    byte WOML2       :1;                                       /* Port L wired-or mode bit 2 */
    byte WOML3       :1;                                       /* Port L wired-or mode bit 3 */
    byte WOML4       :1;                                       /* Port L wired-or mode bit 4 */
    byte WOML5       :1;                                       /* Port L wired-or mode bit 5 */
    byte WOML6       :1;                                       /* Port L wired-or mode bit 6 */
    byte WOML7       :1;                                       /* Port L wired-or mode bit 7 */
  } Bits;
} WOMLSTR;
extern volatile WOMLSTR _WOML @(REG_BASE + 0x00000376);
#define WOML                            _WOML.Byte
#define WOML_WOML0                      _WOML.Bits.WOML0
#define WOML_WOML1                      _WOML.Bits.WOML1
#define WOML_WOML2                      _WOML.Bits.WOML2
#define WOML_WOML3                      _WOML.Bits.WOML3
#define WOML_WOML4                      _WOML.Bits.WOML4
#define WOML_WOML5                      _WOML.Bits.WOML5
#define WOML_WOML6                      _WOML.Bits.WOML6
#define WOML_WOML7                      _WOML.Bits.WOML7

#define WOML_WOML0_MASK                 1
#define WOML_WOML1_MASK                 2
#define WOML_WOML2_MASK                 4
#define WOML_WOML3_MASK                 8
#define WOML_WOML4_MASK                 16
#define WOML_WOML5_MASK                 32
#define WOML_WOML6_MASK                 64
#define WOML_WOML7_MASK                 128


/*** PTLRR - Port L Routing Register; 0x00000377 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTLRR4      :1;                                       /* Port L  routing */
    byte PTLRR5      :1;                                       /* Port L  routing */
    byte PTLRR6      :1;                                       /* Port L  routing */
    byte PTLRR7      :1;                                       /* Port L  routing */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpPTLRR_4 :4;
  } MergedBits;
} PTLRRSTR;
extern volatile PTLRRSTR _PTLRR @(REG_BASE + 0x00000377);
#define PTLRR                           _PTLRR.Byte
#define PTLRR_PTLRR4                    _PTLRR.Bits.PTLRR4
#define PTLRR_PTLRR5                    _PTLRR.Bits.PTLRR5
#define PTLRR_PTLRR6                    _PTLRR.Bits.PTLRR6
#define PTLRR_PTLRR7                    _PTLRR.Bits.PTLRR7
#define PTLRR_PTLRR_4                   _PTLRR.MergedBits.grpPTLRR_4

