Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define XGIF_7F_70_XGIF_70_MASK         1
#define XGIF_7F_70_XGIF_71_MASK         2
#define XGIF_7F_70_XGIF_72_MASK         4
#define XGIF_7F_70_XGIF_73_MASK         8
#define XGIF_7F_70_XGIF_74_MASK         16
#define XGIF_7F_70_XGIF_75_MASK         32
#define XGIF_7F_70_XGIF_76_MASK         64
#define XGIF_7F_70_XGIF_77_MASK         128
#define XGIF_7F_70_XGIF_78_MASK         256
#define XGIF_7F_70_XGIF__70_MASK        511
#define XGIF_7F_70_XGIF__70_BITNUM      0


/*** XGIF_6F_60 - XGATE Channel Interrupt Flag Vector; 0x0000038A ***/
typedef union {
  word Word;
  struct {
    word XGIF_60     :1;                                       /* Channel Interrupt Flags */
    word XGIF_61     :1;                                       /* Channel Interrupt Flags */
    word XGIF_62     :1;                                       /* Channel Interrupt Flags */
    word XGIF_63     :1;                                       /* Channel Interrupt Flags */
    word XGIF_64     :1;                                       /* Channel Interrupt Flags */
    word XGIF_65     :1;                                       /* Channel Interrupt Flags */
    word XGIF_66     :1;                                       /* Channel Interrupt Flags */
    word XGIF_67     :1;                                       /* Channel Interrupt Flags */
    word XGIF_68     :1;                                       /* Channel Interrupt Flags */
    word XGIF_69     :1;                                       /* Channel Interrupt Flags */
    word XGIF_6A     :1;                                       /* Channel Interrupt Flags */
    word XGIF_6B     :1;                                       /* Channel Interrupt Flags */
    word XGIF_6C     :1;                                       /* Channel Interrupt Flags */
    word XGIF_6D     :1;                                       /* Channel Interrupt Flags */
    word XGIF_6E     :1;                                       /* Channel Interrupt Flags */
    word XGIF_6F     :1;                                       /* Channel Interrupt Flags */
  } Bits;
  struct {
    word grpXGIF__60 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_6F_60STR;
extern volatile XGIF_6F_60STR _XGIF_6F_60 @(REG_BASE + 0x0000038A);
#define XGIF_6F_60                      _XGIF_6F_60.Word
#define XGIF_6F_60_XGIF_60              _XGIF_6F_60.Bits.XGIF_60
#define XGIF_6F_60_XGIF_61              _XGIF_6F_60.Bits.XGIF_61
#define XGIF_6F_60_XGIF_62              _XGIF_6F_60.Bits.XGIF_62
#define XGIF_6F_60_XGIF_63              _XGIF_6F_60.Bits.XGIF_63
#define XGIF_6F_60_XGIF_64              _XGIF_6F_60.Bits.XGIF_64
#define XGIF_6F_60_XGIF_65              _XGIF_6F_60.Bits.XGIF_65
#define XGIF_6F_60_XGIF_66              _XGIF_6F_60.Bits.XGIF_66
#define XGIF_6F_60_XGIF_67              _XGIF_6F_60.Bits.XGIF_67
#define XGIF_6F_60_XGIF_68              _XGIF_6F_60.Bits.XGIF_68
#define XGIF_6F_60_XGIF_69              _XGIF_6F_60.Bits.XGIF_69
#define XGIF_6F_60_XGIF_6A              _XGIF_6F_60.Bits.XGIF_6A
#define XGIF_6F_60_XGIF_6B              _XGIF_6F_60.Bits.XGIF_6B
#define XGIF_6F_60_XGIF_6C              _XGIF_6F_60.Bits.XGIF_6C
#define XGIF_6F_60_XGIF_6D              _XGIF_6F_60.Bits.XGIF_6D
#define XGIF_6F_60_XGIF_6E              _XGIF_6F_60.Bits.XGIF_6E
#define XGIF_6F_60_XGIF_6F              _XGIF_6F_60.Bits.XGIF_6F
#define XGIF_6F_60_XGIF__60             _XGIF_6F_60.MergedBits.grpXGIF__60
#define XGIF_6F_60_XGIF_                XGIF_6F_60_XGIF__60

#define XGIF_6F_60_XGIF_60_MASK         1
#define XGIF_6F_60_XGIF_61_MASK         2
#define XGIF_6F_60_XGIF_62_MASK         4
#define XGIF_6F_60_XGIF_63_MASK         8
#define XGIF_6F_60_XGIF_64_MASK         16
#define XGIF_6F_60_XGIF_65_MASK         32
#define XGIF_6F_60_XGIF_66_MASK         64
#define XGIF_6F_60_XGIF_67_MASK         128
#define XGIF_6F_60_XGIF_68_MASK         256
#define XGIF_6F_60_XGIF_69_MASK         512
#define XGIF_6F_60_XGIF_6A_MASK         1024
#define XGIF_6F_60_XGIF_6B_MASK         2048
#define XGIF_6F_60_XGIF_6C_MASK         4096
#define XGIF_6F_60_XGIF_6D_MASK         8192
#define XGIF_6F_60_XGIF_6E_MASK         16384
#define XGIF_6F_60_XGIF_6F_MASK         32768
#define XGIF_6F_60_XGIF__60_MASK        1023
#define XGIF_6F_60_XGIF__60_BITNUM      0


/*** XGIF_5F_50 - XGATE Channel Interrupt Flag Vector; 0x0000038C ***/
typedef union {
  word Word;
  struct {
    word XGIF_50     :1;                                       /* Channel Interrupt Flags */
    word XGIF_51     :1;                                       /* Channel Interrupt Flags */
    word XGIF_52     :1;                                       /* Channel Interrupt Flags */
    word XGIF_53     :1;                                       /* Channel Interrupt Flags */
    word XGIF_54     :1;                                       /* Channel Interrupt Flags */
    word XGIF_55     :1;                                       /* Channel Interrupt Flags */
    word XGIF_56     :1;                                       /* Channel Interrupt Flags */
    word XGIF_57     :1;                                       /* Channel Interrupt Flags */
    word XGIF_58     :1;                                       /* Channel Interrupt Flags */
    word XGIF_59     :1;                                       /* Channel Interrupt Flags */
    word XGIF_5A     :1;                                       /* Channel Interrupt Flags */
    word XGIF_5B     :1;                                       /* Channel Interrupt Flags */
    word XGIF_5C     :1;                                       /* Channel Interrupt Flags */
    word XGIF_5D     :1;                                       /* Channel Interrupt Flags */
    word XGIF_5E     :1;                                       /* Channel Interrupt Flags */
    word XGIF_5F     :1;                                       /* Channel Interrupt Flags */
  } Bits;
  struct {
    word grpXGIF__50 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_5F_50STR;
