Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
/*** XGR2 - XGATE Register 2; 0x000003A4 ***/
typedef union {
  word Word;
} XGR2STR;
extern volatile XGR2STR _XGR2 @(REG_BASE + 0x000003A4);
#define XGR2                            _XGR2.Word


/*** XGR3 - XGATE Register 3; 0x000003A6 ***/
typedef union {
  word Word;
} XGR3STR;
extern volatile XGR3STR _XGR3 @(REG_BASE + 0x000003A6);
#define XGR3                            _XGR3.Word


/*** XGR4 - XGATE Register 4; 0x000003A8 ***/
typedef union {
  word Word;
} XGR4STR;
extern volatile XGR4STR _XGR4 @(REG_BASE + 0x000003A8);
#define XGR4                            _XGR4.Word


/*** XGR5 - XGATE Register 5; 0x000003AA ***/
typedef union {
  word Word;
} XGR5STR;
extern volatile XGR5STR _XGR5 @(REG_BASE + 0x000003AA);
#define XGR5                            _XGR5.Word


/*** XGR6 - XGATE Register 6; 0x000003AC ***/
typedef union {
  word Word;
} XGR6STR;
extern volatile XGR6STR _XGR6 @(REG_BASE + 0x000003AC);
#define XGR6                            _XGR6.Word


/*** XGR7 - XGATE Register 7; 0x000003AE ***/
typedef union {
  word Word;
} XGR7STR;
extern volatile XGR7STR _XGR7 @(REG_BASE + 0x000003AE);
#define XGR7                            _XGR7.Word


/*** TIM_TIOS - Timer Input Capture/Output Compare Select; 0x000003D0 ***/
typedef union {
  byte Byte;
  struct {
    byte IOS0        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 0 */
    byte IOS1        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 1 */
    byte IOS2        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 2 */
    byte IOS3        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 3 */
    byte IOS4        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 4 */
    byte IOS5        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 5 */
    byte IOS6        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 6 */
    byte IOS7        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 7 */
  } Bits;
} TIM_TIOSSTR;
extern volatile TIM_TIOSSTR _TIM_TIOS @(REG_BASE + 0x000003D0);
#define TIM_TIOS                        _TIM_TIOS.Byte
#define TIM_TIOS_IOS0                   _TIM_TIOS.Bits.IOS0
#define TIM_TIOS_IOS1                   _TIM_TIOS.Bits.IOS1
#define TIM_TIOS_IOS2                   _TIM_TIOS.Bits.IOS2
#define TIM_TIOS_IOS3                   _TIM_TIOS.Bits.IOS3
#define TIM_TIOS_IOS4                   _TIM_TIOS.Bits.IOS4
#define TIM_TIOS_IOS5                   _TIM_TIOS.Bits.IOS5
#define TIM_TIOS_IOS6                   _TIM_TIOS.Bits.IOS6
#define TIM_TIOS_IOS7                   _TIM_TIOS.Bits.IOS7

#define TIM_TIOS_IOS0_MASK              1
#define TIM_TIOS_IOS1_MASK              2
#define TIM_TIOS_IOS2_MASK              4
#define TIM_TIOS_IOS3_MASK              8
#define TIM_TIOS_IOS4_MASK              16
#define TIM_TIOS_IOS5_MASK              32
#define TIM_TIOS_IOS6_MASK              64
#define TIM_TIOS_IOS7_MASK              128


/*** TIM_CFORC - Timer Compare Force Register; 0x000003D1 ***/
typedef union {
  byte Byte;
  struct {
    byte FOC0        :1;                                       /* Force Output Compare Action for Channel 0 */
    byte FOC1        :1;                                       /* Force Output Compare Action for Channel 1 */
    byte FOC2        :1;                                       /* Force Output Compare Action for Channel 2 */
    byte FOC3        :1;                                       /* Force Output Compare Action for Channel 3 */
    byte FOC4        :1;                                       /* Force Output Compare Action for Channel 4 */
    byte FOC5        :1;                                       /* Force Output Compare Action for Channel 5 */
    byte FOC6        :1;                                       /* Force Output Compare Action for Channel 6 */
    byte FOC7        :1;                                       /* Force Output Compare Action for Channel 7 */
  } Bits;
} TIM_CFORCSTR;
extern volatile TIM_CFORCSTR _TIM_CFORC @(REG_BASE + 0x000003D1);
#define TIM_CFORC                       _TIM_CFORC.Byte
#define TIM_CFORC_FOC0                  _TIM_CFORC.Bits.FOC0
#define TIM_CFORC_FOC1                  _TIM_CFORC.Bits.FOC1
#define TIM_CFORC_FOC2                  _TIM_CFORC.Bits.FOC2
#define TIM_CFORC_FOC3                  _TIM_CFORC.Bits.FOC3
#define TIM_CFORC_FOC4                  _TIM_CFORC.Bits.FOC4
#define TIM_CFORC_FOC5                  _TIM_CFORC.Bits.FOC5
#define TIM_CFORC_FOC6                  _TIM_CFORC.Bits.FOC6
#define TIM_CFORC_FOC7                  _TIM_CFORC.Bits.FOC7

#define TIM_CFORC_FOC0_MASK             1
#define TIM_CFORC_FOC1_MASK             2
#define TIM_CFORC_FOC2_MASK             4
#define TIM_CFORC_FOC3_MASK             8
#define TIM_CFORC_FOC4_MASK             16
#define TIM_CFORC_FOC5_MASK             32
#define TIM_CFORC_FOC6_MASK             64
#define TIM_CFORC_FOC7_MASK             128


/*** TIM_OC7M - Output Compare 7 Mask Register; 0x000003D2 ***/
typedef union {
  byte Byte;
  struct {
    byte OC7M0       :1;                                       /* Output Compare 7 Mask Bit 0 */
    byte OC7M1       :1;                                       /* Output Compare 7 Mask Bit 1 */
    byte OC7M2       :1;                                       /* Output Compare 7 Mask Bit 2 */
    byte OC7M3       :1;                                       /* Output Compare 7 Mask Bit 3 */
    byte OC7M4       :1;                                       /* Output Compare 7 Mask Bit 4 */
    byte OC7M5       :1;                                       /* Output Compare 7 Mask Bit 5 */
    byte OC7M6       :1;                                       /* Output Compare 7 Mask Bit 6 */
    byte OC7M7       :1;                                       /* Output Compare 7 Mask Bit 7 */
  } Bits;
} TIM_OC7MSTR;
