Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
extern volatile TIM_OC7MSTR _TIM_OC7M @(REG_BASE + 0x000003D2);
#define TIM_OC7M                        _TIM_OC7M.Byte
#define TIM_OC7M_OC7M0                  _TIM_OC7M.Bits.OC7M0
#define TIM_OC7M_OC7M1                  _TIM_OC7M.Bits.OC7M1
#define TIM_OC7M_OC7M2                  _TIM_OC7M.Bits.OC7M2
#define TIM_OC7M_OC7M3                  _TIM_OC7M.Bits.OC7M3
#define TIM_OC7M_OC7M4                  _TIM_OC7M.Bits.OC7M4
#define TIM_OC7M_OC7M5                  _TIM_OC7M.Bits.OC7M5
#define TIM_OC7M_OC7M6                  _TIM_OC7M.Bits.OC7M6
#define TIM_OC7M_OC7M7                  _TIM_OC7M.Bits.OC7M7

#define TIM_OC7M_OC7M0_MASK             1
#define TIM_OC7M_OC7M1_MASK             2
#define TIM_OC7M_OC7M2_MASK             4
#define TIM_OC7M_OC7M3_MASK             8
#define TIM_OC7M_OC7M4_MASK             16
#define TIM_OC7M_OC7M5_MASK             32
#define TIM_OC7M_OC7M6_MASK             64
#define TIM_OC7M_OC7M7_MASK             128


/*** TIM_OC7D - Output Compare 7 Data Register; 0x000003D3 ***/
typedef union {
  byte Byte;
  struct {
    byte OC7D0       :1;                                       /* Output Compare 7 Bit 0 */
    byte OC7D1       :1;                                       /* Output Compare 7 Bit 1 */
    byte OC7D2       :1;                                       /* Output Compare 7 Bit 2 */
    byte OC7D3       :1;                                       /* Output Compare 7 Bit 3 */
    byte OC7D4       :1;                                       /* Output Compare 7 Bit 4 */
    byte OC7D5       :1;                                       /* Output Compare 7 Bit 5 */
    byte OC7D6       :1;                                       /* Output Compare 7 Bit 6 */
    byte OC7D7       :1;                                       /* Output Compare 7 Bit 7 */
  } Bits;
} TIM_OC7DSTR;
extern volatile TIM_OC7DSTR _TIM_OC7D @(REG_BASE + 0x000003D3);
#define TIM_OC7D                        _TIM_OC7D.Byte
#define TIM_OC7D_OC7D0                  _TIM_OC7D.Bits.OC7D0
#define TIM_OC7D_OC7D1                  _TIM_OC7D.Bits.OC7D1
#define TIM_OC7D_OC7D2                  _TIM_OC7D.Bits.OC7D2
#define TIM_OC7D_OC7D3                  _TIM_OC7D.Bits.OC7D3
#define TIM_OC7D_OC7D4                  _TIM_OC7D.Bits.OC7D4
#define TIM_OC7D_OC7D5                  _TIM_OC7D.Bits.OC7D5
#define TIM_OC7D_OC7D6                  _TIM_OC7D.Bits.OC7D6
#define TIM_OC7D_OC7D7                  _TIM_OC7D.Bits.OC7D7

#define TIM_OC7D_OC7D0_MASK             1
#define TIM_OC7D_OC7D1_MASK             2
#define TIM_OC7D_OC7D2_MASK             4
#define TIM_OC7D_OC7D3_MASK             8
#define TIM_OC7D_OC7D4_MASK             16
#define TIM_OC7D_OC7D5_MASK             32
#define TIM_OC7D_OC7D6_MASK             64
#define TIM_OC7D_OC7D7_MASK             128


/*** TIM_TCNT - Timer Count Register; 0x000003D4 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TCNTHi - Timer Count Register High; 0x000003D4 ***/
    union {
      byte Byte;
    } TIM_TCNTHiSTR;
    #define TIM_TCNTHi                  _TIM_TCNT.Overlap_STR.TIM_TCNTHiSTR.Byte
    

    /*** TIM_TCNTLo - Timer Count Register Low; 0x000003D5 ***/
    union {
      byte Byte;
    } TIM_TCNTLoSTR;
    #define TIM_TCNTLo                  _TIM_TCNT.Overlap_STR.TIM_TCNTLoSTR.Byte
    
  } Overlap_STR;

} TIM_TCNTSTR;
extern volatile TIM_TCNTSTR _TIM_TCNT @(REG_BASE + 0x000003D4);
#define TIM_TCNT                        _TIM_TCNT.Word


/*** TIM_TSCR1 - Timer System Control Register1; 0x000003D6 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PRNT        :1;                                       /* Precision Timer */
    byte TFFCA       :1;                                       /* Timer Fast Flag Clear All */
    byte TSFRZ       :1;                                       /* Timer and Modulus Counter Stop While in Freeze Mode */
    byte TSWAI       :1;                                       /* Timer Module Stops While in Wait */
    byte TEN         :1;                                       /* Timer Enable */
  } Bits;
} TIM_TSCR1STR;
extern volatile TIM_TSCR1STR _TIM_TSCR1 @(REG_BASE + 0x000003D6);
#define TIM_TSCR1                       _TIM_TSCR1.Byte
#define TIM_TSCR1_PRNT                  _TIM_TSCR1.Bits.PRNT
#define TIM_TSCR1_TFFCA                 _TIM_TSCR1.Bits.TFFCA
#define TIM_TSCR1_TSFRZ                 _TIM_TSCR1.Bits.TSFRZ
#define TIM_TSCR1_TSWAI                 _TIM_TSCR1.Bits.TSWAI
#define TIM_TSCR1_TEN                   _TIM_TSCR1.Bits.TEN

#define TIM_TSCR1_PRNT_MASK             8
#define TIM_TSCR1_TFFCA_MASK            16
#define TIM_TSCR1_TSFRZ_MASK            32
#define TIM_TSCR1_TSWAI_MASK            64
#define TIM_TSCR1_TEN_MASK              128


/*** TIM_TTOV - Timer Toggle On Overflow Register; 0x000003D7 ***/
typedef union {
  byte Byte;
  struct {
    byte TOV0        :1;                                       /* Toggle On Overflow Bit 0 */
    byte TOV1        :1;                                       /* Toggle On Overflow Bit 1 */
    byte TOV2        :1;                                       /* Toggle On Overflow Bit 2 */
    byte TOV3        :1;                                       /* Toggle On Overflow Bit 3 */
    byte TOV4        :1;                                       /* Toggle On Overflow Bit 4 */
    byte TOV5        :1;                                       /* Toggle On Overflow Bit 5 */
    byte TOV6        :1;                                       /* Toggle On Overflow Bit 6 */
    byte TOV7        :1;                                       /* Toggle On Overflow Bit 7 */
  } Bits;
} TIM_TTOVSTR;
extern volatile TIM_TTOVSTR _TIM_TTOV @(REG_BASE + 0x000003D7);
#define TIM_TTOV                        _TIM_TTOV.Byte
#define TIM_TTOV_TOV0                   _TIM_TTOV.Bits.TOV0
#define TIM_TTOV_TOV1                   _TIM_TTOV.Bits.TOV1
#define TIM_TTOV_TOV2                   _TIM_TTOV.Bits.TOV2
#define TIM_TTOV_TOV3                   _TIM_TTOV.Bits.TOV3
#define TIM_TTOV_TOV4                   _TIM_TTOV.Bits.TOV4
#define TIM_TTOV_TOV5                   _TIM_TTOV.Bits.TOV5
#define TIM_TTOV_TOV6                   _TIM_TTOV.Bits.TOV6
#define TIM_TTOV_TOV7                   _TIM_TTOV.Bits.TOV7

#define TIM_TTOV_TOV0_MASK              1
#define TIM_TTOV_TOV1_MASK              2
#define TIM_TTOV_TOV2_MASK              4
#define TIM_TTOV_TOV3_MASK              8
#define TIM_TTOV_TOV4_MASK              16
#define TIM_TTOV_TOV5_MASK              32
#define TIM_TTOV_TOV6_MASK              64
#define TIM_TTOV_TOV7_MASK              128


/*** TIM_TCTL1 - Timer Control Register 1; 0x000003D8 ***/
typedef union {
  byte Byte;
  struct {
    byte OL4         :1;                                       /* Output Level Bit 4 */
    byte OM4         :1;                                       /* Output Mode Bit 4 */
    byte OL5         :1;                                       /* Output Level Bit 5 */
    byte OM5         :1;                                       /* Output Mode Bit 5 */
    byte OL6         :1;                                       /* Output Level Bit 6 */
    byte OM6         :1;                                       /* Output Mode Bit 6 */
    byte OL7         :1;                                       /* Output Level Bit 7 */
    byte OM7         :1;                                       /* Output Mode Bit 7 */
  } Bits;
} TIM_TCTL1STR;
extern volatile TIM_TCTL1STR _TIM_TCTL1 @(REG_BASE + 0x000003D8);
#define TIM_TCTL1                       _TIM_TCTL1.Byte
#define TIM_TCTL1_OL4                   _TIM_TCTL1.Bits.OL4
#define TIM_TCTL1_OM4                   _TIM_TCTL1.Bits.OM4
#define TIM_TCTL1_OL5                   _TIM_TCTL1.Bits.OL5
#define TIM_TCTL1_OM5                   _TIM_TCTL1.Bits.OM5
#define TIM_TCTL1_OL6                   _TIM_TCTL1.Bits.OL6
#define TIM_TCTL1_OM6                   _TIM_TCTL1.Bits.OM6
#define TIM_TCTL1_OL7                   _TIM_TCTL1.Bits.OL7
#define TIM_TCTL1_OM7                   _TIM_TCTL1.Bits.OM7

#define TIM_TCTL1_OL4_MASK              1
#define TIM_TCTL1_OM4_MASK              2
#define TIM_TCTL1_OL5_MASK              4
#define TIM_TCTL1_OM5_MASK              8
#define TIM_TCTL1_OL6_MASK              16
#define TIM_TCTL1_OM6_MASK              32
#define TIM_TCTL1_OL7_MASK              64
#define TIM_TCTL1_OM7_MASK              128


/*** TIM_TCTL2 - Timer Control Register 2; 0x000003D9 ***/
typedef union {
  byte Byte;
  struct {
    byte OL0         :1;                                       /* Output Level Bit 0 */
    byte OM0         :1;                                       /* Output Mode Bit 0 */
    byte OL1         :1;                                       /* Output Lecel Bit 1 */
    byte OM1         :1;                                       /* Output Mode Bit 1 */
    byte OL2         :1;                                       /* Output Level Bit 2 */
    byte OM2         :1;                                       /* Output Mode Bit 2 */
    byte OL3         :1;                                       /* Output Level Bit 3 */
    byte OM3         :1;                                       /* Output Mode Bit 3 */
  } Bits;
} TIM_TCTL2STR;
extern volatile TIM_TCTL2STR _TIM_TCTL2 @(REG_BASE + 0x000003D9);
#define TIM_TCTL2                       _TIM_TCTL2.Byte
#define TIM_TCTL2_OL0                   _TIM_TCTL2.Bits.OL0
#define TIM_TCTL2_OM0                   _TIM_TCTL2.Bits.OM0
#define TIM_TCTL2_OL1                   _TIM_TCTL2.Bits.OL1
#define TIM_TCTL2_OM1                   _TIM_TCTL2.Bits.OM1
#define TIM_TCTL2_OL2                   _TIM_TCTL2.Bits.OL2
#define TIM_TCTL2_OM2                   _TIM_TCTL2.Bits.OM2
#define TIM_TCTL2_OL3                   _TIM_TCTL2.Bits.OL3
#define TIM_TCTL2_OM3                   _TIM_TCTL2.Bits.OM3

#define TIM_TCTL2_OL0_MASK              1
#define TIM_TCTL2_OM0_MASK              2
#define TIM_TCTL2_OL1_MASK              4
#define TIM_TCTL2_OM1_MASK              8
#define TIM_TCTL2_OL2_MASK              16
#define TIM_TCTL2_OM2_MASK              32
#define TIM_TCTL2_OL3_MASK              64
#define TIM_TCTL2_OM3_MASK              128


/*** TIM_TCTL3 - Timer Control Register 3; 0x000003DA ***/
typedef union {
  byte Byte;
  struct {
    byte EDG4A       :1;                                       /* Input Capture Edge Control 4A */
    byte EDG4B       :1;                                       /* Input Capture Edge Control 4B */
    byte EDG5A       :1;                                       /* Input Capture Edge Control 5A */
    byte EDG5B       :1;                                       /* Input Capture Edge Control 5B */
    byte EDG6A       :1;                                       /* Input Capture Edge Control 6A */
    byte EDG6B       :1;                                       /* Input Capture Edge Control 6B */
    byte EDG7A       :1;                                       /* Input Capture Edge Control 7A */
    byte EDG7B       :1;                                       /* Input Capture Edge Control 7B */
  } Bits;
  struct {
    byte grpEDG4x :2;
    byte grpEDG5x :2;
    byte grpEDG6x :2;
    byte grpEDG7x :2;
  } MergedBits;
} TIM_TCTL3STR;
extern volatile TIM_TCTL3STR _TIM_TCTL3 @(REG_BASE + 0x000003DA);
#define TIM_TCTL3                       _TIM_TCTL3.Byte
#define TIM_TCTL3_EDG4A                 _TIM_TCTL3.Bits.EDG4A
#define TIM_TCTL3_EDG4B                 _TIM_TCTL3.Bits.EDG4B
#define TIM_TCTL3_EDG5A                 _TIM_TCTL3.Bits.EDG5A
#define TIM_TCTL3_EDG5B                 _TIM_TCTL3.Bits.EDG5B
#define TIM_TCTL3_EDG6A                 _TIM_TCTL3.Bits.EDG6A
#define TIM_TCTL3_EDG6B                 _TIM_TCTL3.Bits.EDG6B
#define TIM_TCTL3_EDG7A                 _TIM_TCTL3.Bits.EDG7A
#define TIM_TCTL3_EDG7B                 _TIM_TCTL3.Bits.EDG7B
#define TIM_TCTL3_EDG4x                 _TIM_TCTL3.MergedBits.grpEDG4x
#define TIM_TCTL3_EDG5x                 _TIM_TCTL3.MergedBits.grpEDG5x
#define TIM_TCTL3_EDG6x                 _TIM_TCTL3.MergedBits.grpEDG6x
#define TIM_TCTL3_EDG7x                 _TIM_TCTL3.MergedBits.grpEDG7x

#define TIM_TCTL3_EDG4A_MASK            1
#define TIM_TCTL3_EDG4B_MASK            2
#define TIM_TCTL3_EDG5A_MASK            4
#define TIM_TCTL3_EDG5B_MASK            8
#define TIM_TCTL3_EDG6A_MASK            16
#define TIM_TCTL3_EDG6B_MASK            32
#define TIM_TCTL3_EDG7A_MASK            64
#define TIM_TCTL3_EDG7B_MASK            128
#define TIM_TCTL3_EDG4x_MASK            3
#define TIM_TCTL3_EDG4x_BITNUM          0
#define TIM_TCTL3_EDG5x_MASK            12
#define TIM_TCTL3_EDG5x_BITNUM          2
#define TIM_TCTL3_EDG6x_MASK            48
#define TIM_TCTL3_EDG6x_BITNUM          4
#define TIM_TCTL3_EDG7x_MASK            192
#define TIM_TCTL3_EDG7x_BITNUM          6


/*** TIM_TCTL4 - Timer Control Register 4; 0x000003DB ***/
typedef union {
  byte Byte;
  struct {
    byte EDG0A       :1;                                       /* Input Capture Edge Control 0A */
    byte EDG0B       :1;                                       /* Input Capture Edge Control 0B */
    byte EDG1A       :1;                                       /* Input Capture Edge Control 1A */
    byte EDG1B       :1;                                       /* Input Capture Edge Control 1B */
    byte EDG2A       :1;                                       /* Input Capture Edge Control 2A */
    byte EDG2B       :1;                                       /* Input Capture Edge Control 2B */
    byte EDG3A       :1;                                       /* Input Capture Edge Control 3A */
    byte EDG3B       :1;                                       /* Input Capture Edge Control 3B */
  } Bits;
  struct {
    byte grpEDG0x :2;
    byte grpEDG1x :2;
    byte grpEDG2x :2;
    byte grpEDG3x :2;
  } MergedBits;
} TIM_TCTL4STR;
