Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
extern volatile TIM_TCTL4STR _TIM_TCTL4 @(REG_BASE + 0x000003DB);
#define TIM_TCTL4                       _TIM_TCTL4.Byte
#define TIM_TCTL4_EDG0A                 _TIM_TCTL4.Bits.EDG0A
#define TIM_TCTL4_EDG0B                 _TIM_TCTL4.Bits.EDG0B
#define TIM_TCTL4_EDG1A                 _TIM_TCTL4.Bits.EDG1A
#define TIM_TCTL4_EDG1B                 _TIM_TCTL4.Bits.EDG1B
#define TIM_TCTL4_EDG2A                 _TIM_TCTL4.Bits.EDG2A
#define TIM_TCTL4_EDG2B                 _TIM_TCTL4.Bits.EDG2B
#define TIM_TCTL4_EDG3A                 _TIM_TCTL4.Bits.EDG3A
#define TIM_TCTL4_EDG3B                 _TIM_TCTL4.Bits.EDG3B
#define TIM_TCTL4_EDG0x                 _TIM_TCTL4.MergedBits.grpEDG0x
#define TIM_TCTL4_EDG1x                 _TIM_TCTL4.MergedBits.grpEDG1x
#define TIM_TCTL4_EDG2x                 _TIM_TCTL4.MergedBits.grpEDG2x
#define TIM_TCTL4_EDG3x                 _TIM_TCTL4.MergedBits.grpEDG3x

#define TIM_TCTL4_EDG0A_MASK            1
#define TIM_TCTL4_EDG0B_MASK            2
#define TIM_TCTL4_EDG1A_MASK            4
#define TIM_TCTL4_EDG1B_MASK            8
#define TIM_TCTL4_EDG2A_MASK            16
#define TIM_TCTL4_EDG2B_MASK            32
#define TIM_TCTL4_EDG3A_MASK            64
#define TIM_TCTL4_EDG3B_MASK            128
#define TIM_TCTL4_EDG0x_MASK            3
#define TIM_TCTL4_EDG0x_BITNUM          0
#define TIM_TCTL4_EDG1x_MASK            12
#define TIM_TCTL4_EDG1x_BITNUM          2
#define TIM_TCTL4_EDG2x_MASK            48
#define TIM_TCTL4_EDG2x_BITNUM          4
#define TIM_TCTL4_EDG3x_MASK            192
#define TIM_TCTL4_EDG3x_BITNUM          6


/*** TIM_TIE - Timer Interrupt Enable Register; 0x000003DC ***/
typedef union {
  byte Byte;
  struct {
    byte C0I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 0 */
    byte C1I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 1 */
    byte C2I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 2 */
    byte C3I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 3 */
    byte C4I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 4 */
    byte C5I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 5 */
    byte C6I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 6 */
    byte C7I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 7 */
  } Bits;
} TIM_TIESTR;
extern volatile TIM_TIESTR _TIM_TIE @(REG_BASE + 0x000003DC);
#define TIM_TIE                         _TIM_TIE.Byte
#define TIM_TIE_C0I                     _TIM_TIE.Bits.C0I
#define TIM_TIE_C1I                     _TIM_TIE.Bits.C1I
#define TIM_TIE_C2I                     _TIM_TIE.Bits.C2I
#define TIM_TIE_C3I                     _TIM_TIE.Bits.C3I
#define TIM_TIE_C4I                     _TIM_TIE.Bits.C4I
#define TIM_TIE_C5I                     _TIM_TIE.Bits.C5I
#define TIM_TIE_C6I                     _TIM_TIE.Bits.C6I
#define TIM_TIE_C7I                     _TIM_TIE.Bits.C7I

#define TIM_TIE_C0I_MASK                1
#define TIM_TIE_C1I_MASK                2
#define TIM_TIE_C2I_MASK                4
#define TIM_TIE_C3I_MASK                8
#define TIM_TIE_C4I_MASK                16
#define TIM_TIE_C5I_MASK                32
#define TIM_TIE_C6I_MASK                64
#define TIM_TIE_C7I_MASK                128


/*** TIM_TSCR2 - Timer System Control Register 2; 0x000003DD ***/
typedef union {
  byte Byte;
  struct {
    byte PR0         :1;                                       /* Timer Prescaler Select Bit 0 */
    byte PR1         :1;                                       /* Timer Prescaler Select Bit 1 */
    byte PR2         :1;                                       /* Timer Prescaler Select Bit 2 */
    byte TCRE        :1;                                       /* Timer Counter Reset Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte TOI         :1;                                       /* Timer Overflow Interrupt Enable */
  } Bits;
  struct {
    byte grpPR   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TIM_TSCR2STR;
extern volatile TIM_TSCR2STR _TIM_TSCR2 @(REG_BASE + 0x000003DD);
#define TIM_TSCR2                       _TIM_TSCR2.Byte
#define TIM_TSCR2_PR0                   _TIM_TSCR2.Bits.PR0
#define TIM_TSCR2_PR1                   _TIM_TSCR2.Bits.PR1
#define TIM_TSCR2_PR2                   _TIM_TSCR2.Bits.PR2
#define TIM_TSCR2_TCRE                  _TIM_TSCR2.Bits.TCRE
#define TIM_TSCR2_TOI                   _TIM_TSCR2.Bits.TOI
#define TIM_TSCR2_PR                    _TIM_TSCR2.MergedBits.grpPR

#define TIM_TSCR2_PR0_MASK              1
#define TIM_TSCR2_PR1_MASK              2
#define TIM_TSCR2_PR2_MASK              4
#define TIM_TSCR2_TCRE_MASK             8
#define TIM_TSCR2_TOI_MASK              128
#define TIM_TSCR2_PR_MASK               7
#define TIM_TSCR2_PR_BITNUM             0


/*** TIM_TFLG1 - Main Timer Interrupt Flag 1; 0x000003DE ***/
typedef union {
  byte Byte;
  struct {
    byte C0F         :1;                                       /* Input Capture/Output Compare Channel Flag 0 */
    byte C1F         :1;                                       /* Input Capture/Output Compare Channel Flag 1 */
    byte C2F         :1;                                       /* Input Capture/Output Compare Channel Flag 2 */
    byte C3F         :1;                                       /* Input Capture/Output Compare Channel Flag 3 */
    byte C4F         :1;                                       /* Input Capture/Output Compare Channel Flag 4 */
    byte C5F         :1;                                       /* Input Capture/Output Compare Channel Flag 5 */
    byte C6F         :1;                                       /* Input Capture/Output Compare Channel Flag 6 */
    byte C7F         :1;                                       /* Input Capture/Output Compare Channel Flag 7 */
  } Bits;
} TIM_TFLG1STR;
extern volatile TIM_TFLG1STR _TIM_TFLG1 @(REG_BASE + 0x000003DE);
#define TIM_TFLG1                       _TIM_TFLG1.Byte
#define TIM_TFLG1_C0F                   _TIM_TFLG1.Bits.C0F
#define TIM_TFLG1_C1F                   _TIM_TFLG1.Bits.C1F
#define TIM_TFLG1_C2F                   _TIM_TFLG1.Bits.C2F
#define TIM_TFLG1_C3F                   _TIM_TFLG1.Bits.C3F
#define TIM_TFLG1_C4F                   _TIM_TFLG1.Bits.C4F
#define TIM_TFLG1_C5F                   _TIM_TFLG1.Bits.C5F
#define TIM_TFLG1_C6F                   _TIM_TFLG1.Bits.C6F
#define TIM_TFLG1_C7F                   _TIM_TFLG1.Bits.C7F

#define TIM_TFLG1_C0F_MASK              1
#define TIM_TFLG1_C1F_MASK              2
#define TIM_TFLG1_C2F_MASK              4
#define TIM_TFLG1_C3F_MASK              8
#define TIM_TFLG1_C4F_MASK              16
#define TIM_TFLG1_C5F_MASK              32
#define TIM_TFLG1_C6F_MASK              64
#define TIM_TFLG1_C7F_MASK              128


