Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
/*** TIM_TFLG2 - Main Timer Interrupt Flag 2; 0x000003DF ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte TOF         :1;                                       /* Timer Overflow Flag */
  } Bits;
} TIM_TFLG2STR;
extern volatile TIM_TFLG2STR _TIM_TFLG2 @(REG_BASE + 0x000003DF);
#define TIM_TFLG2                       _TIM_TFLG2.Byte
#define TIM_TFLG2_TOF                   _TIM_TFLG2.Bits.TOF

#define TIM_TFLG2_TOF_MASK              128


/*** TIM_TC0 - Timer Input Capture/Output Compare Register 0; 0x000003E0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC0Hi - Timer Input Capture/Output Compare Register 0 High; 0x000003E0 ***/
    union {
      byte Byte;
    } TIM_TC0HiSTR;
    #define TIM_TC0Hi                   _TIM_TC0.Overlap_STR.TIM_TC0HiSTR.Byte
    

    /*** TIM_TC0Lo - Timer Input Capture/Output Compare Register 0 Low; 0x000003E1 ***/
    union {
      byte Byte;
    } TIM_TC0LoSTR;
    #define TIM_TC0Lo                   _TIM_TC0.Overlap_STR.TIM_TC0LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC0STR;
extern volatile TIM_TC0STR _TIM_TC0 @(REG_BASE + 0x000003E0);
#define TIM_TC0                         _TIM_TC0.Word
/* TIM_TC_ARR: Access 8 TIM_TCx registers in an array */
#define TIM_TC_ARR                      ((volatile word *) &TIM_TC0)


/*** TIM_TC1 - Timer Input Capture/Output Compare Register 1; 0x000003E2 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC1Hi - Timer Input Capture/Output Compare Register 1 High; 0x000003E2 ***/
    union {
      byte Byte;
    } TIM_TC1HiSTR;
    #define TIM_TC1Hi                   _TIM_TC1.Overlap_STR.TIM_TC1HiSTR.Byte
    

    /*** TIM_TC1Lo - Timer Input Capture/Output Compare Register 1 Low; 0x000003E3 ***/
    union {
      byte Byte;
    } TIM_TC1LoSTR;
    #define TIM_TC1Lo                   _TIM_TC1.Overlap_STR.TIM_TC1LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC1STR;
extern volatile TIM_TC1STR _TIM_TC1 @(REG_BASE + 0x000003E2);
#define TIM_TC1                         _TIM_TC1.Word


/*** TIM_TC2 - Timer Input Capture/Output Compare Register 2; 0x000003E4 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC2Hi - Timer Input Capture/Output Compare Register 2 High; 0x000003E4 ***/
    union {
      byte Byte;
    } TIM_TC2HiSTR;
    #define TIM_TC2Hi                   _TIM_TC2.Overlap_STR.TIM_TC2HiSTR.Byte
    

    /*** TIM_TC2Lo - Timer Input Capture/Output Compare Register 2 Low; 0x000003E5 ***/
    union {
      byte Byte;
    } TIM_TC2LoSTR;
    #define TIM_TC2Lo                   _TIM_TC2.Overlap_STR.TIM_TC2LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC2STR;
extern volatile TIM_TC2STR _TIM_TC2 @(REG_BASE + 0x000003E4);
#define TIM_TC2                         _TIM_TC2.Word


/*** TIM_TC3 - Timer Input Capture/Output Compare Register 3; 0x000003E6 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC3Hi - Timer Input Capture/Output Compare Register 3 High; 0x000003E6 ***/
    union {
      byte Byte;
    } TIM_TC3HiSTR;
    #define TIM_TC3Hi                   _TIM_TC3.Overlap_STR.TIM_TC3HiSTR.Byte
    

    /*** TIM_TC3Lo - Timer Input Capture/Output Compare Register 3 Low; 0x000003E7 ***/
    union {
      byte Byte;
    } TIM_TC3LoSTR;
    #define TIM_TC3Lo                   _TIM_TC3.Overlap_STR.TIM_TC3LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC3STR;
extern volatile TIM_TC3STR _TIM_TC3 @(REG_BASE + 0x000003E6);
#define TIM_TC3                         _TIM_TC3.Word


/*** TIM_TC4 - Timer Input Capture/Output Compare Register 4; 0x000003E8 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC4Hi - Timer Input Capture/Output Compare Register 4 High; 0x000003E8 ***/
    union {
      byte Byte;
    } TIM_TC4HiSTR;
    #define TIM_TC4Hi                   _TIM_TC4.Overlap_STR.TIM_TC4HiSTR.Byte
    

    /*** TIM_TC4Lo - Timer Input Capture/Output Compare Register 4 Low; 0x000003E9 ***/
    union {
      byte Byte;
    } TIM_TC4LoSTR;
    #define TIM_TC4Lo                   _TIM_TC4.Overlap_STR.TIM_TC4LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC4STR;
extern volatile TIM_TC4STR _TIM_TC4 @(REG_BASE + 0x000003E8);
#define TIM_TC4                         _TIM_TC4.Word


/*** TIM_TC5 - Timer Input Capture/Output Compare Register 5; 0x000003EA ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC5Hi - Timer Input Capture/Output Compare Register 5 High; 0x000003EA ***/
    union {
      byte Byte;
    } TIM_TC5HiSTR;
    #define TIM_TC5Hi                   _TIM_TC5.Overlap_STR.TIM_TC5HiSTR.Byte
    

    /*** TIM_TC5Lo - Timer Input Capture/Output Compare Register 5 Low; 0x000003EB ***/
    union {
      byte Byte;
    } TIM_TC5LoSTR;
    #define TIM_TC5Lo                   _TIM_TC5.Overlap_STR.TIM_TC5LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC5STR;
extern volatile TIM_TC5STR _TIM_TC5 @(REG_BASE + 0x000003EA);
#define TIM_TC5                         _TIM_TC5.Word


/*** TIM_TC6 - Timer Input Capture/Output Compare Register 6; 0x000003EC ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC6Hi - Timer Input Capture/Output Compare Register 6 High; 0x000003EC ***/
    union {
      byte Byte;
    } TIM_TC6HiSTR;
    #define TIM_TC6Hi                   _TIM_TC6.Overlap_STR.TIM_TC6HiSTR.Byte
    

    /*** TIM_TC6Lo - Timer Input Capture/Output Compare Register 6 Low; 0x000003ED ***/
    union {
      byte Byte;
    } TIM_TC6LoSTR;
    #define TIM_TC6Lo                   _TIM_TC6.Overlap_STR.TIM_TC6LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC6STR;
extern volatile TIM_TC6STR _TIM_TC6 @(REG_BASE + 0x000003EC);
#define TIM_TC6                         _TIM_TC6.Word


/*** TIM_TC7 - Timer Input Capture/Output Compare Register 7; 0x000003EE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC7Hi - Timer Input Capture/Output Compare Register 7 High; 0x000003EE ***/
    union {
      byte Byte;
    } TIM_TC7HiSTR;
    #define TIM_TC7Hi                   _TIM_TC7.Overlap_STR.TIM_TC7HiSTR.Byte
    

