Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
    /*** TIM_TC7Lo - Timer Input Capture/Output Compare Register 7 Low; 0x000003EF ***/
    union {
      byte Byte;
    } TIM_TC7LoSTR;
    #define TIM_TC7Lo                   _TIM_TC7.Overlap_STR.TIM_TC7LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC7STR;
extern volatile TIM_TC7STR _TIM_TC7 @(REG_BASE + 0x000003EE);
#define TIM_TC7                         _TIM_TC7.Word


/*** TIM_PACTL - 16-Bit Pulse Accumulator A Control Register; 0x000003F0 ***/
typedef union {
  byte Byte;
  struct {
    byte PAI         :1;                                       /* Pulse Accumulator Input Interrupt enable */
    byte PAOVI       :1;                                       /* Pulse Accumulator A Overflow Interrupt enable */
    byte CLK0        :1;                                       /* Clock Select Bit 0 */
    byte CLK1        :1;                                       /* Clock Select Bit 1 */
    byte PEDGE       :1;                                       /* Pulse Accumulator Edge Control */
    byte PAMOD       :1;                                       /* Pulse Accumulator Mode */
    byte PAEN        :1;                                       /* Pulse Accumulator A System Enable */
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpCLK  :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TIM_PACTLSTR;
extern volatile TIM_PACTLSTR _TIM_PACTL @(REG_BASE + 0x000003F0);
#define TIM_PACTL                       _TIM_PACTL.Byte
#define TIM_PACTL_PAI                   _TIM_PACTL.Bits.PAI
#define TIM_PACTL_PAOVI                 _TIM_PACTL.Bits.PAOVI
#define TIM_PACTL_CLK0                  _TIM_PACTL.Bits.CLK0
#define TIM_PACTL_CLK1                  _TIM_PACTL.Bits.CLK1
#define TIM_PACTL_PEDGE                 _TIM_PACTL.Bits.PEDGE
#define TIM_PACTL_PAMOD                 _TIM_PACTL.Bits.PAMOD
#define TIM_PACTL_PAEN                  _TIM_PACTL.Bits.PAEN
#define TIM_PACTL_CLK                   _TIM_PACTL.MergedBits.grpCLK

#define TIM_PACTL_PAI_MASK              1
#define TIM_PACTL_PAOVI_MASK            2
#define TIM_PACTL_CLK0_MASK             4
#define TIM_PACTL_CLK1_MASK             8
#define TIM_PACTL_PEDGE_MASK            16
#define TIM_PACTL_PAMOD_MASK            32
#define TIM_PACTL_PAEN_MASK             64
#define TIM_PACTL_CLK_MASK              12
#define TIM_PACTL_CLK_BITNUM            2


/*** TIM_PAFLG - Pulse Accumulator A Flag Register; 0x000003F1 ***/
typedef union {
  byte Byte;
  struct {
    byte PAIF        :1;                                       /* Pulse Accumulator Input edge Flag */
    byte PAOVF       :1;                                       /* Pulse Accumulator A Overflow Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} TIM_PAFLGSTR;
extern volatile TIM_PAFLGSTR _TIM_PAFLG @(REG_BASE + 0x000003F1);
#define TIM_PAFLG                       _TIM_PAFLG.Byte
#define TIM_PAFLG_PAIF                  _TIM_PAFLG.Bits.PAIF
#define TIM_PAFLG_PAOVF                 _TIM_PAFLG.Bits.PAOVF

#define TIM_PAFLG_PAIF_MASK             1
#define TIM_PAFLG_PAOVF_MASK            2


/*** TIM_PACNT - Pulse Accumulators Count Register; 0x000003F2 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_PACNTH - Pulse Accumulators Count Register High; 0x000003F2 ***/
    union {
      byte Byte;
    } TIM_PACNTHSTR;
    #define TIM_PACNTH                  _TIM_PACNT.Overlap_STR.TIM_PACNTHSTR.Byte
    

    /*** TIM_PACNTL - Pulse Accumulators Count Register Low; 0x000003F3 ***/
    union {
      byte Byte;
    } TIM_PACNTLSTR;
    #define TIM_PACNTL                  _TIM_PACNT.Overlap_STR.TIM_PACNTLSTR.Byte
    
  } Overlap_STR;

} TIM_PACNTSTR;
extern volatile TIM_PACNTSTR _TIM_PACNT @(REG_BASE + 0x000003F2);
#define TIM_PACNT                       _TIM_PACNT.Word


/*** TIM_OCPD - Output Compare Pin Disconnect Register; 0x000003FC ***/
typedef union {
  byte Byte;
  struct {
    byte OCPD0       :1;                                       /* Output Compare Pin Disconnect Bit 0 */
    byte OCPD1       :1;                                       /* Output Compare Pin Disconnect Bit 1 */
    byte OCPD2       :1;                                       /* Output Compare Pin Disconnect Bit 2 */
    byte OCPD3       :1;                                       /* Output Compare Pin Disconnect Bit 3 */
    byte OCPD4       :1;                                       /* Output Compare Pin Disconnect Bit 4 */
    byte OCPD5       :1;                                       /* Output Compare Pin Disconnect Bit 5 */
    byte OCPD6       :1;                                       /* Output Compare Pin Disconnect Bit 6 */
    byte OCPD7       :1;                                       /* Output Compare Pin Disconnect Bit 7 */
  } Bits;
} TIM_OCPDSTR;
extern volatile TIM_OCPDSTR _TIM_OCPD @(REG_BASE + 0x000003FC);
#define TIM_OCPD                        _TIM_OCPD.Byte
#define TIM_OCPD_OCPD0                  _TIM_OCPD.Bits.OCPD0
#define TIM_OCPD_OCPD1                  _TIM_OCPD.Bits.OCPD1
#define TIM_OCPD_OCPD2                  _TIM_OCPD.Bits.OCPD2
#define TIM_OCPD_OCPD3                  _TIM_OCPD.Bits.OCPD3
#define TIM_OCPD_OCPD4                  _TIM_OCPD.Bits.OCPD4
#define TIM_OCPD_OCPD5                  _TIM_OCPD.Bits.OCPD5
#define TIM_OCPD_OCPD6                  _TIM_OCPD.Bits.OCPD6
#define TIM_OCPD_OCPD7                  _TIM_OCPD.Bits.OCPD7

#define TIM_OCPD_OCPD0_MASK             1
#define TIM_OCPD_OCPD1_MASK             2
#define TIM_OCPD_OCPD2_MASK             4
#define TIM_OCPD_OCPD3_MASK             8
#define TIM_OCPD_OCPD4_MASK             16
#define TIM_OCPD_OCPD5_MASK             32
#define TIM_OCPD_OCPD6_MASK             64
#define TIM_OCPD_OCPD7_MASK             128


/*** TIM_PTPSR - Precision Timer Prescaler Select Register; 0x000003FE ***/
typedef union {
  byte Byte;
  struct {
    byte PTPS0       :1;                                       /* Precision Timer Prescaler Select Bit 0 */
    byte PTPS1       :1;                                       /* Precision Timer Prescaler Select Bit 1 */
    byte PTPS2       :1;                                       /* Precision Timer Prescaler Select Bit 2 */
    byte PTPS3       :1;                                       /* Precision Timer Prescaler Select Bit 3 */
    byte PTPS4       :1;                                       /* Precision Timer Prescaler Select Bit 4 */
    byte PTPS5       :1;                                       /* Precision Timer Prescaler Select Bit 5 */
    byte PTPS6       :1;                                       /* Precision Timer Prescaler Select Bit 6 */
    byte PTPS7       :1;                                       /* Precision Timer Prescaler Select Bit 7 */
  } Bits;
} TIM_PTPSRSTR;
