Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define PITLD7_PLD14_MASK                This_symb_has_been_depreciated
#define PITLD7_PLD15_MASK                This_symb_has_been_depreciated
#define PITCNT7_PCNT0                    This_symb_has_been_depreciated
#define PITCNT7_PCNT1                    This_symb_has_been_depreciated
#define PITCNT7_PCNT2                    This_symb_has_been_depreciated
#define PITCNT7_PCNT3                    This_symb_has_been_depreciated
#define PITCNT7_PCNT4                    This_symb_has_been_depreciated
#define PITCNT7_PCNT5                    This_symb_has_been_depreciated
#define PITCNT7_PCNT6                    This_symb_has_been_depreciated
#define PITCNT7_PCNT7                    This_symb_has_been_depreciated
#define PITCNT7_PCNT8                    This_symb_has_been_depreciated
#define PITCNT7_PCNT9                    This_symb_has_been_depreciated
#define PITCNT7_PCNT10                   This_symb_has_been_depreciated
#define PITCNT7_PCNT11                   This_symb_has_been_depreciated
#define PITCNT7_PCNT12                   This_symb_has_been_depreciated
#define PITCNT7_PCNT13                   This_symb_has_been_depreciated
#define PITCNT7_PCNT14                   This_symb_has_been_depreciated
#define PITCNT7_PCNT15                   This_symb_has_been_depreciated
#define PITCNT7_PCNT0_MASK               This_symb_has_been_depreciated
#define PITCNT7_PCNT1_MASK               This_symb_has_been_depreciated
#define PITCNT7_PCNT2_MASK               This_symb_has_been_depreciated
#define PITCNT7_PCNT3_MASK               This_symb_has_been_depreciated
#define PITCNT7_PCNT4_MASK               This_symb_has_been_depreciated
#define PITCNT7_PCNT5_MASK               This_symb_has_been_depreciated
#define PITCNT7_PCNT6_MASK               This_symb_has_been_depreciated
#define PITCNT7_PCNT7_MASK               This_symb_has_been_depreciated
#define PITCNT7_PCNT8_MASK               This_symb_has_been_depreciated
#define PITCNT7_PCNT9_MASK               This_symb_has_been_depreciated
#define PITCNT7_PCNT10_MASK              This_symb_has_been_depreciated
#define PITCNT7_PCNT11_MASK              This_symb_has_been_depreciated
#define PITCNT7_PCNT12_MASK              This_symb_has_been_depreciated
#define PITCNT7_PCNT13_MASK              This_symb_has_been_depreciated
#define PITCNT7_PCNT14_MASK              This_symb_has_been_depreciated
#define PITCNT7_PCNT15_MASK              This_symb_has_been_depreciated


/* **** 2.10.2007 15:13:55 */

#define VectorNumber_VReserved65         VectorNumber_Vhti
#define VectorNumber_Vflashfault         VectorNumber_Vflashfd
#define VectorNumber_Vtimpabovf          VectorNumber_Vectpabovf
#define VectorNumber_Vtimmdcu            VectorNumber_Vectmdcu
#define VReserved65                      Vhti      
#define Vflashfault                      Vflashfd  
#define Vtimpabovf                       Vectpabovf
#define Vtimmdcu                         Vectmdcu
#define ECT_PA3H_PA3H0                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H1                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H2                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H3                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H4                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H5                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H6                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H7                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H0_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H1_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H2_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H3_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H4_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H5_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H6_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H7_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H0                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H1                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H2                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H3                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H4                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H5                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H6                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H7                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H0_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H1_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H2_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H3_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H4_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H5_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H6_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H7_MASK              This_symb_has_been_depreciated
#define ECT_PA32H_PA2H0                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H1                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H2                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H3                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H4                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H5                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H6                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H7                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H0                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H1                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H2                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H3                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H4                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H5                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H6                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H7                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H                   This_symb_has_been_depreciated
#define ECT_PA32H_PA3H                   This_symb_has_been_depreciated
#define ECT_PA32H_PA2H0_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H1_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H2_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H3_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H4_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H5_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H6_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H7_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H0_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H1_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H2_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H3_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H4_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H5_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H6_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H7_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H_MASK              This_symb_has_been_depreciated
#define ECT_PA32H_PA2H_BITNUM            This_symb_has_been_depreciated
#define ECT_PA32H_PA3H_MASK              This_symb_has_been_depreciated
#define ECT_PA32H_PA3H_BITNUM            This_symb_has_been_depreciated
#define ECT_PA1H_PA1H0                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H1                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H2                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H3                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H4                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H5                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H6                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H7                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H0_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H1_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H2_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H3_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H4_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H5_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H6_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H7_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H0                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H1                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H2                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H3                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H4                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H5                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H6                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H7                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H0_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H1_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H2_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H3_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H4_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H5_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H6_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H7_MASK              This_symb_has_been_depreciated
#define ECT_PA10H_PA0H0                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H1                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H2                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H3                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H4                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H5                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H6                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H7                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H0                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H1                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H2                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H3                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H4                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H5                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H6                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H7                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H                   This_symb_has_been_depreciated
#define ECT_PA10H_PA1H                   This_symb_has_been_depreciated
#define ECT_PA10H_PA0H0_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H1_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H2_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H3_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H4_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H5_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H6_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H7_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H0_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H1_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H2_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H3_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H4_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H5_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H6_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H7_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H_MASK              This_symb_has_been_depreciated
#define ECT_PA10H_PA0H_BITNUM            This_symb_has_been_depreciated
#define ECT_PA10H_PA1H_MASK              This_symb_has_been_depreciated
#define ECT_PA10H_PA1H_BITNUM            This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC8                   This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC9                   This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC10                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC11                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC12                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC13                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC14                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC15                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC8_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC9_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC10_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC11_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC12_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC13_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC14_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC15_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC0                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC1                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC2                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC3                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC4                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC5                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC6                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC7                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC0_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC1_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC2_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC3_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC4_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC5_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC6_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC7_MASK              This_symb_has_been_depreciated
#define ECT_TC0H_TC0                     This_symb_has_been_depreciated
#define ECT_TC0H_TC1                     This_symb_has_been_depreciated
#define ECT_TC0H_TC2                     This_symb_has_been_depreciated
#define ECT_TC0H_TC3                     This_symb_has_been_depreciated
#define ECT_TC0H_TC4                     This_symb_has_been_depreciated
#define ECT_TC0H_TC5                     This_symb_has_been_depreciated
#define ECT_TC0H_TC6                     This_symb_has_been_depreciated
#define ECT_TC0H_TC7                     This_symb_has_been_depreciated
#define ECT_TC0H_TC8                     This_symb_has_been_depreciated
#define ECT_TC0H_TC9                     This_symb_has_been_depreciated
#define ECT_TC0H_TC10                    This_symb_has_been_depreciated
#define ECT_TC0H_TC11                    This_symb_has_been_depreciated
#define ECT_TC0H_TC12                    This_symb_has_been_depreciated
#define ECT_TC0H_TC13                    This_symb_has_been_depreciated
#define ECT_TC0H_TC14                    This_symb_has_been_depreciated
#define ECT_TC0H_TC15                    This_symb_has_been_depreciated
#define ECT_TC0H_TC0_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC1_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC2_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC3_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC4_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC5_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC6_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC7_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC8_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC9_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC10_MASK               This_symb_has_been_depreciated
#define ECT_TC0H_TC11_MASK               This_symb_has_been_depreciated
#define ECT_TC0H_TC12_MASK               This_symb_has_been_depreciated
#define ECT_TC0H_TC13_MASK               This_symb_has_been_depreciated
#define ECT_TC0H_TC14_MASK               This_symb_has_been_depreciated
#define ECT_TC0H_TC15_MASK               This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC8                   This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC9                   This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC10                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC11                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC12                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC13                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC14                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC15                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC8_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC9_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC10_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC11_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC12_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC13_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC14_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC15_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC0                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC1                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC2                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC3                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC4                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC5                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC6                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC7                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC0_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC1_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC2_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC3_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC4_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC5_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC6_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC7_MASK              This_symb_has_been_depreciated
#define ECT_TC1H_TC0                     This_symb_has_been_depreciated
#define ECT_TC1H_TC1                     This_symb_has_been_depreciated
#define ECT_TC1H_TC2                     This_symb_has_been_depreciated
#define ECT_TC1H_TC3                     This_symb_has_been_depreciated
#define ECT_TC1H_TC4                     This_symb_has_been_depreciated
#define ECT_TC1H_TC5                     This_symb_has_been_depreciated
#define ECT_TC1H_TC6                     This_symb_has_been_depreciated
#define ECT_TC1H_TC7                     This_symb_has_been_depreciated
#define ECT_TC1H_TC8                     This_symb_has_been_depreciated
#define ECT_TC1H_TC9                     This_symb_has_been_depreciated
#define ECT_TC1H_TC10                    This_symb_has_been_depreciated
#define ECT_TC1H_TC11                    This_symb_has_been_depreciated
#define ECT_TC1H_TC12                    This_symb_has_been_depreciated
#define ECT_TC1H_TC13                    This_symb_has_been_depreciated
#define ECT_TC1H_TC14                    This_symb_has_been_depreciated
#define ECT_TC1H_TC15                    This_symb_has_been_depreciated
#define ECT_TC1H_TC0_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC1_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC2_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC3_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC4_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC5_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC6_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC7_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC8_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC9_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC10_MASK               This_symb_has_been_depreciated
#define ECT_TC1H_TC11_MASK               This_symb_has_been_depreciated
#define ECT_TC1H_TC12_MASK               This_symb_has_been_depreciated
#define ECT_TC1H_TC13_MASK               This_symb_has_been_depreciated
#define ECT_TC1H_TC14_MASK               This_symb_has_been_depreciated
#define ECT_TC1H_TC15_MASK               This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC8                   This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC9                   This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC10                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC11                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC12                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC13                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC14                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC15                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC8_MASK              This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC9_MASK              This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC10_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC11_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC12_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC13_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC14_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC15_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC0                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC1                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC2                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC3                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC4                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC5                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC6                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC7                   This_symb_has_been_depreciated
