Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define CAN0RTSRH_TSR8_MASK              CAN0RXTSRH_TSR8_MASK
#define CAN0RTSRH_TSR9_MASK              CAN0RXTSRH_TSR9_MASK
#define CAN0RTSRH_TSR10_MASK             CAN0RXTSRH_TSR10_MASK
#define CAN0RTSRH_TSR11_MASK             CAN0RXTSRH_TSR11_MASK
#define CAN0RTSRH_TSR12_MASK             CAN0RXTSRH_TSR12_MASK
#define CAN0RTSRH_TSR13_MASK             CAN0RXTSRH_TSR13_MASK
#define CAN0RTSRH_TSR14_MASK             CAN0RXTSRH_TSR14_MASK
#define CAN0RTSRH_TSR15_MASK             CAN0RXTSRH_TSR15_MASK
#define CAN0RTSRL                        CAN0RXTSRL
#define CAN0RTSRL_TSR0                   CAN0RXTSRL_TSR0
#define CAN0RTSRL_TSR1                   CAN0RXTSRL_TSR1
#define CAN0RTSRL_TSR2                   CAN0RXTSRL_TSR2
#define CAN0RTSRL_TSR3                   CAN0RXTSRL_TSR3
#define CAN0RTSRL_TSR4                   CAN0RXTSRL_TSR4
#define CAN0RTSRL_TSR5                   CAN0RXTSRL_TSR5
#define CAN0RTSRL_TSR6                   CAN0RXTSRL_TSR6
#define CAN0RTSRL_TSR7                   CAN0RXTSRL_TSR7
#define CAN0RTSRL_TSR0_MASK              CAN0RXTSRL_TSR0_MASK
#define CAN0RTSRL_TSR1_MASK              CAN0RXTSRL_TSR1_MASK
#define CAN0RTSRL_TSR2_MASK              CAN0RXTSRL_TSR2_MASK
#define CAN0RTSRL_TSR3_MASK              CAN0RXTSRL_TSR3_MASK
#define CAN0RTSRL_TSR4_MASK              CAN0RXTSRL_TSR4_MASK
#define CAN0RTSRL_TSR5_MASK              CAN0RXTSRL_TSR5_MASK
#define CAN0RTSRL_TSR6_MASK              CAN0RXTSRL_TSR6_MASK
#define CAN0RTSRL_TSR7_MASK              CAN0RXTSRL_TSR7_MASK
#define CAN0RTSR                         CAN0RXTSR
#define CAN0RTSR_TSR0                    CAN0RXTSR_TSR0
#define CAN0RTSR_TSR1                    CAN0RXTSR_TSR1
#define CAN0RTSR_TSR2                    CAN0RXTSR_TSR2
#define CAN0RTSR_TSR3                    CAN0RXTSR_TSR3
#define CAN0RTSR_TSR4                    CAN0RXTSR_TSR4
#define CAN0RTSR_TSR5                    CAN0RXTSR_TSR5
#define CAN0RTSR_TSR6                    CAN0RXTSR_TSR6
#define CAN0RTSR_TSR7                    CAN0RXTSR_TSR7
#define CAN0RTSR_TSR8                    CAN0RXTSR_TSR8
#define CAN0RTSR_TSR9                    CAN0RXTSR_TSR9
#define CAN0RTSR_TSR10                   CAN0RXTSR_TSR10
#define CAN0RTSR_TSR11                   CAN0RXTSR_TSR11
#define CAN0RTSR_TSR12                   CAN0RXTSR_TSR12
#define CAN0RTSR_TSR13                   CAN0RXTSR_TSR13
#define CAN0RTSR_TSR14                   CAN0RXTSR_TSR14
#define CAN0RTSR_TSR15                   CAN0RXTSR_TSR15
#define CAN0RTSR_TSR0_MASK               CAN0RXTSR_TSR0_MASK
#define CAN0RTSR_TSR1_MASK               CAN0RXTSR_TSR1_MASK
#define CAN0RTSR_TSR2_MASK               CAN0RXTSR_TSR2_MASK
#define CAN0RTSR_TSR3_MASK               CAN0RXTSR_TSR3_MASK
#define CAN0RTSR_TSR4_MASK               CAN0RXTSR_TSR4_MASK
#define CAN0RTSR_TSR5_MASK               CAN0RXTSR_TSR5_MASK
#define CAN0RTSR_TSR6_MASK               CAN0RXTSR_TSR6_MASK
#define CAN0RTSR_TSR7_MASK               CAN0RXTSR_TSR7_MASK
#define CAN0RTSR_TSR8_MASK               CAN0RXTSR_TSR8_MASK
#define CAN0RTSR_TSR9_MASK               CAN0RXTSR_TSR9_MASK
#define CAN0RTSR_TSR10_MASK              CAN0RXTSR_TSR10_MASK
#define CAN0RTSR_TSR11_MASK              CAN0RXTSR_TSR11_MASK
#define CAN0RTSR_TSR12_MASK              CAN0RXTSR_TSR12_MASK
#define CAN0RTSR_TSR13_MASK              CAN0RXTSR_TSR13_MASK
#define CAN0RTSR_TSR14_MASK              CAN0RXTSR_TSR14_MASK
#define CAN0RTSR_TSR15_MASK              CAN0RXTSR_TSR15_MASK
#define CAN0TIDR0                        CAN0TXIDR0
#define CAN0TIDR0_ID21                   CAN0TXIDR0_ID21
#define CAN0TIDR0_ID22                   CAN0TXIDR0_ID22
#define CAN0TIDR0_ID23                   CAN0TXIDR0_ID23
#define CAN0TIDR0_ID24                   CAN0TXIDR0_ID24
#define CAN0TIDR0_ID25                   CAN0TXIDR0_ID25
#define CAN0TIDR0_ID26                   CAN0TXIDR0_ID26
#define CAN0TIDR0_ID27                   CAN0TXIDR0_ID27
#define CAN0TIDR0_ID28                   CAN0TXIDR0_ID28
#define CAN0TIDR_ARR                     CAN0TXIDR_ARR
#define CAN0TIDR0_ID21_MASK              CAN0TXIDR0_ID21_MASK
#define CAN0TIDR0_ID22_MASK              CAN0TXIDR0_ID22_MASK
#define CAN0TIDR0_ID23_MASK              CAN0TXIDR0_ID23_MASK
#define CAN0TIDR0_ID24_MASK              CAN0TXIDR0_ID24_MASK
#define CAN0TIDR0_ID25_MASK              CAN0TXIDR0_ID25_MASK
#define CAN0TIDR0_ID26_MASK              CAN0TXIDR0_ID26_MASK
#define CAN0TIDR0_ID27_MASK              CAN0TXIDR0_ID27_MASK
#define CAN0TIDR0_ID28_MASK              CAN0TXIDR0_ID28_MASK
#define CAN0TIDR1                        CAN0TXIDR1
#define CAN0TIDR1_ID15                   CAN0TXIDR1_ID15
#define CAN0TIDR1_ID16                   CAN0TXIDR1_ID16
#define CAN0TIDR1_ID17                   CAN0TXIDR1_ID17
#define CAN0TIDR1_IDE                    CAN0TXIDR1_IDE
#define CAN0TIDR1_SRR                    CAN0TXIDR1_SRR
#define CAN0TIDR1_ID18                   CAN0TXIDR1_ID18
#define CAN0TIDR1_ID19                   CAN0TXIDR1_ID19
#define CAN0TIDR1_ID20                   CAN0TXIDR1_ID20
#define CAN0TIDR1_ID_15                  CAN0TXIDR1_ID_15
#define CAN0TIDR1_ID_18                  CAN0TXIDR1_ID_18
#define CAN0TIDR1_ID                     CAN0TXIDR1_ID
#define CAN0TIDR1_ID15_MASK              CAN0TXIDR1_ID15_MASK
#define CAN0TIDR1_ID16_MASK              CAN0TXIDR1_ID16_MASK
#define CAN0TIDR1_ID17_MASK              CAN0TXIDR1_ID17_MASK
#define CAN0TIDR1_IDE_MASK               CAN0TXIDR1_IDE_MASK
#define CAN0TIDR1_SRR_MASK               CAN0TXIDR1_SRR_MASK
#define CAN0TIDR1_ID18_MASK              CAN0TXIDR1_ID18_MASK
#define CAN0TIDR1_ID19_MASK              CAN0TXIDR1_ID19_MASK
#define CAN0TIDR1_ID20_MASK              CAN0TXIDR1_ID20_MASK
#define CAN0TIDR1_ID_15_MASK             CAN0TXIDR1_ID_15_MASK
#define CAN0TIDR1_ID_15_BITNUM           CAN0TXIDR1_ID_15_BITNUM
#define CAN0TIDR1_ID_18_MASK             CAN0TXIDR1_ID_18_MASK
#define CAN0TIDR1_ID_18_BITNUM           CAN0TXIDR1_ID_18_BITNUM
#define CAN0TIDR2                        CAN0TXIDR2
#define CAN0TIDR2_ID7                    CAN0TXIDR2_ID7
#define CAN0TIDR2_ID8                    CAN0TXIDR2_ID8
#define CAN0TIDR2_ID9                    CAN0TXIDR2_ID9
#define CAN0TIDR2_ID10                   CAN0TXIDR2_ID10
#define CAN0TIDR2_ID11                   CAN0TXIDR2_ID11
#define CAN0TIDR2_ID12                   CAN0TXIDR2_ID12
#define CAN0TIDR2_ID13                   CAN0TXIDR2_ID13
#define CAN0TIDR2_ID14                   CAN0TXIDR2_ID14
#define CAN0TIDR2_ID7_MASK               CAN0TXIDR2_ID7_MASK
#define CAN0TIDR2_ID8_MASK               CAN0TXIDR2_ID8_MASK
#define CAN0TIDR2_ID9_MASK               CAN0TXIDR2_ID9_MASK
#define CAN0TIDR2_ID10_MASK              CAN0TXIDR2_ID10_MASK
#define CAN0TIDR2_ID11_MASK              CAN0TXIDR2_ID11_MASK
#define CAN0TIDR2_ID12_MASK              CAN0TXIDR2_ID12_MASK
#define CAN0TIDR2_ID13_MASK              CAN0TXIDR2_ID13_MASK
#define CAN0TIDR2_ID14_MASK              CAN0TXIDR2_ID14_MASK
#define CAN0TIDR3                        CAN0TXIDR3
#define CAN0TIDR3_RTR                    CAN0TXIDR3_RTR
#define CAN0TIDR3_ID0                    CAN0TXIDR3_ID0
#define CAN0TIDR3_ID1                    CAN0TXIDR3_ID1
#define CAN0TIDR3_ID2                    CAN0TXIDR3_ID2
#define CAN0TIDR3_ID3                    CAN0TXIDR3_ID3
#define CAN0TIDR3_ID4                    CAN0TXIDR3_ID4
#define CAN0TIDR3_ID5                    CAN0TXIDR3_ID5
#define CAN0TIDR3_ID6                    CAN0TXIDR3_ID6
#define CAN0TIDR3_ID                     CAN0TXIDR3_ID
#define CAN0TIDR3_RTR_MASK               CAN0TXIDR3_RTR_MASK
#define CAN0TIDR3_ID0_MASK               CAN0TXIDR3_ID0_MASK
#define CAN0TIDR3_ID1_MASK               CAN0TXIDR3_ID1_MASK
#define CAN0TIDR3_ID2_MASK               CAN0TXIDR3_ID2_MASK
#define CAN0TIDR3_ID3_MASK               CAN0TXIDR3_ID3_MASK
#define CAN0TIDR3_ID4_MASK               CAN0TXIDR3_ID4_MASK
#define CAN0TIDR3_ID5_MASK               CAN0TXIDR3_ID5_MASK
#define CAN0TIDR3_ID6_MASK               CAN0TXIDR3_ID6_MASK
#define CAN0TIDR3_ID_MASK                CAN0TXIDR3_ID_MASK
#define CAN0TIDR3_ID_BITNUM              CAN0TXIDR3_ID_BITNUM
#define CAN0TDSR0                        CAN0TXDSR0
#define CAN0TDSR0_DB0                    CAN0TXDSR0_DB0
#define CAN0TDSR0_DB1                    CAN0TXDSR0_DB1
#define CAN0TDSR0_DB2                    CAN0TXDSR0_DB2
#define CAN0TDSR0_DB3                    CAN0TXDSR0_DB3
#define CAN0TDSR0_DB4                    CAN0TXDSR0_DB4
#define CAN0TDSR0_DB5                    CAN0TXDSR0_DB5
#define CAN0TDSR0_DB6                    CAN0TXDSR0_DB6
#define CAN0TDSR0_DB7                    CAN0TXDSR0_DB7
#define CAN0TDSR_ARR                     CAN0TXDSR_ARR
#define CAN0TDSR0_DB0_MASK               CAN0TXDSR0_DB0_MASK
#define CAN0TDSR0_DB1_MASK               CAN0TXDSR0_DB1_MASK
#define CAN0TDSR0_DB2_MASK               CAN0TXDSR0_DB2_MASK
#define CAN0TDSR0_DB3_MASK               CAN0TXDSR0_DB3_MASK
#define CAN0TDSR0_DB4_MASK               CAN0TXDSR0_DB4_MASK
#define CAN0TDSR0_DB5_MASK               CAN0TXDSR0_DB5_MASK
#define CAN0TDSR0_DB6_MASK               CAN0TXDSR0_DB6_MASK
#define CAN0TDSR0_DB7_MASK               CAN0TXDSR0_DB7_MASK
#define CAN0TDSR1                        CAN0TXDSR1
#define CAN0TDSR1_DB0                    CAN0TXDSR1_DB0
#define CAN0TDSR1_DB1                    CAN0TXDSR1_DB1
#define CAN0TDSR1_DB2                    CAN0TXDSR1_DB2
#define CAN0TDSR1_DB3                    CAN0TXDSR1_DB3
#define CAN0TDSR1_DB4                    CAN0TXDSR1_DB4
#define CAN0TDSR1_DB5                    CAN0TXDSR1_DB5
#define CAN0TDSR1_DB6                    CAN0TXDSR1_DB6
#define CAN0TDSR1_DB7                    CAN0TXDSR1_DB7
#define CAN0TDSR1_DB0_MASK               CAN0TXDSR1_DB0_MASK
#define CAN0TDSR1_DB1_MASK               CAN0TXDSR1_DB1_MASK
#define CAN0TDSR1_DB2_MASK               CAN0TXDSR1_DB2_MASK
#define CAN0TDSR1_DB3_MASK               CAN0TXDSR1_DB3_MASK
#define CAN0TDSR1_DB4_MASK               CAN0TXDSR1_DB4_MASK
#define CAN0TDSR1_DB5_MASK               CAN0TXDSR1_DB5_MASK
#define CAN0TDSR1_DB6_MASK               CAN0TXDSR1_DB6_MASK
#define CAN0TDSR1_DB7_MASK               CAN0TXDSR1_DB7_MASK
#define CAN0TDSR2                        CAN0TXDSR2
#define CAN0TDSR2_DB0                    CAN0TXDSR2_DB0
#define CAN0TDSR2_DB1                    CAN0TXDSR2_DB1
#define CAN0TDSR2_DB2                    CAN0TXDSR2_DB2
#define CAN0TDSR2_DB3                    CAN0TXDSR2_DB3
#define CAN0TDSR2_DB4                    CAN0TXDSR2_DB4
#define CAN0TDSR2_DB5                    CAN0TXDSR2_DB5
#define CAN0TDSR2_DB6                    CAN0TXDSR2_DB6
#define CAN0TDSR2_DB7                    CAN0TXDSR2_DB7
#define CAN0TDSR2_DB0_MASK               CAN0TXDSR2_DB0_MASK
#define CAN0TDSR2_DB1_MASK               CAN0TXDSR2_DB1_MASK
#define CAN0TDSR2_DB2_MASK               CAN0TXDSR2_DB2_MASK
#define CAN0TDSR2_DB3_MASK               CAN0TXDSR2_DB3_MASK
#define CAN0TDSR2_DB4_MASK               CAN0TXDSR2_DB4_MASK
#define CAN0TDSR2_DB5_MASK               CAN0TXDSR2_DB5_MASK
#define CAN0TDSR2_DB6_MASK               CAN0TXDSR2_DB6_MASK
#define CAN0TDSR2_DB7_MASK               CAN0TXDSR2_DB7_MASK
#define CAN0TDSR3                        CAN0TXDSR3
#define CAN0TDSR3_DB0                    CAN0TXDSR3_DB0
#define CAN0TDSR3_DB1                    CAN0TXDSR3_DB1
#define CAN0TDSR3_DB2                    CAN0TXDSR3_DB2
#define CAN0TDSR3_DB3                    CAN0TXDSR3_DB3
#define CAN0TDSR3_DB4                    CAN0TXDSR3_DB4
#define CAN0TDSR3_DB5                    CAN0TXDSR3_DB5
#define CAN0TDSR3_DB6                    CAN0TXDSR3_DB6
#define CAN0TDSR3_DB7                    CAN0TXDSR3_DB7
#define CAN0TDSR3_DB0_MASK               CAN0TXDSR3_DB0_MASK
#define CAN0TDSR3_DB1_MASK               CAN0TXDSR3_DB1_MASK
#define CAN0TDSR3_DB2_MASK               CAN0TXDSR3_DB2_MASK
#define CAN0TDSR3_DB3_MASK               CAN0TXDSR3_DB3_MASK
#define CAN0TDSR3_DB4_MASK               CAN0TXDSR3_DB4_MASK
#define CAN0TDSR3_DB5_MASK               CAN0TXDSR3_DB5_MASK
#define CAN0TDSR3_DB6_MASK               CAN0TXDSR3_DB6_MASK
#define CAN0TDSR3_DB7_MASK               CAN0TXDSR3_DB7_MASK
#define CAN0TDSR4                        CAN0TXDSR4
#define CAN0TDSR4_DB0                    CAN0TXDSR4_DB0
#define CAN0TDSR4_DB1                    CAN0TXDSR4_DB1
#define CAN0TDSR4_DB2                    CAN0TXDSR4_DB2
#define CAN0TDSR4_DB3                    CAN0TXDSR4_DB3
#define CAN0TDSR4_DB4                    CAN0TXDSR4_DB4
#define CAN0TDSR4_DB5                    CAN0TXDSR4_DB5
#define CAN0TDSR4_DB6                    CAN0TXDSR4_DB6
#define CAN0TDSR4_DB7                    CAN0TXDSR4_DB7
#define CAN0TDSR4_DB0_MASK               CAN0TXDSR4_DB0_MASK
#define CAN0TDSR4_DB1_MASK               CAN0TXDSR4_DB1_MASK
#define CAN0TDSR4_DB2_MASK               CAN0TXDSR4_DB2_MASK
#define CAN0TDSR4_DB3_MASK               CAN0TXDSR4_DB3_MASK
#define CAN0TDSR4_DB4_MASK               CAN0TXDSR4_DB4_MASK
#define CAN0TDSR4_DB5_MASK               CAN0TXDSR4_DB5_MASK
#define CAN0TDSR4_DB6_MASK               CAN0TXDSR4_DB6_MASK
#define CAN0TDSR4_DB7_MASK               CAN0TXDSR4_DB7_MASK
#define CAN0TDSR5                        CAN0TXDSR5
#define CAN0TDSR5_DB0                    CAN0TXDSR5_DB0
#define CAN0TDSR5_DB1                    CAN0TXDSR5_DB1
#define CAN0TDSR5_DB2                    CAN0TXDSR5_DB2
#define CAN0TDSR5_DB3                    CAN0TXDSR5_DB3
#define CAN0TDSR5_DB4                    CAN0TXDSR5_DB4
#define CAN0TDSR5_DB5                    CAN0TXDSR5_DB5
#define CAN0TDSR5_DB6                    CAN0TXDSR5_DB6
#define CAN0TDSR5_DB7                    CAN0TXDSR5_DB7
#define CAN0TDSR5_DB0_MASK               CAN0TXDSR5_DB0_MASK
#define CAN0TDSR5_DB1_MASK               CAN0TXDSR5_DB1_MASK
#define CAN0TDSR5_DB2_MASK               CAN0TXDSR5_DB2_MASK
#define CAN0TDSR5_DB3_MASK               CAN0TXDSR5_DB3_MASK
#define CAN0TDSR5_DB4_MASK               CAN0TXDSR5_DB4_MASK
#define CAN0TDSR5_DB5_MASK               CAN0TXDSR5_DB5_MASK
#define CAN0TDSR5_DB6_MASK               CAN0TXDSR5_DB6_MASK
#define CAN0TDSR5_DB7_MASK               CAN0TXDSR5_DB7_MASK
#define CAN0TDSR6                        CAN0TXDSR6
#define CAN0TDSR6_DB0                    CAN0TXDSR6_DB0
#define CAN0TDSR6_DB1                    CAN0TXDSR6_DB1
#define CAN0TDSR6_DB2                    CAN0TXDSR6_DB2
#define CAN0TDSR6_DB3                    CAN0TXDSR6_DB3
#define CAN0TDSR6_DB4                    CAN0TXDSR6_DB4
#define CAN0TDSR6_DB5                    CAN0TXDSR6_DB5
#define CAN0TDSR6_DB6                    CAN0TXDSR6_DB6
#define CAN0TDSR6_DB7                    CAN0TXDSR6_DB7
#define CAN0TDSR6_DB0_MASK               CAN0TXDSR6_DB0_MASK
#define CAN0TDSR6_DB1_MASK               CAN0TXDSR6_DB1_MASK
#define CAN0TDSR6_DB2_MASK               CAN0TXDSR6_DB2_MASK
#define CAN0TDSR6_DB3_MASK               CAN0TXDSR6_DB3_MASK
#define CAN0TDSR6_DB4_MASK               CAN0TXDSR6_DB4_MASK
#define CAN0TDSR6_DB5_MASK               CAN0TXDSR6_DB5_MASK
#define CAN0TDSR6_DB6_MASK               CAN0TXDSR6_DB6_MASK
#define CAN0TDSR6_DB7_MASK               CAN0TXDSR6_DB7_MASK
#define CAN0TDSR7                        CAN0TXDSR7
#define CAN0TDSR7_DB0                    CAN0TXDSR7_DB0
#define CAN0TDSR7_DB1                    CAN0TXDSR7_DB1
#define CAN0TDSR7_DB2                    CAN0TXDSR7_DB2
#define CAN0TDSR7_DB3                    CAN0TXDSR7_DB3
#define CAN0TDSR7_DB4                    CAN0TXDSR7_DB4
#define CAN0TDSR7_DB5                    CAN0TXDSR7_DB5
#define CAN0TDSR7_DB6                    CAN0TXDSR7_DB6
#define CAN0TDSR7_DB7                    CAN0TXDSR7_DB7
#define CAN0TDSR7_DB0_MASK               CAN0TXDSR7_DB0_MASK
#define CAN0TDSR7_DB1_MASK               CAN0TXDSR7_DB1_MASK
#define CAN0TDSR7_DB2_MASK               CAN0TXDSR7_DB2_MASK
#define CAN0TDSR7_DB3_MASK               CAN0TXDSR7_DB3_MASK
#define CAN0TDSR7_DB4_MASK               CAN0TXDSR7_DB4_MASK
#define CAN0TDSR7_DB5_MASK               CAN0TXDSR7_DB5_MASK
#define CAN0TDSR7_DB6_MASK               CAN0TXDSR7_DB6_MASK
#define CAN0TDSR7_DB7_MASK               CAN0TXDSR7_DB7_MASK
#define CAN0TDLR                         CAN0TXDLR
#define CAN0TDLR_DLC0                    CAN0TXDLR_DLC0
#define CAN0TDLR_DLC1                    CAN0TXDLR_DLC1
#define CAN0TDLR_DLC2                    CAN0TXDLR_DLC2
#define CAN0TDLR_DLC3                    CAN0TXDLR_DLC3
#define CAN0TDLR_DLC                     CAN0TXDLR_DLC
#define CAN0TDLR_DLC0_MASK               CAN0TXDLR_DLC0_MASK
#define CAN0TDLR_DLC1_MASK               CAN0TXDLR_DLC1_MASK
#define CAN0TDLR_DLC2_MASK               CAN0TXDLR_DLC2_MASK
#define CAN0TDLR_DLC3_MASK               CAN0TXDLR_DLC3_MASK
#define CAN0TDLR_DLC_MASK                CAN0TXDLR_DLC_MASK
#define CAN0TDLR_DLC_BITNUM              CAN0TXDLR_DLC_BITNUM
#define CAN0TTBPR                        CAN0TXTBPR
#define CAN0TTBPR_PRIO0                  CAN0TXTBPR_PRIO0
#define CAN0TTBPR_PRIO1                  CAN0TXTBPR_PRIO1
#define CAN0TTBPR_PRIO2                  CAN0TXTBPR_PRIO2
#define CAN0TTBPR_PRIO3                  CAN0TXTBPR_PRIO3
#define CAN0TTBPR_PRIO4                  CAN0TXTBPR_PRIO4
#define CAN0TTBPR_PRIO5                  CAN0TXTBPR_PRIO5
#define CAN0TTBPR_PRIO6                  CAN0TXTBPR_PRIO6
#define CAN0TTBPR_PRIO7                  CAN0TXTBPR_PRIO7
#define CAN0TTBPR_PRIO0_MASK             CAN0TXTBPR_PRIO0_MASK
#define CAN0TTBPR_PRIO1_MASK             CAN0TXTBPR_PRIO1_MASK
#define CAN0TTBPR_PRIO2_MASK             CAN0TXTBPR_PRIO2_MASK
#define CAN0TTBPR_PRIO3_MASK             CAN0TXTBPR_PRIO3_MASK
#define CAN0TTBPR_PRIO4_MASK             CAN0TXTBPR_PRIO4_MASK
#define CAN0TTBPR_PRIO5_MASK             CAN0TXTBPR_PRIO5_MASK
#define CAN0TTBPR_PRIO6_MASK             CAN0TXTBPR_PRIO6_MASK
#define CAN0TTBPR_PRIO7_MASK             CAN0TXTBPR_PRIO7_MASK
#define CAN0TTSRH                        CAN0TXTSRH
#define CAN0TTSRH_TSR8                   CAN0TXTSRH_TSR8
#define CAN0TTSRH_TSR9                   CAN0TXTSRH_TSR9
#define CAN0TTSRH_TSR10                  CAN0TXTSRH_TSR10
#define CAN0TTSRH_TSR11                  CAN0TXTSRH_TSR11
#define CAN0TTSRH_TSR12                  CAN0TXTSRH_TSR12
#define CAN0TTSRH_TSR13                  CAN0TXTSRH_TSR13
#define CAN0TTSRH_TSR14                  CAN0TXTSRH_TSR14
#define CAN0TTSRH_TSR15                  CAN0TXTSRH_TSR15
#define CAN0TTSRH_TSR8_MASK              CAN0TXTSRH_TSR8_MASK
#define CAN0TTSRH_TSR9_MASK              CAN0TXTSRH_TSR9_MASK
#define CAN0TTSRH_TSR10_MASK             CAN0TXTSRH_TSR10_MASK
#define CAN0TTSRH_TSR11_MASK             CAN0TXTSRH_TSR11_MASK
#define CAN0TTSRH_TSR12_MASK             CAN0TXTSRH_TSR12_MASK
#define CAN0TTSRH_TSR13_MASK             CAN0TXTSRH_TSR13_MASK
#define CAN0TTSRH_TSR14_MASK             CAN0TXTSRH_TSR14_MASK
#define CAN0TTSRH_TSR15_MASK             CAN0TXTSRH_TSR15_MASK
#define CAN0TTSRL                        CAN0TXTSRL
#define CAN0TTSRL_TSR0                   CAN0TXTSRL_TSR0
#define CAN0TTSRL_TSR1                   CAN0TXTSRL_TSR1
#define CAN0TTSRL_TSR2                   CAN0TXTSRL_TSR2
#define CAN0TTSRL_TSR3                   CAN0TXTSRL_TSR3
#define CAN0TTSRL_TSR4                   CAN0TXTSRL_TSR4
#define CAN0TTSRL_TSR5                   CAN0TXTSRL_TSR5
#define CAN0TTSRL_TSR6                   CAN0TXTSRL_TSR6
#define CAN0TTSRL_TSR7                   CAN0TXTSRL_TSR7
#define CAN0TTSRL_TSR0_MASK              CAN0TXTSRL_TSR0_MASK
#define CAN0TTSRL_TSR1_MASK              CAN0TXTSRL_TSR1_MASK
#define CAN0TTSRL_TSR2_MASK              CAN0TXTSRL_TSR2_MASK
#define CAN0TTSRL_TSR3_MASK              CAN0TXTSRL_TSR3_MASK
#define CAN0TTSRL_TSR4_MASK              CAN0TXTSRL_TSR4_MASK
#define CAN0TTSRL_TSR5_MASK              CAN0TXTSRL_TSR5_MASK
#define CAN0TTSRL_TSR6_MASK              CAN0TXTSRL_TSR6_MASK
#define CAN0TTSRL_TSR7_MASK              CAN0TXTSRL_TSR7_MASK
#define CAN0TTSR                         CAN0TXTSR
#define CAN0TTSR_TSR0                    CAN0TXTSR_TSR0
#define CAN0TTSR_TSR1                    CAN0TXTSR_TSR1
#define CAN0TTSR_TSR2                    CAN0TXTSR_TSR2
#define CAN0TTSR_TSR3                    CAN0TXTSR_TSR3
#define CAN0TTSR_TSR4                    CAN0TXTSR_TSR4
#define CAN0TTSR_TSR5                    CAN0TXTSR_TSR5
#define CAN0TTSR_TSR6                    CAN0TXTSR_TSR6
#define CAN0TTSR_TSR7                    CAN0TXTSR_TSR7
#define CAN0TTSR_TSR8                    CAN0TXTSR_TSR8
#define CAN0TTSR_TSR9                    CAN0TXTSR_TSR9
#define CAN0TTSR_TSR10                   CAN0TXTSR_TSR10
#define CAN0TTSR_TSR11                   CAN0TXTSR_TSR11
#define CAN0TTSR_TSR12                   CAN0TXTSR_TSR12
#define CAN0TTSR_TSR13                   CAN0TXTSR_TSR13
#define CAN0TTSR_TSR14                   CAN0TXTSR_TSR14
#define CAN0TTSR_TSR15                   CAN0TXTSR_TSR15
#define CAN0TTSR_TSR0_MASK               CAN0TXTSR_TSR0_MASK
#define CAN0TTSR_TSR1_MASK               CAN0TXTSR_TSR1_MASK
#define CAN0TTSR_TSR2_MASK               CAN0TXTSR_TSR2_MASK
#define CAN0TTSR_TSR3_MASK               CAN0TXTSR_TSR3_MASK
#define CAN0TTSR_TSR4_MASK               CAN0TXTSR_TSR4_MASK
#define CAN0TTSR_TSR5_MASK               CAN0TXTSR_TSR5_MASK
#define CAN0TTSR_TSR6_MASK               CAN0TXTSR_TSR6_MASK
#define CAN0TTSR_TSR7_MASK               CAN0TXTSR_TSR7_MASK
#define CAN0TTSR_TSR8_MASK               CAN0TXTSR_TSR8_MASK
#define CAN0TTSR_TSR9_MASK               CAN0TXTSR_TSR9_MASK
#define CAN0TTSR_TSR10_MASK              CAN0TXTSR_TSR10_MASK
#define CAN0TTSR_TSR11_MASK              CAN0TXTSR_TSR11_MASK
#define CAN0TTSR_TSR12_MASK              CAN0TXTSR_TSR12_MASK
#define CAN0TTSR_TSR13_MASK              CAN0TXTSR_TSR13_MASK
#define CAN0TTSR_TSR14_MASK              CAN0TXTSR_TSR14_MASK
#define CAN0TTSR_TSR15_MASK              CAN0TXTSR_TSR15_MASK
#define CAN1RIDR0                        CAN1RXIDR0
#define CAN1RIDR0_ID21                   CAN1RXIDR0_ID21
#define CAN1RIDR0_ID22                   CAN1RXIDR0_ID22
#define CAN1RIDR0_ID23                   CAN1RXIDR0_ID23
#define CAN1RIDR0_ID24                   CAN1RXIDR0_ID24
#define CAN1RIDR0_ID25                   CAN1RXIDR0_ID25
#define CAN1RIDR0_ID26                   CAN1RXIDR0_ID26
#define CAN1RIDR0_ID27                   CAN1RXIDR0_ID27
#define CAN1RIDR0_ID28                   CAN1RXIDR0_ID28
#define CAN1RIDR_ARR                     CAN1RXIDR_ARR
#define CAN1RIDR0_ID21_MASK              CAN1RXIDR0_ID21_MASK
#define CAN1RIDR0_ID22_MASK              CAN1RXIDR0_ID22_MASK
#define CAN1RIDR0_ID23_MASK              CAN1RXIDR0_ID23_MASK
#define CAN1RIDR0_ID24_MASK              CAN1RXIDR0_ID24_MASK
#define CAN1RIDR0_ID25_MASK              CAN1RXIDR0_ID25_MASK
#define CAN1RIDR0_ID26_MASK              CAN1RXIDR0_ID26_MASK
#define CAN1RIDR0_ID27_MASK              CAN1RXIDR0_ID27_MASK
#define CAN1RIDR0_ID28_MASK              CAN1RXIDR0_ID28_MASK
#define CAN1RIDR1                        CAN1RXIDR1
#define CAN1RIDR1_ID15                   CAN1RXIDR1_ID15
#define CAN1RIDR1_ID16                   CAN1RXIDR1_ID16
#define CAN1RIDR1_ID17                   CAN1RXIDR1_ID17
#define CAN1RIDR1_IDE                    CAN1RXIDR1_IDE
#define CAN1RIDR1_SRR                    CAN1RXIDR1_SRR
#define CAN1RIDR1_ID18                   CAN1RXIDR1_ID18
#define CAN1RIDR1_ID19                   CAN1RXIDR1_ID19
#define CAN1RIDR1_ID20                   CAN1RXIDR1_ID20
#define CAN1RIDR1_ID_15                  CAN1RXIDR1_ID_15
#define CAN1RIDR1_ID_18                  CAN1RXIDR1_ID_18
#define CAN1RIDR1_ID                     CAN1RXIDR1_ID
#define CAN1RIDR1_ID15_MASK              CAN1RXIDR1_ID15_MASK
#define CAN1RIDR1_ID16_MASK              CAN1RXIDR1_ID16_MASK
#define CAN1RIDR1_ID17_MASK              CAN1RXIDR1_ID17_MASK
#define CAN1RIDR1_IDE_MASK               CAN1RXIDR1_IDE_MASK
#define CAN1RIDR1_SRR_MASK               CAN1RXIDR1_SRR_MASK
#define CAN1RIDR1_ID18_MASK              CAN1RXIDR1_ID18_MASK
#define CAN1RIDR1_ID19_MASK              CAN1RXIDR1_ID19_MASK
#define CAN1RIDR1_ID20_MASK              CAN1RXIDR1_ID20_MASK
