Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define CAN1RIDR1_ID_15_MASK             CAN1RXIDR1_ID_15_MASK
#define CAN1RIDR1_ID_15_BITNUM           CAN1RXIDR1_ID_15_BITNUM
#define CAN1RIDR1_ID_18_MASK             CAN1RXIDR1_ID_18_MASK
#define CAN1RIDR1_ID_18_BITNUM           CAN1RXIDR1_ID_18_BITNUM
#define CAN1RIDR2                        CAN1RXIDR2
#define CAN1RIDR2_ID7                    CAN1RXIDR2_ID7
#define CAN1RIDR2_ID8                    CAN1RXIDR2_ID8
#define CAN1RIDR2_ID9                    CAN1RXIDR2_ID9
#define CAN1RIDR2_ID10                   CAN1RXIDR2_ID10
#define CAN1RIDR2_ID11                   CAN1RXIDR2_ID11
#define CAN1RIDR2_ID12                   CAN1RXIDR2_ID12
#define CAN1RIDR2_ID13                   CAN1RXIDR2_ID13
#define CAN1RIDR2_ID14                   CAN1RXIDR2_ID14
#define CAN1RIDR2_ID7_MASK               CAN1RXIDR2_ID7_MASK
#define CAN1RIDR2_ID8_MASK               CAN1RXIDR2_ID8_MASK
#define CAN1RIDR2_ID9_MASK               CAN1RXIDR2_ID9_MASK
#define CAN1RIDR2_ID10_MASK              CAN1RXIDR2_ID10_MASK
#define CAN1RIDR2_ID11_MASK              CAN1RXIDR2_ID11_MASK
#define CAN1RIDR2_ID12_MASK              CAN1RXIDR2_ID12_MASK
#define CAN1RIDR2_ID13_MASK              CAN1RXIDR2_ID13_MASK
#define CAN1RIDR2_ID14_MASK              CAN1RXIDR2_ID14_MASK
#define CAN1RIDR3                        CAN1RXIDR3
#define CAN1RIDR3_RTR                    CAN1RXIDR3_RTR
#define CAN1RIDR3_ID0                    CAN1RXIDR3_ID0
#define CAN1RIDR3_ID1                    CAN1RXIDR3_ID1
#define CAN1RIDR3_ID2                    CAN1RXIDR3_ID2
#define CAN1RIDR3_ID3                    CAN1RXIDR3_ID3
#define CAN1RIDR3_ID4                    CAN1RXIDR3_ID4
#define CAN1RIDR3_ID5                    CAN1RXIDR3_ID5
#define CAN1RIDR3_ID6                    CAN1RXIDR3_ID6
#define CAN1RIDR3_ID                     CAN1RXIDR3_ID
#define CAN1RIDR3_RTR_MASK               CAN1RXIDR3_RTR_MASK
#define CAN1RIDR3_ID0_MASK               CAN1RXIDR3_ID0_MASK
#define CAN1RIDR3_ID1_MASK               CAN1RXIDR3_ID1_MASK
#define CAN1RIDR3_ID2_MASK               CAN1RXIDR3_ID2_MASK
#define CAN1RIDR3_ID3_MASK               CAN1RXIDR3_ID3_MASK
#define CAN1RIDR3_ID4_MASK               CAN1RXIDR3_ID4_MASK
#define CAN1RIDR3_ID5_MASK               CAN1RXIDR3_ID5_MASK
#define CAN1RIDR3_ID6_MASK               CAN1RXIDR3_ID6_MASK
#define CAN1RIDR3_ID_MASK                CAN1RXIDR3_ID_MASK
#define CAN1RIDR3_ID_BITNUM              CAN1RXIDR3_ID_BITNUM
#define CAN1RDSR0                        CAN1RXDSR0
#define CAN1RDSR0_DB0                    CAN1RXDSR0_DB0
#define CAN1RDSR0_DB1                    CAN1RXDSR0_DB1
#define CAN1RDSR0_DB2                    CAN1RXDSR0_DB2
#define CAN1RDSR0_DB3                    CAN1RXDSR0_DB3
#define CAN1RDSR0_DB4                    CAN1RXDSR0_DB4
#define CAN1RDSR0_DB5                    CAN1RXDSR0_DB5
#define CAN1RDSR0_DB6                    CAN1RXDSR0_DB6
#define CAN1RDSR0_DB7                    CAN1RXDSR0_DB7
#define CAN1RDSR_ARR                     CAN1RXDSR_ARR
#define CAN1RDSR0_DB0_MASK               CAN1RXDSR0_DB0_MASK
#define CAN1RDSR0_DB1_MASK               CAN1RXDSR0_DB1_MASK
#define CAN1RDSR0_DB2_MASK               CAN1RXDSR0_DB2_MASK
#define CAN1RDSR0_DB3_MASK               CAN1RXDSR0_DB3_MASK
#define CAN1RDSR0_DB4_MASK               CAN1RXDSR0_DB4_MASK
#define CAN1RDSR0_DB5_MASK               CAN1RXDSR0_DB5_MASK
#define CAN1RDSR0_DB6_MASK               CAN1RXDSR0_DB6_MASK
#define CAN1RDSR0_DB7_MASK               CAN1RXDSR0_DB7_MASK
#define CAN1RDSR1                        CAN1RXDSR1
#define CAN1RDSR1_DB0                    CAN1RXDSR1_DB0
#define CAN1RDSR1_DB1                    CAN1RXDSR1_DB1
#define CAN1RDSR1_DB2                    CAN1RXDSR1_DB2
#define CAN1RDSR1_DB3                    CAN1RXDSR1_DB3
#define CAN1RDSR1_DB4                    CAN1RXDSR1_DB4
#define CAN1RDSR1_DB5                    CAN1RXDSR1_DB5
#define CAN1RDSR1_DB6                    CAN1RXDSR1_DB6
#define CAN1RDSR1_DB7                    CAN1RXDSR1_DB7
#define CAN1RDSR1_DB0_MASK               CAN1RXDSR1_DB0_MASK
#define CAN1RDSR1_DB1_MASK               CAN1RXDSR1_DB1_MASK
#define CAN1RDSR1_DB2_MASK               CAN1RXDSR1_DB2_MASK
#define CAN1RDSR1_DB3_MASK               CAN1RXDSR1_DB3_MASK
#define CAN1RDSR1_DB4_MASK               CAN1RXDSR1_DB4_MASK
#define CAN1RDSR1_DB5_MASK               CAN1RXDSR1_DB5_MASK
#define CAN1RDSR1_DB6_MASK               CAN1RXDSR1_DB6_MASK
#define CAN1RDSR1_DB7_MASK               CAN1RXDSR1_DB7_MASK
#define CAN1RDSR2                        CAN1RXDSR2
#define CAN1RDSR2_DB0                    CAN1RXDSR2_DB0
#define CAN1RDSR2_DB1                    CAN1RXDSR2_DB1
#define CAN1RDSR2_DB2                    CAN1RXDSR2_DB2
#define CAN1RDSR2_DB3                    CAN1RXDSR2_DB3
#define CAN1RDSR2_DB4                    CAN1RXDSR2_DB4
#define CAN1RDSR2_DB5                    CAN1RXDSR2_DB5
#define CAN1RDSR2_DB6                    CAN1RXDSR2_DB6
#define CAN1RDSR2_DB7                    CAN1RXDSR2_DB7
#define CAN1RDSR2_DB0_MASK               CAN1RXDSR2_DB0_MASK
#define CAN1RDSR2_DB1_MASK               CAN1RXDSR2_DB1_MASK
#define CAN1RDSR2_DB2_MASK               CAN1RXDSR2_DB2_MASK
#define CAN1RDSR2_DB3_MASK               CAN1RXDSR2_DB3_MASK
#define CAN1RDSR2_DB4_MASK               CAN1RXDSR2_DB4_MASK
#define CAN1RDSR2_DB5_MASK               CAN1RXDSR2_DB5_MASK
#define CAN1RDSR2_DB6_MASK               CAN1RXDSR2_DB6_MASK
#define CAN1RDSR2_DB7_MASK               CAN1RXDSR2_DB7_MASK
#define CAN1RDSR3                        CAN1RXDSR3
#define CAN1RDSR3_DB0                    CAN1RXDSR3_DB0
#define CAN1RDSR3_DB1                    CAN1RXDSR3_DB1
#define CAN1RDSR3_DB2                    CAN1RXDSR3_DB2
#define CAN1RDSR3_DB3                    CAN1RXDSR3_DB3
#define CAN1RDSR3_DB4                    CAN1RXDSR3_DB4
#define CAN1RDSR3_DB5                    CAN1RXDSR3_DB5
#define CAN1RDSR3_DB6                    CAN1RXDSR3_DB6
#define CAN1RDSR3_DB7                    CAN1RXDSR3_DB7
#define CAN1RDSR3_DB0_MASK               CAN1RXDSR3_DB0_MASK
#define CAN1RDSR3_DB1_MASK               CAN1RXDSR3_DB1_MASK
#define CAN1RDSR3_DB2_MASK               CAN1RXDSR3_DB2_MASK
#define CAN1RDSR3_DB3_MASK               CAN1RXDSR3_DB3_MASK
#define CAN1RDSR3_DB4_MASK               CAN1RXDSR3_DB4_MASK
#define CAN1RDSR3_DB5_MASK               CAN1RXDSR3_DB5_MASK
#define CAN1RDSR3_DB6_MASK               CAN1RXDSR3_DB6_MASK
#define CAN1RDSR3_DB7_MASK               CAN1RXDSR3_DB7_MASK
#define CAN1RDSR4                        CAN1RXDSR4
#define CAN1RDSR4_DB0                    CAN1RXDSR4_DB0
#define CAN1RDSR4_DB1                    CAN1RXDSR4_DB1
#define CAN1RDSR4_DB2                    CAN1RXDSR4_DB2
#define CAN1RDSR4_DB3                    CAN1RXDSR4_DB3
#define CAN1RDSR4_DB4                    CAN1RXDSR4_DB4
#define CAN1RDSR4_DB5                    CAN1RXDSR4_DB5
#define CAN1RDSR4_DB6                    CAN1RXDSR4_DB6
#define CAN1RDSR4_DB7                    CAN1RXDSR4_DB7
#define CAN1RDSR4_DB0_MASK               CAN1RXDSR4_DB0_MASK
#define CAN1RDSR4_DB1_MASK               CAN1RXDSR4_DB1_MASK
#define CAN1RDSR4_DB2_MASK               CAN1RXDSR4_DB2_MASK
#define CAN1RDSR4_DB3_MASK               CAN1RXDSR4_DB3_MASK
#define CAN1RDSR4_DB4_MASK               CAN1RXDSR4_DB4_MASK
#define CAN1RDSR4_DB5_MASK               CAN1RXDSR4_DB5_MASK
#define CAN1RDSR4_DB6_MASK               CAN1RXDSR4_DB6_MASK
#define CAN1RDSR4_DB7_MASK               CAN1RXDSR4_DB7_MASK
#define CAN1RDSR5                        CAN1RXDSR5
#define CAN1RDSR5_DB0                    CAN1RXDSR5_DB0
#define CAN1RDSR5_DB1                    CAN1RXDSR5_DB1
#define CAN1RDSR5_DB2                    CAN1RXDSR5_DB2
#define CAN1RDSR5_DB3                    CAN1RXDSR5_DB3
#define CAN1RDSR5_DB4                    CAN1RXDSR5_DB4
#define CAN1RDSR5_DB5                    CAN1RXDSR5_DB5
#define CAN1RDSR5_DB6                    CAN1RXDSR5_DB6
#define CAN1RDSR5_DB7                    CAN1RXDSR5_DB7
#define CAN1RDSR5_DB0_MASK               CAN1RXDSR5_DB0_MASK
#define CAN1RDSR5_DB1_MASK               CAN1RXDSR5_DB1_MASK
#define CAN1RDSR5_DB2_MASK               CAN1RXDSR5_DB2_MASK
#define CAN1RDSR5_DB3_MASK               CAN1RXDSR5_DB3_MASK
#define CAN1RDSR5_DB4_MASK               CAN1RXDSR5_DB4_MASK
#define CAN1RDSR5_DB5_MASK               CAN1RXDSR5_DB5_MASK
#define CAN1RDSR5_DB6_MASK               CAN1RXDSR5_DB6_MASK
#define CAN1RDSR5_DB7_MASK               CAN1RXDSR5_DB7_MASK
#define CAN1RDSR6                        CAN1RXDSR6
#define CAN1RDSR6_DB0                    CAN1RXDSR6_DB0
#define CAN1RDSR6_DB1                    CAN1RXDSR6_DB1
#define CAN1RDSR6_DB2                    CAN1RXDSR6_DB2
#define CAN1RDSR6_DB3                    CAN1RXDSR6_DB3
#define CAN1RDSR6_DB4                    CAN1RXDSR6_DB4
#define CAN1RDSR6_DB5                    CAN1RXDSR6_DB5
#define CAN1RDSR6_DB6                    CAN1RXDSR6_DB6
#define CAN1RDSR6_DB7                    CAN1RXDSR6_DB7
#define CAN1RDSR6_DB0_MASK               CAN1RXDSR6_DB0_MASK
#define CAN1RDSR6_DB1_MASK               CAN1RXDSR6_DB1_MASK
#define CAN1RDSR6_DB2_MASK               CAN1RXDSR6_DB2_MASK
#define CAN1RDSR6_DB3_MASK               CAN1RXDSR6_DB3_MASK
#define CAN1RDSR6_DB4_MASK               CAN1RXDSR6_DB4_MASK
#define CAN1RDSR6_DB5_MASK               CAN1RXDSR6_DB5_MASK
#define CAN1RDSR6_DB6_MASK               CAN1RXDSR6_DB6_MASK
#define CAN1RDSR6_DB7_MASK               CAN1RXDSR6_DB7_MASK
#define CAN1RDSR7                        CAN1RXDSR7
#define CAN1RDSR7_DB0                    CAN1RXDSR7_DB0
#define CAN1RDSR7_DB1                    CAN1RXDSR7_DB1
#define CAN1RDSR7_DB2                    CAN1RXDSR7_DB2
#define CAN1RDSR7_DB3                    CAN1RXDSR7_DB3
#define CAN1RDSR7_DB4                    CAN1RXDSR7_DB4
#define CAN1RDSR7_DB5                    CAN1RXDSR7_DB5
#define CAN1RDSR7_DB6                    CAN1RXDSR7_DB6
#define CAN1RDSR7_DB7                    CAN1RXDSR7_DB7
#define CAN1RDSR7_DB0_MASK               CAN1RXDSR7_DB0_MASK
#define CAN1RDSR7_DB1_MASK               CAN1RXDSR7_DB1_MASK
#define CAN1RDSR7_DB2_MASK               CAN1RXDSR7_DB2_MASK
#define CAN1RDSR7_DB3_MASK               CAN1RXDSR7_DB3_MASK
#define CAN1RDSR7_DB4_MASK               CAN1RXDSR7_DB4_MASK
#define CAN1RDSR7_DB5_MASK               CAN1RXDSR7_DB5_MASK
#define CAN1RDSR7_DB6_MASK               CAN1RXDSR7_DB6_MASK
#define CAN1RDSR7_DB7_MASK               CAN1RXDSR7_DB7_MASK
#define CAN1RDLR                         CAN1RXDLR
#define CAN1RDLR_DLC0                    CAN1RXDLR_DLC0
#define CAN1RDLR_DLC1                    CAN1RXDLR_DLC1
#define CAN1RDLR_DLC2                    CAN1RXDLR_DLC2
#define CAN1RDLR_DLC3                    CAN1RXDLR_DLC3
#define CAN1RDLR_DLC                     CAN1RXDLR_DLC
#define CAN1RDLR_DLC0_MASK               CAN1RXDLR_DLC0_MASK
#define CAN1RDLR_DLC1_MASK               CAN1RXDLR_DLC1_MASK
#define CAN1RDLR_DLC2_MASK               CAN1RXDLR_DLC2_MASK
#define CAN1RDLR_DLC3_MASK               CAN1RXDLR_DLC3_MASK
#define CAN1RDLR_DLC_MASK                CAN1RXDLR_DLC_MASK
#define CAN1RDLR_DLC_BITNUM              CAN1RXDLR_DLC_BITNUM
#define CAN1RTSRH                        CAN1RXTSRH
#define CAN1RTSRH_TSR8                   CAN1RXTSRH_TSR8
#define CAN1RTSRH_TSR9                   CAN1RXTSRH_TSR9
#define CAN1RTSRH_TSR10                  CAN1RXTSRH_TSR10
#define CAN1RTSRH_TSR11                  CAN1RXTSRH_TSR11
#define CAN1RTSRH_TSR12                  CAN1RXTSRH_TSR12
#define CAN1RTSRH_TSR13                  CAN1RXTSRH_TSR13
#define CAN1RTSRH_TSR14                  CAN1RXTSRH_TSR14
#define CAN1RTSRH_TSR15                  CAN1RXTSRH_TSR15
#define CAN1RTSRH_TSR8_MASK              CAN1RXTSRH_TSR8_MASK
#define CAN1RTSRH_TSR9_MASK              CAN1RXTSRH_TSR9_MASK
#define CAN1RTSRH_TSR10_MASK             CAN1RXTSRH_TSR10_MASK
#define CAN1RTSRH_TSR11_MASK             CAN1RXTSRH_TSR11_MASK
#define CAN1RTSRH_TSR12_MASK             CAN1RXTSRH_TSR12_MASK
#define CAN1RTSRH_TSR13_MASK             CAN1RXTSRH_TSR13_MASK
#define CAN1RTSRH_TSR14_MASK             CAN1RXTSRH_TSR14_MASK
#define CAN1RTSRH_TSR15_MASK             CAN1RXTSRH_TSR15_MASK
#define CAN1RTSRL                        CAN1RXTSRL
#define CAN1RTSRL_TSR0                   CAN1RXTSRL_TSR0
#define CAN1RTSRL_TSR1                   CAN1RXTSRL_TSR1
#define CAN1RTSRL_TSR2                   CAN1RXTSRL_TSR2
#define CAN1RTSRL_TSR3                   CAN1RXTSRL_TSR3
#define CAN1RTSRL_TSR4                   CAN1RXTSRL_TSR4
#define CAN1RTSRL_TSR5                   CAN1RXTSRL_TSR5
#define CAN1RTSRL_TSR6                   CAN1RXTSRL_TSR6
#define CAN1RTSRL_TSR7                   CAN1RXTSRL_TSR7
#define CAN1RTSRL_TSR0_MASK              CAN1RXTSRL_TSR0_MASK
#define CAN1RTSRL_TSR1_MASK              CAN1RXTSRL_TSR1_MASK
#define CAN1RTSRL_TSR2_MASK              CAN1RXTSRL_TSR2_MASK
#define CAN1RTSRL_TSR3_MASK              CAN1RXTSRL_TSR3_MASK
#define CAN1RTSRL_TSR4_MASK              CAN1RXTSRL_TSR4_MASK
#define CAN1RTSRL_TSR5_MASK              CAN1RXTSRL_TSR5_MASK
#define CAN1RTSRL_TSR6_MASK              CAN1RXTSRL_TSR6_MASK
#define CAN1RTSRL_TSR7_MASK              CAN1RXTSRL_TSR7_MASK
#define CAN1RTSR                         CAN1RXTSR
#define CAN1RTSR_TSR0                    CAN1RXTSR_TSR0
#define CAN1RTSR_TSR1                    CAN1RXTSR_TSR1
#define CAN1RTSR_TSR2                    CAN1RXTSR_TSR2
#define CAN1RTSR_TSR3                    CAN1RXTSR_TSR3
#define CAN1RTSR_TSR4                    CAN1RXTSR_TSR4
#define CAN1RTSR_TSR5                    CAN1RXTSR_TSR5
#define CAN1RTSR_TSR6                    CAN1RXTSR_TSR6
#define CAN1RTSR_TSR7                    CAN1RXTSR_TSR7
#define CAN1RTSR_TSR8                    CAN1RXTSR_TSR8
#define CAN1RTSR_TSR9                    CAN1RXTSR_TSR9
#define CAN1RTSR_TSR10                   CAN1RXTSR_TSR10
#define CAN1RTSR_TSR11                   CAN1RXTSR_TSR11
#define CAN1RTSR_TSR12                   CAN1RXTSR_TSR12
#define CAN1RTSR_TSR13                   CAN1RXTSR_TSR13
#define CAN1RTSR_TSR14                   CAN1RXTSR_TSR14
#define CAN1RTSR_TSR15                   CAN1RXTSR_TSR15
#define CAN1RTSR_TSR0_MASK               CAN1RXTSR_TSR0_MASK
#define CAN1RTSR_TSR1_MASK               CAN1RXTSR_TSR1_MASK
#define CAN1RTSR_TSR2_MASK               CAN1RXTSR_TSR2_MASK
#define CAN1RTSR_TSR3_MASK               CAN1RXTSR_TSR3_MASK
#define CAN1RTSR_TSR4_MASK               CAN1RXTSR_TSR4_MASK
#define CAN1RTSR_TSR5_MASK               CAN1RXTSR_TSR5_MASK
#define CAN1RTSR_TSR6_MASK               CAN1RXTSR_TSR6_MASK
#define CAN1RTSR_TSR7_MASK               CAN1RXTSR_TSR7_MASK
#define CAN1RTSR_TSR8_MASK               CAN1RXTSR_TSR8_MASK
#define CAN1RTSR_TSR9_MASK               CAN1RXTSR_TSR9_MASK
#define CAN1RTSR_TSR10_MASK              CAN1RXTSR_TSR10_MASK
#define CAN1RTSR_TSR11_MASK              CAN1RXTSR_TSR11_MASK
#define CAN1RTSR_TSR12_MASK              CAN1RXTSR_TSR12_MASK
#define CAN1RTSR_TSR13_MASK              CAN1RXTSR_TSR13_MASK
#define CAN1RTSR_TSR14_MASK              CAN1RXTSR_TSR14_MASK
#define CAN1RTSR_TSR15_MASK              CAN1RXTSR_TSR15_MASK
#define CAN1TIDR0                        CAN1TXIDR0
#define CAN1TIDR0_ID21                   CAN1TXIDR0_ID21
#define CAN1TIDR0_ID22                   CAN1TXIDR0_ID22
#define CAN1TIDR0_ID23                   CAN1TXIDR0_ID23
#define CAN1TIDR0_ID24                   CAN1TXIDR0_ID24
#define CAN1TIDR0_ID25                   CAN1TXIDR0_ID25
#define CAN1TIDR0_ID26                   CAN1TXIDR0_ID26
#define CAN1TIDR0_ID27                   CAN1TXIDR0_ID27
#define CAN1TIDR0_ID28                   CAN1TXIDR0_ID28
#define CAN1TIDR_ARR                     CAN1TXIDR_ARR
#define CAN1TIDR0_ID21_MASK              CAN1TXIDR0_ID21_MASK
#define CAN1TIDR0_ID22_MASK              CAN1TXIDR0_ID22_MASK
#define CAN1TIDR0_ID23_MASK              CAN1TXIDR0_ID23_MASK
#define CAN1TIDR0_ID24_MASK              CAN1TXIDR0_ID24_MASK
#define CAN1TIDR0_ID25_MASK              CAN1TXIDR0_ID25_MASK
#define CAN1TIDR0_ID26_MASK              CAN1TXIDR0_ID26_MASK
#define CAN1TIDR0_ID27_MASK              CAN1TXIDR0_ID27_MASK
#define CAN1TIDR0_ID28_MASK              CAN1TXIDR0_ID28_MASK
#define CAN1TIDR1                        CAN1TXIDR1
#define CAN1TIDR1_ID15                   CAN1TXIDR1_ID15
#define CAN1TIDR1_ID16                   CAN1TXIDR1_ID16
#define CAN1TIDR1_ID17                   CAN1TXIDR1_ID17
#define CAN1TIDR1_IDE                    CAN1TXIDR1_IDE
#define CAN1TIDR1_SRR                    CAN1TXIDR1_SRR
#define CAN1TIDR1_ID18                   CAN1TXIDR1_ID18
#define CAN1TIDR1_ID19                   CAN1TXIDR1_ID19
#define CAN1TIDR1_ID20                   CAN1TXIDR1_ID20
#define CAN1TIDR1_ID_15                  CAN1TXIDR1_ID_15
#define CAN1TIDR1_ID_18                  CAN1TXIDR1_ID_18
#define CAN1TIDR1_ID                     CAN1TXIDR1_ID
#define CAN1TIDR1_ID15_MASK              CAN1TXIDR1_ID15_MASK
#define CAN1TIDR1_ID16_MASK              CAN1TXIDR1_ID16_MASK
#define CAN1TIDR1_ID17_MASK              CAN1TXIDR1_ID17_MASK
#define CAN1TIDR1_IDE_MASK               CAN1TXIDR1_IDE_MASK
#define CAN1TIDR1_SRR_MASK               CAN1TXIDR1_SRR_MASK
#define CAN1TIDR1_ID18_MASK              CAN1TXIDR1_ID18_MASK
#define CAN1TIDR1_ID19_MASK              CAN1TXIDR1_ID19_MASK
#define CAN1TIDR1_ID20_MASK              CAN1TXIDR1_ID20_MASK
#define CAN1TIDR1_ID_15_MASK             CAN1TXIDR1_ID_15_MASK
#define CAN1TIDR1_ID_15_BITNUM           CAN1TXIDR1_ID_15_BITNUM
#define CAN1TIDR1_ID_18_MASK             CAN1TXIDR1_ID_18_MASK
#define CAN1TIDR1_ID_18_BITNUM           CAN1TXIDR1_ID_18_BITNUM
#define CAN1TIDR2                        CAN1TXIDR2
#define CAN1TIDR2_ID7                    CAN1TXIDR2_ID7
#define CAN1TIDR2_ID8                    CAN1TXIDR2_ID8
#define CAN1TIDR2_ID9                    CAN1TXIDR2_ID9
#define CAN1TIDR2_ID10                   CAN1TXIDR2_ID10
#define CAN1TIDR2_ID11                   CAN1TXIDR2_ID11
#define CAN1TIDR2_ID12                   CAN1TXIDR2_ID12
#define CAN1TIDR2_ID13                   CAN1TXIDR2_ID13
#define CAN1TIDR2_ID14                   CAN1TXIDR2_ID14
#define CAN1TIDR2_ID7_MASK               CAN1TXIDR2_ID7_MASK
#define CAN1TIDR2_ID8_MASK               CAN1TXIDR2_ID8_MASK
#define CAN1TIDR2_ID9_MASK               CAN1TXIDR2_ID9_MASK
#define CAN1TIDR2_ID10_MASK              CAN1TXIDR2_ID10_MASK
#define CAN1TIDR2_ID11_MASK              CAN1TXIDR2_ID11_MASK
#define CAN1TIDR2_ID12_MASK              CAN1TXIDR2_ID12_MASK
#define CAN1TIDR2_ID13_MASK              CAN1TXIDR2_ID13_MASK
#define CAN1TIDR2_ID14_MASK              CAN1TXIDR2_ID14_MASK
#define CAN1TIDR3                        CAN1TXIDR3
#define CAN1TIDR3_RTR                    CAN1TXIDR3_RTR
#define CAN1TIDR3_ID0                    CAN1TXIDR3_ID0
#define CAN1TIDR3_ID1                    CAN1TXIDR3_ID1
#define CAN1TIDR3_ID2                    CAN1TXIDR3_ID2
#define CAN1TIDR3_ID3                    CAN1TXIDR3_ID3
#define CAN1TIDR3_ID4                    CAN1TXIDR3_ID4
#define CAN1TIDR3_ID5                    CAN1TXIDR3_ID5
#define CAN1TIDR3_ID6                    CAN1TXIDR3_ID6
#define CAN1TIDR3_ID                     CAN1TXIDR3_ID
#define CAN1TIDR3_RTR_MASK               CAN1TXIDR3_RTR_MASK
#define CAN1TIDR3_ID0_MASK               CAN1TXIDR3_ID0_MASK
#define CAN1TIDR3_ID1_MASK               CAN1TXIDR3_ID1_MASK
#define CAN1TIDR3_ID2_MASK               CAN1TXIDR3_ID2_MASK
#define CAN1TIDR3_ID3_MASK               CAN1TXIDR3_ID3_MASK
#define CAN1TIDR3_ID4_MASK               CAN1TXIDR3_ID4_MASK
#define CAN1TIDR3_ID5_MASK               CAN1TXIDR3_ID5_MASK
#define CAN1TIDR3_ID6_MASK               CAN1TXIDR3_ID6_MASK
#define CAN1TIDR3_ID_MASK                CAN1TXIDR3_ID_MASK
#define CAN1TIDR3_ID_BITNUM              CAN1TXIDR3_ID_BITNUM
#define CAN1TDSR0                        CAN1TXDSR0
#define CAN1TDSR0_DB0                    CAN1TXDSR0_DB0
#define CAN1TDSR0_DB1                    CAN1TXDSR0_DB1
#define CAN1TDSR0_DB2                    CAN1TXDSR0_DB2
#define CAN1TDSR0_DB3                    CAN1TXDSR0_DB3
#define CAN1TDSR0_DB4                    CAN1TXDSR0_DB4
#define CAN1TDSR0_DB5                    CAN1TXDSR0_DB5
#define CAN1TDSR0_DB6                    CAN1TXDSR0_DB6
#define CAN1TDSR0_DB7                    CAN1TXDSR0_DB7
#define CAN1TDSR_ARR                     CAN1TXDSR_ARR
#define CAN1TDSR0_DB0_MASK               CAN1TXDSR0_DB0_MASK
#define CAN1TDSR0_DB1_MASK               CAN1TXDSR0_DB1_MASK
#define CAN1TDSR0_DB2_MASK               CAN1TXDSR0_DB2_MASK
#define CAN1TDSR0_DB3_MASK               CAN1TXDSR0_DB3_MASK
#define CAN1TDSR0_DB4_MASK               CAN1TXDSR0_DB4_MASK
#define CAN1TDSR0_DB5_MASK               CAN1TXDSR0_DB5_MASK
#define CAN1TDSR0_DB6_MASK               CAN1TXDSR0_DB6_MASK
#define CAN1TDSR0_DB7_MASK               CAN1TXDSR0_DB7_MASK
#define CAN1TDSR1                        CAN1TXDSR1
#define CAN1TDSR1_DB0                    CAN1TXDSR1_DB0
#define CAN1TDSR1_DB1                    CAN1TXDSR1_DB1
#define CAN1TDSR1_DB2                    CAN1TXDSR1_DB2
#define CAN1TDSR1_DB3                    CAN1TXDSR1_DB3
#define CAN1TDSR1_DB4                    CAN1TXDSR1_DB4
#define CAN1TDSR1_DB5                    CAN1TXDSR1_DB5
#define CAN1TDSR1_DB6                    CAN1TXDSR1_DB6
#define CAN1TDSR1_DB7                    CAN1TXDSR1_DB7
#define CAN1TDSR1_DB0_MASK               CAN1TXDSR1_DB0_MASK
#define CAN1TDSR1_DB1_MASK               CAN1TXDSR1_DB1_MASK
#define CAN1TDSR1_DB2_MASK               CAN1TXDSR1_DB2_MASK
#define CAN1TDSR1_DB3_MASK               CAN1TXDSR1_DB3_MASK
#define CAN1TDSR1_DB4_MASK               CAN1TXDSR1_DB4_MASK
#define CAN1TDSR1_DB5_MASK               CAN1TXDSR1_DB5_MASK
#define CAN1TDSR1_DB6_MASK               CAN1TXDSR1_DB6_MASK
#define CAN1TDSR1_DB7_MASK               CAN1TXDSR1_DB7_MASK
#define CAN1TDSR2                        CAN1TXDSR2
#define CAN1TDSR2_DB0                    CAN1TXDSR2_DB0
#define CAN1TDSR2_DB1                    CAN1TXDSR2_DB1
#define CAN1TDSR2_DB2                    CAN1TXDSR2_DB2
#define CAN1TDSR2_DB3                    CAN1TXDSR2_DB3
#define CAN1TDSR2_DB4                    CAN1TXDSR2_DB4
#define CAN1TDSR2_DB5                    CAN1TXDSR2_DB5
#define CAN1TDSR2_DB6                    CAN1TXDSR2_DB6
#define CAN1TDSR2_DB7                    CAN1TXDSR2_DB7
#define CAN1TDSR2_DB0_MASK               CAN1TXDSR2_DB0_MASK
#define CAN1TDSR2_DB1_MASK               CAN1TXDSR2_DB1_MASK
#define CAN1TDSR2_DB2_MASK               CAN1TXDSR2_DB2_MASK
#define CAN1TDSR2_DB3_MASK               CAN1TXDSR2_DB3_MASK
#define CAN1TDSR2_DB4_MASK               CAN1TXDSR2_DB4_MASK
#define CAN1TDSR2_DB5_MASK               CAN1TXDSR2_DB5_MASK
#define CAN1TDSR2_DB6_MASK               CAN1TXDSR2_DB6_MASK
#define CAN1TDSR2_DB7_MASK               CAN1TXDSR2_DB7_MASK
#define CAN1TDSR3                        CAN1TXDSR3
#define CAN1TDSR3_DB0                    CAN1TXDSR3_DB0
#define CAN1TDSR3_DB1                    CAN1TXDSR3_DB1
#define CAN1TDSR3_DB2                    CAN1TXDSR3_DB2
#define CAN1TDSR3_DB3                    CAN1TXDSR3_DB3
#define CAN1TDSR3_DB4                    CAN1TXDSR3_DB4
#define CAN1TDSR3_DB5                    CAN1TXDSR3_DB5
#define CAN1TDSR3_DB6                    CAN1TXDSR3_DB6
#define CAN1TDSR3_DB7                    CAN1TXDSR3_DB7
#define CAN1TDSR3_DB0_MASK               CAN1TXDSR3_DB0_MASK
#define CAN1TDSR3_DB1_MASK               CAN1TXDSR3_DB1_MASK
#define CAN1TDSR3_DB2_MASK               CAN1TXDSR3_DB2_MASK
#define CAN1TDSR3_DB3_MASK               CAN1TXDSR3_DB3_MASK
#define CAN1TDSR3_DB4_MASK               CAN1TXDSR3_DB4_MASK
#define CAN1TDSR3_DB5_MASK               CAN1TXDSR3_DB5_MASK
#define CAN1TDSR3_DB6_MASK               CAN1TXDSR3_DB6_MASK
#define CAN1TDSR3_DB7_MASK               CAN1TXDSR3_DB7_MASK
#define CAN1TDSR4                        CAN1TXDSR4
#define CAN1TDSR4_DB0                    CAN1TXDSR4_DB0
#define CAN1TDSR4_DB1                    CAN1TXDSR4_DB1
#define CAN1TDSR4_DB2                    CAN1TXDSR4_DB2
#define CAN1TDSR4_DB3                    CAN1TXDSR4_DB3
