Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define TIM_TCNT_TCNT15                  This_symb_has_been_depreciated
#define TIM_TCNT_TCNT0_MASK              This_symb_has_been_depreciated
#define TIM_TCNT_TCNT1_MASK              This_symb_has_been_depreciated
#define TIM_TCNT_TCNT2_MASK              This_symb_has_been_depreciated
#define TIM_TCNT_TCNT3_MASK              This_symb_has_been_depreciated
#define TIM_TCNT_TCNT4_MASK              This_symb_has_been_depreciated
#define TIM_TCNT_TCNT5_MASK              This_symb_has_been_depreciated
#define TIM_TCNT_TCNT6_MASK              This_symb_has_been_depreciated
#define TIM_TCNT_TCNT7_MASK              This_symb_has_been_depreciated
#define TIM_TCNT_TCNT8_MASK              This_symb_has_been_depreciated
#define TIM_TCNT_TCNT9_MASK              This_symb_has_been_depreciated
#define TIM_TCNT_TCNT10_MASK             This_symb_has_been_depreciated
#define TIM_TCNT_TCNT11_MASK             This_symb_has_been_depreciated
#define TIM_TCNT_TCNT12_MASK             This_symb_has_been_depreciated
#define TIM_TCNT_TCNT13_MASK             This_symb_has_been_depreciated
#define TIM_TCNT_TCNT14_MASK             This_symb_has_been_depreciated
#define TIM_TCNT_TCNT15_MASK             This_symb_has_been_depreciated
#define TIM_TC0H                         TIM_TC0
#define TIM_TC0H_BIT8                    This_symb_has_been_depreciated
#define TIM_TC0H_BIT9                    This_symb_has_been_depreciated
#define TIM_TC0H_BIT10                   This_symb_has_been_depreciated
#define TIM_TC0H_BIT11                   This_symb_has_been_depreciated
#define TIM_TC0H_BIT12                   This_symb_has_been_depreciated
#define TIM_TC0H_BIT13                   This_symb_has_been_depreciated
#define TIM_TC0H_BIT14                   This_symb_has_been_depreciated
#define TIM_TC0H_BIT15                   This_symb_has_been_depreciated
#define TIM_TC0H_BIT8_MASK               This_symb_has_been_depreciated
#define TIM_TC0H_BIT9_MASK               This_symb_has_been_depreciated
#define TIM_TC0H_BIT10_MASK              This_symb_has_been_depreciated
#define TIM_TC0H_BIT11_MASK              This_symb_has_been_depreciated
#define TIM_TC0H_BIT12_MASK              This_symb_has_been_depreciated
#define TIM_TC0H_BIT13_MASK              This_symb_has_been_depreciated
#define TIM_TC0H_BIT14_MASK              This_symb_has_been_depreciated
#define TIM_TC0H_BIT15_MASK              This_symb_has_been_depreciated
#define TIM_TC0L                         TIM_TC0Lo
#define TIM_TC0L_BIT0                    This_symb_has_been_depreciated
#define TIM_TC0L_BIT1                    This_symb_has_been_depreciated
#define TIM_TC0L_BIT2                    This_symb_has_been_depreciated
#define TIM_TC0L_BIT3                    This_symb_has_been_depreciated
#define TIM_TC0L_BIT4                    This_symb_has_been_depreciated
#define TIM_TC0L_BIT5                    This_symb_has_been_depreciated
#define TIM_TC0L_BIT6                    This_symb_has_been_depreciated
#define TIM_TC0L_BIT7                    This_symb_has_been_depreciated
#define TIM_TC0L_BIT0_MASK               This_symb_has_been_depreciated
#define TIM_TC0L_BIT1_MASK               This_symb_has_been_depreciated
#define TIM_TC0L_BIT2_MASK               This_symb_has_been_depreciated
#define TIM_TC0L_BIT3_MASK               This_symb_has_been_depreciated
#define TIM_TC0L_BIT4_MASK               This_symb_has_been_depreciated
#define TIM_TC0L_BIT5_MASK               This_symb_has_been_depreciated
#define TIM_TC0L_BIT6_MASK               This_symb_has_been_depreciated
#define TIM_TC0L_BIT7_MASK               This_symb_has_been_depreciated
#define TIM_TC0_BIT0                     This_symb_has_been_depreciated
#define TIM_TC0_BIT1                     This_symb_has_been_depreciated
#define TIM_TC0_BIT2                     This_symb_has_been_depreciated
#define TIM_TC0_BIT3                     This_symb_has_been_depreciated
#define TIM_TC0_BIT4                     This_symb_has_been_depreciated
#define TIM_TC0_BIT5                     This_symb_has_been_depreciated
#define TIM_TC0_BIT6                     This_symb_has_been_depreciated
#define TIM_TC0_BIT7                     This_symb_has_been_depreciated
#define TIM_TC0_BIT8                     This_symb_has_been_depreciated
#define TIM_TC0_BIT9                     This_symb_has_been_depreciated
#define TIM_TC0_BIT10                    This_symb_has_been_depreciated
#define TIM_TC0_BIT11                    This_symb_has_been_depreciated
#define TIM_TC0_BIT12                    This_symb_has_been_depreciated
#define TIM_TC0_BIT13                    This_symb_has_been_depreciated
#define TIM_TC0_BIT14                    This_symb_has_been_depreciated
#define TIM_TC0_BIT15                    This_symb_has_been_depreciated
#define TIM_TC0_BIT0_MASK                This_symb_has_been_depreciated
#define TIM_TC0_BIT1_MASK                This_symb_has_been_depreciated
#define TIM_TC0_BIT2_MASK                This_symb_has_been_depreciated
#define TIM_TC0_BIT3_MASK                This_symb_has_been_depreciated
#define TIM_TC0_BIT4_MASK                This_symb_has_been_depreciated
#define TIM_TC0_BIT5_MASK                This_symb_has_been_depreciated
#define TIM_TC0_BIT6_MASK                This_symb_has_been_depreciated
#define TIM_TC0_BIT7_MASK                This_symb_has_been_depreciated
#define TIM_TC0_BIT8_MASK                This_symb_has_been_depreciated
#define TIM_TC0_BIT9_MASK                This_symb_has_been_depreciated
#define TIM_TC0_BIT10_MASK               This_symb_has_been_depreciated
#define TIM_TC0_BIT11_MASK               This_symb_has_been_depreciated
#define TIM_TC0_BIT12_MASK               This_symb_has_been_depreciated
#define TIM_TC0_BIT13_MASK               This_symb_has_been_depreciated
#define TIM_TC0_BIT14_MASK               This_symb_has_been_depreciated
#define TIM_TC0_BIT15_MASK               This_symb_has_been_depreciated
#define TIM_TC1H                         TIM_TC1
#define TIM_TC1H_BIT8                    This_symb_has_been_depreciated
#define TIM_TC1H_BIT9                    This_symb_has_been_depreciated
#define TIM_TC1H_BIT10                   This_symb_has_been_depreciated
#define TIM_TC1H_BIT11                   This_symb_has_been_depreciated
#define TIM_TC1H_BIT12                   This_symb_has_been_depreciated
#define TIM_TC1H_BIT13                   This_symb_has_been_depreciated
#define TIM_TC1H_BIT14                   This_symb_has_been_depreciated
#define TIM_TC1H_BIT15                   This_symb_has_been_depreciated
#define TIM_TC1H_BIT8_MASK               This_symb_has_been_depreciated
#define TIM_TC1H_BIT9_MASK               This_symb_has_been_depreciated
#define TIM_TC1H_BIT10_MASK              This_symb_has_been_depreciated
#define TIM_TC1H_BIT11_MASK              This_symb_has_been_depreciated
#define TIM_TC1H_BIT12_MASK              This_symb_has_been_depreciated
#define TIM_TC1H_BIT13_MASK              This_symb_has_been_depreciated
#define TIM_TC1H_BIT14_MASK              This_symb_has_been_depreciated
#define TIM_TC1H_BIT15_MASK              This_symb_has_been_depreciated
#define TIM_TC1L                         TIM_TC1Lo
#define TIM_TC1L_BIT0                    This_symb_has_been_depreciated
#define TIM_TC1L_BIT1                    This_symb_has_been_depreciated
#define TIM_TC1L_BIT2                    This_symb_has_been_depreciated
#define TIM_TC1L_BIT3                    This_symb_has_been_depreciated
#define TIM_TC1L_BIT4                    This_symb_has_been_depreciated
#define TIM_TC1L_BIT5                    This_symb_has_been_depreciated
#define TIM_TC1L_BIT6                    This_symb_has_been_depreciated
#define TIM_TC1L_BIT7                    This_symb_has_been_depreciated
#define TIM_TC1L_BIT0_MASK               This_symb_has_been_depreciated
#define TIM_TC1L_BIT1_MASK               This_symb_has_been_depreciated
#define TIM_TC1L_BIT2_MASK               This_symb_has_been_depreciated
#define TIM_TC1L_BIT3_MASK               This_symb_has_been_depreciated
#define TIM_TC1L_BIT4_MASK               This_symb_has_been_depreciated
#define TIM_TC1L_BIT5_MASK               This_symb_has_been_depreciated
#define TIM_TC1L_BIT6_MASK               This_symb_has_been_depreciated
#define TIM_TC1L_BIT7_MASK               This_symb_has_been_depreciated
#define TIM_TC1_BIT0                     This_symb_has_been_depreciated
#define TIM_TC1_BIT1                     This_symb_has_been_depreciated
#define TIM_TC1_BIT2                     This_symb_has_been_depreciated
#define TIM_TC1_BIT3                     This_symb_has_been_depreciated
#define TIM_TC1_BIT4                     This_symb_has_been_depreciated
#define TIM_TC1_BIT5                     This_symb_has_been_depreciated
#define TIM_TC1_BIT6                     This_symb_has_been_depreciated
#define TIM_TC1_BIT7                     This_symb_has_been_depreciated
#define TIM_TC1_BIT8                     This_symb_has_been_depreciated
#define TIM_TC1_BIT9                     This_symb_has_been_depreciated
#define TIM_TC1_BIT10                    This_symb_has_been_depreciated
#define TIM_TC1_BIT11                    This_symb_has_been_depreciated
#define TIM_TC1_BIT12                    This_symb_has_been_depreciated
#define TIM_TC1_BIT13                    This_symb_has_been_depreciated
#define TIM_TC1_BIT14                    This_symb_has_been_depreciated
#define TIM_TC1_BIT15                    This_symb_has_been_depreciated
#define TIM_TC1_BIT0_MASK                This_symb_has_been_depreciated
#define TIM_TC1_BIT1_MASK                This_symb_has_been_depreciated
#define TIM_TC1_BIT2_MASK                This_symb_has_been_depreciated
#define TIM_TC1_BIT3_MASK                This_symb_has_been_depreciated
#define TIM_TC1_BIT4_MASK                This_symb_has_been_depreciated
#define TIM_TC1_BIT5_MASK                This_symb_has_been_depreciated
#define TIM_TC1_BIT6_MASK                This_symb_has_been_depreciated
#define TIM_TC1_BIT7_MASK                This_symb_has_been_depreciated
#define TIM_TC1_BIT8_MASK                This_symb_has_been_depreciated
#define TIM_TC1_BIT9_MASK                This_symb_has_been_depreciated
#define TIM_TC1_BIT10_MASK               This_symb_has_been_depreciated
#define TIM_TC1_BIT11_MASK               This_symb_has_been_depreciated
#define TIM_TC1_BIT12_MASK               This_symb_has_been_depreciated
#define TIM_TC1_BIT13_MASK               This_symb_has_been_depreciated
#define TIM_TC1_BIT14_MASK               This_symb_has_been_depreciated
#define TIM_TC1_BIT15_MASK               This_symb_has_been_depreciated
#define TIM_TC2H                         TIM_TC2
#define TIM_TC2H_BIT8                    This_symb_has_been_depreciated
#define TIM_TC2H_BIT9                    This_symb_has_been_depreciated
#define TIM_TC2H_BIT10                   This_symb_has_been_depreciated
#define TIM_TC2H_BIT11                   This_symb_has_been_depreciated
#define TIM_TC2H_BIT12                   This_symb_has_been_depreciated
#define TIM_TC2H_BIT13                   This_symb_has_been_depreciated
#define TIM_TC2H_BIT14                   This_symb_has_been_depreciated
#define TIM_TC2H_BIT15                   This_symb_has_been_depreciated
#define TIM_TC2H_BIT8_MASK               This_symb_has_been_depreciated
#define TIM_TC2H_BIT9_MASK               This_symb_has_been_depreciated
#define TIM_TC2H_BIT10_MASK              This_symb_has_been_depreciated
#define TIM_TC2H_BIT11_MASK              This_symb_has_been_depreciated
#define TIM_TC2H_BIT12_MASK              This_symb_has_been_depreciated
#define TIM_TC2H_BIT13_MASK              This_symb_has_been_depreciated
#define TIM_TC2H_BIT14_MASK              This_symb_has_been_depreciated
#define TIM_TC2H_BIT15_MASK              This_symb_has_been_depreciated
#define TIM_TC2L                         TIM_TC2Lo
#define TIM_TC2L_BIT0                    This_symb_has_been_depreciated
#define TIM_TC2L_BIT1                    This_symb_has_been_depreciated
#define TIM_TC2L_BIT2                    This_symb_has_been_depreciated
#define TIM_TC2L_BIT3                    This_symb_has_been_depreciated
#define TIM_TC2L_BIT4                    This_symb_has_been_depreciated
#define TIM_TC2L_BIT5                    This_symb_has_been_depreciated
#define TIM_TC2L_BIT6                    This_symb_has_been_depreciated
#define TIM_TC2L_BIT7                    This_symb_has_been_depreciated
#define TIM_TC2L_BIT0_MASK               This_symb_has_been_depreciated
#define TIM_TC2L_BIT1_MASK               This_symb_has_been_depreciated
#define TIM_TC2L_BIT2_MASK               This_symb_has_been_depreciated
#define TIM_TC2L_BIT3_MASK               This_symb_has_been_depreciated
#define TIM_TC2L_BIT4_MASK               This_symb_has_been_depreciated
#define TIM_TC2L_BIT5_MASK               This_symb_has_been_depreciated
#define TIM_TC2L_BIT6_MASK               This_symb_has_been_depreciated
#define TIM_TC2L_BIT7_MASK               This_symb_has_been_depreciated
#define TIM_TC2_BIT0                     This_symb_has_been_depreciated
#define TIM_TC2_BIT1                     This_symb_has_been_depreciated
#define TIM_TC2_BIT2                     This_symb_has_been_depreciated
#define TIM_TC2_BIT3                     This_symb_has_been_depreciated
#define TIM_TC2_BIT4                     This_symb_has_been_depreciated
#define TIM_TC2_BIT5                     This_symb_has_been_depreciated
#define TIM_TC2_BIT6                     This_symb_has_been_depreciated
#define TIM_TC2_BIT7                     This_symb_has_been_depreciated
#define TIM_TC2_BIT8                     This_symb_has_been_depreciated
#define TIM_TC2_BIT9                     This_symb_has_been_depreciated
#define TIM_TC2_BIT10                    This_symb_has_been_depreciated
#define TIM_TC2_BIT11                    This_symb_has_been_depreciated
#define TIM_TC2_BIT12                    This_symb_has_been_depreciated
#define TIM_TC2_BIT13                    This_symb_has_been_depreciated
#define TIM_TC2_BIT14                    This_symb_has_been_depreciated
#define TIM_TC2_BIT15                    This_symb_has_been_depreciated
#define TIM_TC2_BIT0_MASK                This_symb_has_been_depreciated
#define TIM_TC2_BIT1_MASK                This_symb_has_been_depreciated
#define TIM_TC2_BIT2_MASK                This_symb_has_been_depreciated
#define TIM_TC2_BIT3_MASK                This_symb_has_been_depreciated
#define TIM_TC2_BIT4_MASK                This_symb_has_been_depreciated
#define TIM_TC2_BIT5_MASK                This_symb_has_been_depreciated
#define TIM_TC2_BIT6_MASK                This_symb_has_been_depreciated
#define TIM_TC2_BIT7_MASK                This_symb_has_been_depreciated
#define TIM_TC2_BIT8_MASK                This_symb_has_been_depreciated
#define TIM_TC2_BIT9_MASK                This_symb_has_been_depreciated
#define TIM_TC2_BIT10_MASK               This_symb_has_been_depreciated
#define TIM_TC2_BIT11_MASK               This_symb_has_been_depreciated
#define TIM_TC2_BIT12_MASK               This_symb_has_been_depreciated
#define TIM_TC2_BIT13_MASK               This_symb_has_been_depreciated
#define TIM_TC2_BIT14_MASK               This_symb_has_been_depreciated
#define TIM_TC2_BIT15_MASK               This_symb_has_been_depreciated
#define TIM_TC3H                         TIM_TC3
#define TIM_TC3H_BIT8                    This_symb_has_been_depreciated
#define TIM_TC3H_BIT9                    This_symb_has_been_depreciated
#define TIM_TC3H_BIT10                   This_symb_has_been_depreciated
#define TIM_TC3H_BIT11                   This_symb_has_been_depreciated
#define TIM_TC3H_BIT12                   This_symb_has_been_depreciated
#define TIM_TC3H_BIT13                   This_symb_has_been_depreciated
#define TIM_TC3H_BIT14                   This_symb_has_been_depreciated
#define TIM_TC3H_BIT15                   This_symb_has_been_depreciated
#define TIM_TC3H_BIT8_MASK               This_symb_has_been_depreciated
#define TIM_TC3H_BIT9_MASK               This_symb_has_been_depreciated
#define TIM_TC3H_BIT10_MASK              This_symb_has_been_depreciated
#define TIM_TC3H_BIT11_MASK              This_symb_has_been_depreciated
#define TIM_TC3H_BIT12_MASK              This_symb_has_been_depreciated
#define TIM_TC3H_BIT13_MASK              This_symb_has_been_depreciated
#define TIM_TC3H_BIT14_MASK              This_symb_has_been_depreciated
#define TIM_TC3H_BIT15_MASK              This_symb_has_been_depreciated
#define TIM_TC3L                         TIM_TC3Lo
#define TIM_TC3L_BIT0                    This_symb_has_been_depreciated
#define TIM_TC3L_BIT1                    This_symb_has_been_depreciated
#define TIM_TC3L_BIT2                    This_symb_has_been_depreciated
#define TIM_TC3L_BIT3                    This_symb_has_been_depreciated
#define TIM_TC3L_BIT4                    This_symb_has_been_depreciated
#define TIM_TC3L_BIT5                    This_symb_has_been_depreciated
#define TIM_TC3L_BIT6                    This_symb_has_been_depreciated
#define TIM_TC3L_BIT7                    This_symb_has_been_depreciated
#define TIM_TC3L_BIT0_MASK               This_symb_has_been_depreciated
#define TIM_TC3L_BIT1_MASK               This_symb_has_been_depreciated
#define TIM_TC3L_BIT2_MASK               This_symb_has_been_depreciated
#define TIM_TC3L_BIT3_MASK               This_symb_has_been_depreciated
#define TIM_TC3L_BIT4_MASK               This_symb_has_been_depreciated
#define TIM_TC3L_BIT5_MASK               This_symb_has_been_depreciated
#define TIM_TC3L_BIT6_MASK               This_symb_has_been_depreciated
#define TIM_TC3L_BIT7_MASK               This_symb_has_been_depreciated
#define TIM_TC3_BIT0                     This_symb_has_been_depreciated
#define TIM_TC3_BIT1                     This_symb_has_been_depreciated
#define TIM_TC3_BIT2                     This_symb_has_been_depreciated
#define TIM_TC3_BIT3                     This_symb_has_been_depreciated
#define TIM_TC3_BIT4                     This_symb_has_been_depreciated
#define TIM_TC3_BIT5                     This_symb_has_been_depreciated
#define TIM_TC3_BIT6                     This_symb_has_been_depreciated
#define TIM_TC3_BIT7                     This_symb_has_been_depreciated
#define TIM_TC3_BIT8                     This_symb_has_been_depreciated
#define TIM_TC3_BIT9                     This_symb_has_been_depreciated
#define TIM_TC3_BIT10                    This_symb_has_been_depreciated
#define TIM_TC3_BIT11                    This_symb_has_been_depreciated
#define TIM_TC3_BIT12                    This_symb_has_been_depreciated
#define TIM_TC3_BIT13                    This_symb_has_been_depreciated
#define TIM_TC3_BIT14                    This_symb_has_been_depreciated
#define TIM_TC3_BIT15                    This_symb_has_been_depreciated
#define TIM_TC3_BIT0_MASK                This_symb_has_been_depreciated
#define TIM_TC3_BIT1_MASK                This_symb_has_been_depreciated
#define TIM_TC3_BIT2_MASK                This_symb_has_been_depreciated
#define TIM_TC3_BIT3_MASK                This_symb_has_been_depreciated
#define TIM_TC3_BIT4_MASK                This_symb_has_been_depreciated
#define TIM_TC3_BIT5_MASK                This_symb_has_been_depreciated
#define TIM_TC3_BIT6_MASK                This_symb_has_been_depreciated
#define TIM_TC3_BIT7_MASK                This_symb_has_been_depreciated
#define TIM_TC3_BIT8_MASK                This_symb_has_been_depreciated
#define TIM_TC3_BIT9_MASK                This_symb_has_been_depreciated
#define TIM_TC3_BIT10_MASK               This_symb_has_been_depreciated
#define TIM_TC3_BIT11_MASK               This_symb_has_been_depreciated
#define TIM_TC3_BIT12_MASK               This_symb_has_been_depreciated
#define TIM_TC3_BIT13_MASK               This_symb_has_been_depreciated
#define TIM_TC3_BIT14_MASK               This_symb_has_been_depreciated
#define TIM_TC3_BIT15_MASK               This_symb_has_been_depreciated
#define TIM_TC4H                         TIM_TC4
#define TIM_TC4H_BIT8                    This_symb_has_been_depreciated
#define TIM_TC4H_BIT9                    This_symb_has_been_depreciated
#define TIM_TC4H_BIT10                   This_symb_has_been_depreciated
#define TIM_TC4H_BIT11                   This_symb_has_been_depreciated
#define TIM_TC4H_BIT12                   This_symb_has_been_depreciated
#define TIM_TC4H_BIT13                   This_symb_has_been_depreciated
#define TIM_TC4H_BIT14                   This_symb_has_been_depreciated
#define TIM_TC4H_BIT15                   This_symb_has_been_depreciated
#define TIM_TC4H_BIT8_MASK               This_symb_has_been_depreciated
#define TIM_TC4H_BIT9_MASK               This_symb_has_been_depreciated
#define TIM_TC4H_BIT10_MASK              This_symb_has_been_depreciated
#define TIM_TC4H_BIT11_MASK              This_symb_has_been_depreciated
#define TIM_TC4H_BIT12_MASK              This_symb_has_been_depreciated
#define TIM_TC4H_BIT13_MASK              This_symb_has_been_depreciated
#define TIM_TC4H_BIT14_MASK              This_symb_has_been_depreciated
#define TIM_TC4H_BIT15_MASK              This_symb_has_been_depreciated
#define TIM_TC4L                         TIM_TC4Lo
#define TIM_TC4L_BIT0                    This_symb_has_been_depreciated
#define TIM_TC4L_BIT1                    This_symb_has_been_depreciated
#define TIM_TC4L_BIT2                    This_symb_has_been_depreciated
#define TIM_TC4L_BIT3                    This_symb_has_been_depreciated
#define TIM_TC4L_BIT4                    This_symb_has_been_depreciated
#define TIM_TC4L_BIT5                    This_symb_has_been_depreciated
#define TIM_TC4L_BIT6                    This_symb_has_been_depreciated
#define TIM_TC4L_BIT7                    This_symb_has_been_depreciated
#define TIM_TC4L_BIT0_MASK               This_symb_has_been_depreciated
#define TIM_TC4L_BIT1_MASK               This_symb_has_been_depreciated
#define TIM_TC4L_BIT2_MASK               This_symb_has_been_depreciated
#define TIM_TC4L_BIT3_MASK               This_symb_has_been_depreciated
#define TIM_TC4L_BIT4_MASK               This_symb_has_been_depreciated
#define TIM_TC4L_BIT5_MASK               This_symb_has_been_depreciated
#define TIM_TC4L_BIT6_MASK               This_symb_has_been_depreciated
#define TIM_TC4L_BIT7_MASK               This_symb_has_been_depreciated
#define TIM_TC4_BIT0                     This_symb_has_been_depreciated
#define TIM_TC4_BIT1                     This_symb_has_been_depreciated
#define TIM_TC4_BIT2                     This_symb_has_been_depreciated
#define TIM_TC4_BIT3                     This_symb_has_been_depreciated
#define TIM_TC4_BIT4                     This_symb_has_been_depreciated
#define TIM_TC4_BIT5                     This_symb_has_been_depreciated
#define TIM_TC4_BIT6                     This_symb_has_been_depreciated
#define TIM_TC4_BIT7                     This_symb_has_been_depreciated
#define TIM_TC4_BIT8                     This_symb_has_been_depreciated
#define TIM_TC4_BIT9                     This_symb_has_been_depreciated
#define TIM_TC4_BIT10                    This_symb_has_been_depreciated
#define TIM_TC4_BIT11                    This_symb_has_been_depreciated
#define TIM_TC4_BIT12                    This_symb_has_been_depreciated
#define TIM_TC4_BIT13                    This_symb_has_been_depreciated
#define TIM_TC4_BIT14                    This_symb_has_been_depreciated
#define TIM_TC4_BIT15                    This_symb_has_been_depreciated
#define TIM_TC4_BIT0_MASK                This_symb_has_been_depreciated
#define TIM_TC4_BIT1_MASK                This_symb_has_been_depreciated
#define TIM_TC4_BIT2_MASK                This_symb_has_been_depreciated
#define TIM_TC4_BIT3_MASK                This_symb_has_been_depreciated
#define TIM_TC4_BIT4_MASK                This_symb_has_been_depreciated
