Embedded-Software/Embedded-Sistems-Abr/Omicron_dynamic_memory/Sources/omicron_commons/omicron_cpu_commons/mc9s12xep100.h
#define TIM_TC4_BIT5_MASK                This_symb_has_been_depreciated
#define TIM_TC4_BIT6_MASK                This_symb_has_been_depreciated
#define TIM_TC4_BIT7_MASK                This_symb_has_been_depreciated
#define TIM_TC4_BIT8_MASK                This_symb_has_been_depreciated
#define TIM_TC4_BIT9_MASK                This_symb_has_been_depreciated
#define TIM_TC4_BIT10_MASK               This_symb_has_been_depreciated
#define TIM_TC4_BIT11_MASK               This_symb_has_been_depreciated
#define TIM_TC4_BIT12_MASK               This_symb_has_been_depreciated
#define TIM_TC4_BIT13_MASK               This_symb_has_been_depreciated
#define TIM_TC4_BIT14_MASK               This_symb_has_been_depreciated
#define TIM_TC4_BIT15_MASK               This_symb_has_been_depreciated
#define TIM_TC5H                         TIM_TC5
#define TIM_TC5H_BIT8                    This_symb_has_been_depreciated
#define TIM_TC5H_BIT9                    This_symb_has_been_depreciated
#define TIM_TC5H_BIT10                   This_symb_has_been_depreciated
#define TIM_TC5H_BIT11                   This_symb_has_been_depreciated
#define TIM_TC5H_BIT12                   This_symb_has_been_depreciated
#define TIM_TC5H_BIT13                   This_symb_has_been_depreciated
#define TIM_TC5H_BIT14                   This_symb_has_been_depreciated
#define TIM_TC5H_BIT15                   This_symb_has_been_depreciated
#define TIM_TC5H_BIT8_MASK               This_symb_has_been_depreciated
#define TIM_TC5H_BIT9_MASK               This_symb_has_been_depreciated
#define TIM_TC5H_BIT10_MASK              This_symb_has_been_depreciated
#define TIM_TC5H_BIT11_MASK              This_symb_has_been_depreciated
#define TIM_TC5H_BIT12_MASK              This_symb_has_been_depreciated
#define TIM_TC5H_BIT13_MASK              This_symb_has_been_depreciated
#define TIM_TC5H_BIT14_MASK              This_symb_has_been_depreciated
#define TIM_TC5H_BIT15_MASK              This_symb_has_been_depreciated
#define TIM_TC5L                         TIM_TC5Lo
#define TIM_TC5L_BIT0                    This_symb_has_been_depreciated
#define TIM_TC5L_BIT1                    This_symb_has_been_depreciated
#define TIM_TC5L_BIT2                    This_symb_has_been_depreciated
#define TIM_TC5L_BIT3                    This_symb_has_been_depreciated
#define TIM_TC5L_BIT4                    This_symb_has_been_depreciated
#define TIM_TC5L_BIT5                    This_symb_has_been_depreciated
#define TIM_TC5L_BIT6                    This_symb_has_been_depreciated
#define TIM_TC5L_BIT7                    This_symb_has_been_depreciated
#define TIM_TC5L_BIT0_MASK               This_symb_has_been_depreciated
#define TIM_TC5L_BIT1_MASK               This_symb_has_been_depreciated
#define TIM_TC5L_BIT2_MASK               This_symb_has_been_depreciated
#define TIM_TC5L_BIT3_MASK               This_symb_has_been_depreciated
#define TIM_TC5L_BIT4_MASK               This_symb_has_been_depreciated
#define TIM_TC5L_BIT5_MASK               This_symb_has_been_depreciated
#define TIM_TC5L_BIT6_MASK               This_symb_has_been_depreciated
#define TIM_TC5L_BIT7_MASK               This_symb_has_been_depreciated
#define TIM_TC5_BIT0                     This_symb_has_been_depreciated
#define TIM_TC5_BIT1                     This_symb_has_been_depreciated
#define TIM_TC5_BIT2                     This_symb_has_been_depreciated
#define TIM_TC5_BIT3                     This_symb_has_been_depreciated
#define TIM_TC5_BIT4                     This_symb_has_been_depreciated
#define TIM_TC5_BIT5                     This_symb_has_been_depreciated
#define TIM_TC5_BIT6                     This_symb_has_been_depreciated
#define TIM_TC5_BIT7                     This_symb_has_been_depreciated
#define TIM_TC5_BIT8                     This_symb_has_been_depreciated
#define TIM_TC5_BIT9                     This_symb_has_been_depreciated
#define TIM_TC5_BIT10                    This_symb_has_been_depreciated
#define TIM_TC5_BIT11                    This_symb_has_been_depreciated
#define TIM_TC5_BIT12                    This_symb_has_been_depreciated
#define TIM_TC5_BIT13                    This_symb_has_been_depreciated
#define TIM_TC5_BIT14                    This_symb_has_been_depreciated
#define TIM_TC5_BIT15                    This_symb_has_been_depreciated
#define TIM_TC5_BIT0_MASK                This_symb_has_been_depreciated
#define TIM_TC5_BIT1_MASK                This_symb_has_been_depreciated
#define TIM_TC5_BIT2_MASK                This_symb_has_been_depreciated
#define TIM_TC5_BIT3_MASK                This_symb_has_been_depreciated
#define TIM_TC5_BIT4_MASK                This_symb_has_been_depreciated
#define TIM_TC5_BIT5_MASK                This_symb_has_been_depreciated
#define TIM_TC5_BIT6_MASK                This_symb_has_been_depreciated
#define TIM_TC5_BIT7_MASK                This_symb_has_been_depreciated
#define TIM_TC5_BIT8_MASK                This_symb_has_been_depreciated
#define TIM_TC5_BIT9_MASK                This_symb_has_been_depreciated
#define TIM_TC5_BIT10_MASK               This_symb_has_been_depreciated
#define TIM_TC5_BIT11_MASK               This_symb_has_been_depreciated
#define TIM_TC5_BIT12_MASK               This_symb_has_been_depreciated
#define TIM_TC5_BIT13_MASK               This_symb_has_been_depreciated
#define TIM_TC5_BIT14_MASK               This_symb_has_been_depreciated
#define TIM_TC5_BIT15_MASK               This_symb_has_been_depreciated
#define TIM_TC6H                         TIM_TC6
#define TIM_TC6H_BIT8                    This_symb_has_been_depreciated
#define TIM_TC6H_BIT9                    This_symb_has_been_depreciated
#define TIM_TC6H_BIT10                   This_symb_has_been_depreciated
#define TIM_TC6H_BIT11                   This_symb_has_been_depreciated
#define TIM_TC6H_BIT12                   This_symb_has_been_depreciated
#define TIM_TC6H_BIT13                   This_symb_has_been_depreciated
#define TIM_TC6H_BIT14                   This_symb_has_been_depreciated
#define TIM_TC6H_BIT15                   This_symb_has_been_depreciated
#define TIM_TC6H_BIT8_MASK               This_symb_has_been_depreciated
#define TIM_TC6H_BIT9_MASK               This_symb_has_been_depreciated
#define TIM_TC6H_BIT10_MASK              This_symb_has_been_depreciated
#define TIM_TC6H_BIT11_MASK              This_symb_has_been_depreciated
#define TIM_TC6H_BIT12_MASK              This_symb_has_been_depreciated
#define TIM_TC6H_BIT13_MASK              This_symb_has_been_depreciated
#define TIM_TC6H_BIT14_MASK              This_symb_has_been_depreciated
#define TIM_TC6H_BIT15_MASK              This_symb_has_been_depreciated
#define TIM_TC6L                         TIM_TC6Lo
#define TIM_TC6L_BIT0                    This_symb_has_been_depreciated
#define TIM_TC6L_BIT1                    This_symb_has_been_depreciated
#define TIM_TC6L_BIT2                    This_symb_has_been_depreciated
#define TIM_TC6L_BIT3                    This_symb_has_been_depreciated
#define TIM_TC6L_BIT4                    This_symb_has_been_depreciated
#define TIM_TC6L_BIT5                    This_symb_has_been_depreciated
#define TIM_TC6L_BIT6                    This_symb_has_been_depreciated
#define TIM_TC6L_BIT7                    This_symb_has_been_depreciated
#define TIM_TC6L_BIT0_MASK               This_symb_has_been_depreciated
#define TIM_TC6L_BIT1_MASK               This_symb_has_been_depreciated
#define TIM_TC6L_BIT2_MASK               This_symb_has_been_depreciated
#define TIM_TC6L_BIT3_MASK               This_symb_has_been_depreciated
#define TIM_TC6L_BIT4_MASK               This_symb_has_been_depreciated
#define TIM_TC6L_BIT5_MASK               This_symb_has_been_depreciated
#define TIM_TC6L_BIT6_MASK               This_symb_has_been_depreciated
#define TIM_TC6L_BIT7_MASK               This_symb_has_been_depreciated
#define TIM_TC6_BIT0                     This_symb_has_been_depreciated
#define TIM_TC6_BIT1                     This_symb_has_been_depreciated
#define TIM_TC6_BIT2                     This_symb_has_been_depreciated
#define TIM_TC6_BIT3                     This_symb_has_been_depreciated
#define TIM_TC6_BIT4                     This_symb_has_been_depreciated
#define TIM_TC6_BIT5                     This_symb_has_been_depreciated
#define TIM_TC6_BIT6                     This_symb_has_been_depreciated
#define TIM_TC6_BIT7                     This_symb_has_been_depreciated
#define TIM_TC6_BIT8                     This_symb_has_been_depreciated
#define TIM_TC6_BIT9                     This_symb_has_been_depreciated
#define TIM_TC6_BIT10                    This_symb_has_been_depreciated
#define TIM_TC6_BIT11                    This_symb_has_been_depreciated
#define TIM_TC6_BIT12                    This_symb_has_been_depreciated
#define TIM_TC6_BIT13                    This_symb_has_been_depreciated
#define TIM_TC6_BIT14                    This_symb_has_been_depreciated
#define TIM_TC6_BIT15                    This_symb_has_been_depreciated
#define TIM_TC6_BIT0_MASK                This_symb_has_been_depreciated
#define TIM_TC6_BIT1_MASK                This_symb_has_been_depreciated
#define TIM_TC6_BIT2_MASK                This_symb_has_been_depreciated
#define TIM_TC6_BIT3_MASK                This_symb_has_been_depreciated
#define TIM_TC6_BIT4_MASK                This_symb_has_been_depreciated
#define TIM_TC6_BIT5_MASK                This_symb_has_been_depreciated
#define TIM_TC6_BIT6_MASK                This_symb_has_been_depreciated
#define TIM_TC6_BIT7_MASK                This_symb_has_been_depreciated
#define TIM_TC6_BIT8_MASK                This_symb_has_been_depreciated
#define TIM_TC6_BIT9_MASK                This_symb_has_been_depreciated
#define TIM_TC6_BIT10_MASK               This_symb_has_been_depreciated
#define TIM_TC6_BIT11_MASK               This_symb_has_been_depreciated
#define TIM_TC6_BIT12_MASK               This_symb_has_been_depreciated
#define TIM_TC6_BIT13_MASK               This_symb_has_been_depreciated
#define TIM_TC6_BIT14_MASK               This_symb_has_been_depreciated
#define TIM_TC6_BIT15_MASK               This_symb_has_been_depreciated
#define TIM_TC7H                         TIM_TC7
#define TIM_TC7H_BIT8                    This_symb_has_been_depreciated
#define TIM_TC7H_BIT9                    This_symb_has_been_depreciated
#define TIM_TC7H_BIT10                   This_symb_has_been_depreciated
#define TIM_TC7H_BIT11                   This_symb_has_been_depreciated
#define TIM_TC7H_BIT12                   This_symb_has_been_depreciated
#define TIM_TC7H_BIT13                   This_symb_has_been_depreciated
#define TIM_TC7H_BIT14                   This_symb_has_been_depreciated
#define TIM_TC7H_BIT15                   This_symb_has_been_depreciated
#define TIM_TC7H_BIT8_MASK               This_symb_has_been_depreciated
#define TIM_TC7H_BIT9_MASK               This_symb_has_been_depreciated
#define TIM_TC7H_BIT10_MASK              This_symb_has_been_depreciated
#define TIM_TC7H_BIT11_MASK              This_symb_has_been_depreciated
#define TIM_TC7H_BIT12_MASK              This_symb_has_been_depreciated
#define TIM_TC7H_BIT13_MASK              This_symb_has_been_depreciated
#define TIM_TC7H_BIT14_MASK              This_symb_has_been_depreciated
#define TIM_TC7H_BIT15_MASK              This_symb_has_been_depreciated
#define TIM_TC7L                         TIM_TC7Lo
#define TIM_TC7L_BIT0                    This_symb_has_been_depreciated
#define TIM_TC7L_BIT1                    This_symb_has_been_depreciated
#define TIM_TC7L_BIT2                    This_symb_has_been_depreciated
#define TIM_TC7L_BIT3                    This_symb_has_been_depreciated
#define TIM_TC7L_BIT4                    This_symb_has_been_depreciated
#define TIM_TC7L_BIT5                    This_symb_has_been_depreciated
#define TIM_TC7L_BIT6                    This_symb_has_been_depreciated
#define TIM_TC7L_BIT7                    This_symb_has_been_depreciated
#define TIM_TC7L_BIT0_MASK               This_symb_has_been_depreciated
#define TIM_TC7L_BIT1_MASK               This_symb_has_been_depreciated
#define TIM_TC7L_BIT2_MASK               This_symb_has_been_depreciated
#define TIM_TC7L_BIT3_MASK               This_symb_has_been_depreciated
#define TIM_TC7L_BIT4_MASK               This_symb_has_been_depreciated
#define TIM_TC7L_BIT5_MASK               This_symb_has_been_depreciated
#define TIM_TC7L_BIT6_MASK               This_symb_has_been_depreciated
#define TIM_TC7L_BIT7_MASK               This_symb_has_been_depreciated
#define TIM_TC7_BIT0                     This_symb_has_been_depreciated
#define TIM_TC7_BIT1                     This_symb_has_been_depreciated
#define TIM_TC7_BIT2                     This_symb_has_been_depreciated
#define TIM_TC7_BIT3                     This_symb_has_been_depreciated
#define TIM_TC7_BIT4                     This_symb_has_been_depreciated
#define TIM_TC7_BIT5                     This_symb_has_been_depreciated
#define TIM_TC7_BIT6                     This_symb_has_been_depreciated
#define TIM_TC7_BIT7                     This_symb_has_been_depreciated
#define TIM_TC7_BIT8                     This_symb_has_been_depreciated
#define TIM_TC7_BIT9                     This_symb_has_been_depreciated
#define TIM_TC7_BIT10                    This_symb_has_been_depreciated
#define TIM_TC7_BIT11                    This_symb_has_been_depreciated
#define TIM_TC7_BIT12                    This_symb_has_been_depreciated
#define TIM_TC7_BIT13                    This_symb_has_been_depreciated
#define TIM_TC7_BIT14                    This_symb_has_been_depreciated
#define TIM_TC7_BIT15                    This_symb_has_been_depreciated
#define TIM_TC7_BIT0_MASK                This_symb_has_been_depreciated
#define TIM_TC7_BIT1_MASK                This_symb_has_been_depreciated
#define TIM_TC7_BIT2_MASK                This_symb_has_been_depreciated
#define TIM_TC7_BIT3_MASK                This_symb_has_been_depreciated
#define TIM_TC7_BIT4_MASK                This_symb_has_been_depreciated
#define TIM_TC7_BIT5_MASK                This_symb_has_been_depreciated
#define TIM_TC7_BIT6_MASK                This_symb_has_been_depreciated
#define TIM_TC7_BIT7_MASK                This_symb_has_been_depreciated
#define TIM_TC7_BIT8_MASK                This_symb_has_been_depreciated
#define TIM_TC7_BIT9_MASK                This_symb_has_been_depreciated
#define TIM_TC7_BIT10_MASK               This_symb_has_been_depreciated
#define TIM_TC7_BIT11_MASK               This_symb_has_been_depreciated
#define TIM_TC7_BIT12_MASK               This_symb_has_been_depreciated
#define TIM_TC7_BIT13_MASK               This_symb_has_been_depreciated
#define TIM_TC7_BIT14_MASK               This_symb_has_been_depreciated
#define TIM_TC7_BIT15_MASK               This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT8                This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT9                This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT10               This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT11               This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT12               This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT13               This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT14               This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT15               This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT8_MASK           This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT9_MASK           This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT10_MASK          This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT11_MASK          This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT12_MASK          This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT13_MASK          This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT14_MASK          This_symb_has_been_depreciated
#define TIM_PACNTH_PACNT15_MASK          This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT0                This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT1                This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT2                This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT3                This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT4                This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT5                This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT6                This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT7                This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT0_MASK           This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT1_MASK           This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT2_MASK           This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT3_MASK           This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT4_MASK           This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT5_MASK           This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT6_MASK           This_symb_has_been_depreciated
#define TIM_PACNTL_PACNT7_MASK           This_symb_has_been_depreciated
#define TIM_PACNT_PACNT0                 This_symb_has_been_depreciated
#define TIM_PACNT_PACNT1                 This_symb_has_been_depreciated
#define TIM_PACNT_PACNT2                 This_symb_has_been_depreciated
#define TIM_PACNT_PACNT3                 This_symb_has_been_depreciated
#define TIM_PACNT_PACNT4                 This_symb_has_been_depreciated
#define TIM_PACNT_PACNT5                 This_symb_has_been_depreciated
#define TIM_PACNT_PACNT6                 This_symb_has_been_depreciated
#define TIM_PACNT_PACNT7                 This_symb_has_been_depreciated
#define TIM_PACNT_PACNT8                 This_symb_has_been_depreciated
#define TIM_PACNT_PACNT9                 This_symb_has_been_depreciated
#define TIM_PACNT_PACNT10                This_symb_has_been_depreciated
#define TIM_PACNT_PACNT11                This_symb_has_been_depreciated
#define TIM_PACNT_PACNT12                This_symb_has_been_depreciated
#define TIM_PACNT_PACNT13                This_symb_has_been_depreciated
#define TIM_PACNT_PACNT14                This_symb_has_been_depreciated
#define TIM_PACNT_PACNT15                This_symb_has_been_depreciated
#define TIM_PACNT_PACNT0_MASK            This_symb_has_been_depreciated
#define TIM_PACNT_PACNT1_MASK            This_symb_has_been_depreciated
#define TIM_PACNT_PACNT2_MASK            This_symb_has_been_depreciated
#define TIM_PACNT_PACNT3_MASK            This_symb_has_been_depreciated
#define TIM_PACNT_PACNT4_MASK            This_symb_has_been_depreciated
#define TIM_PACNT_PACNT5_MASK            This_symb_has_been_depreciated
#define TIM_PACNT_PACNT6_MASK            This_symb_has_been_depreciated
#define TIM_PACNT_PACNT7_MASK            This_symb_has_been_depreciated
#define TIM_PACNT_PACNT8_MASK            This_symb_has_been_depreciated
#define TIM_PACNT_PACNT9_MASK            This_symb_has_been_depreciated
#define TIM_PACNT_PACNT10_MASK           This_symb_has_been_depreciated
#define TIM_PACNT_PACNT11_MASK           This_symb_has_been_depreciated
#define TIM_PACNT_PACNT12_MASK           This_symb_has_been_depreciated
#define TIM_PACNT_PACNT13_MASK           This_symb_has_been_depreciated
#define TIM_PACNT_PACNT14_MASK           This_symb_has_been_depreciated
#define TIM_PACNT_PACNT15_MASK           This_symb_has_been_depreciated
#define TIM_TPORTE                       This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE0               This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE1               This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE2               This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE3               This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE4               This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE5               This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE6               This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE7               This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE0_MASK          This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE1_MASK          This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE2_MASK          This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE3_MASK          This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE4_MASK          This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE5_MASK          This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE6_MASK          This_symb_has_been_depreciated
#define TIM_TPORTE_TPORTE7_MASK          This_symb_has_been_depreciated
#define NVFSEC_RNV6                      NVFSEC_KEYEN0
#define NVFSEC_RNV6_MASK                 NVFSEC_KEYEN0_MASK

#ifndef __V30COMPATIBLE__
#pragma OPTION DEL V30toV31Compatible
#endif

#endif
